nicories/gyromouse/level/include/STM32F042x.h
/*
 * Copyright (c) 2009-2019 ARM Limited. All rights reserved.
 * 
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * @file     /home/nri/Uni/Semester_3/Rechnerorganisation/Labor/labor_4/level/STM32F042x.h
 * @brief    CMSIS HeaderFile
 * @version  1.0
 * @date     25. January 2020
 * @note     Generated by SVDConv V3.3.27 on Saturday, 25.01.2020 10:15:59
 *           from File '../STM32F042x.svd',
 */



/** @addtogroup 
  * @{
  */


/** @addtogroup STM32F042x
  * @{
  */


#ifndef STM32F042X_H
#define STM32F042X_H

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* =========================================  STM32F042x Specific Interrupt Numbers  ========================================= */
  WWDG_IRQn                 =   0,              /*!< 0  Window Watchdog interrupt                                              */
  PVD_IRQn                  =   1,              /*!< 1  PVD and VDDIO2 supply comparator interrupt                             */
  RTC_IRQn                  =   2,              /*!< 2  RTC interrupts                                                         */
  FLASH_IRQn                =   3,              /*!< 3  Flash global interrupt                                                 */
  RCC_CRS_IRQn              =   4,              /*!< 4  RCC and CRS global interrupts                                          */
  EXTI0_1_IRQn              =   5,              /*!< 5  EXTI Line[1:0] interrupts                                              */
  EXTI2_3_IRQn              =   6,              /*!< 6  EXTI Line[3:2] interrupts                                              */
  EXTI4_15_IRQn             =   7,              /*!< 7  EXTI Line15 and EXTI4 interrupts                                       */
  TSC_IRQn                  =   8,              /*!< 8  Touch sensing interrupt                                                */
  DMA_CH1_IRQn              =   9,              /*!< 9  DMA channel 1 interrupt                                                */
  DMA_CH2_3_IRQn            =  10,              /*!< 10 DMA channel 2 and 3 interrupts                                         */
  DMA_CH4_5_6_7_IRQn        =  11,              /*!< 11 DMA channel 4, 5, 6 and 7 interrupts                                   */
  ADC_COMP_IRQn             =  12,              /*!< 12 ADC and comparator interrupts                                          */
  TIM1_BRK_UP_TRG_COM_IRQn  =  13,              /*!< 13 TIM1 break, update, trigger and commutation interrupt                  */
  TIM1_CC_IRQn              =  14,              /*!< 14 TIM1 Capture Compare interrupt                                         */
  TIM2_IRQn                 =  15,              /*!< 15 TIM2 global interrupt                                                  */
  TIM3_IRQn                 =  16,              /*!< 16 TIM3 global interrupt                                                  */
  TIM14_IRQn                =  19,              /*!< 19 TIM14 global interrupt                                                 */
  TIM16_IRQn                =  21,              /*!< 21 TIM16 global interrupt                                                 */
  TIM17_IRQn                =  22,              /*!< 22 TIM17 global interrupt                                                 */
  I2C1_IRQn                 =  23,              /*!< 23 I2C1 global interrupt                                                  */
  SPI1_IRQn                 =  25,              /*!< 25 SPI1_global_interrupt                                                  */
  SPI2_IRQn                 =  26,              /*!< 26 SPI2 global interrupt                                                  */
  USART1_IRQn               =  27,              /*!< 27 USART1 global interrupt                                                */
  USART2_IRQn               =  28,              /*!< 28 USART2 global interrupt                                                */
  CEC_CAN_IRQn              =  30,              /*!< 30 CEC and CAN global interrupt                                           */
  USB_IRQn                  =  31               /*!< 31 USB global interrupt                                                   */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* =============================  Configuration of the undefined Processor and Core Peripherals  ============================= */
#define __UNDEF_REV                 0x0000U     /*!< undef Core Revision                                                       */
#define __NVIC_PRIO_BITS               0        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */


/** @} */ /* End of group Configuration_of_CMSIS */



/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief cyclic redundancy check calculation       unit (CRC)
  */

typedef struct {                                /*!< (@ 0x40023000) CRC Structure                                              */
  
  union {
    __IOM uint32_t DR;                          /*!< (@ 0x00000000) Data register                                              */
    
