nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t DR         : 32;           /*!< [31..0] Data register bits                                                */
    } DR_b;
  } ;
  
  union {
    __IOM uint32_t IDR;                         /*!< (@ 0x00000004) Independent data register                                  */
    
    struct {
      __IOM uint32_t IDR        : 8;            /*!< [7..0] General-purpose 8-bit data register bits                           */
    } IDR_b;
  } ;
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000008) Control register                                           */
    
    struct {
      __IOM uint32_t RESET      : 1;            /*!< [0..0] reset bit                                                          */
      __IM  uint32_t            : 4;
      __IOM uint32_t REV_IN     : 2;            /*!< [6..5] Reverse input data                                                 */
      __IOM uint32_t REV_OUT    : 1;            /*!< [7..7] Reverse output data                                                */
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t INIT;                        /*!< (@ 0x0000000C) Initial CRC value                                          */
    
    struct {
      __IOM uint32_t INIT       : 32;           /*!< [31..0] Programmable initial CRC value                                    */
    } INIT_b;
  } ;
} CRC_Type;                                     /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                           GPIOF                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIOF)
  */

typedef struct {                                /*!< (@ 0x48001400) GPIOF Structure                                            */
  
  union {
    __IOM uint32_t MODER;                       /*!< (@ 0x00000000) GPIO port mode register                                    */
    
    struct {
      __IOM uint32_t MODER0     : 2;            /*!< [1..0] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t MODER1     : 2;            /*!< [3..2] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t MODER2     : 2;            /*!< [5..4] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t MODER3     : 2;            /*!< [7..6] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t MODER4     : 2;            /*!< [9..8] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t MODER5     : 2;            /*!< [11..10] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER6     : 2;            /*!< [13..12] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER7     : 2;            /*!< [15..14] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER8     : 2;            /*!< [17..16] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER9     : 2;            /*!< [19..18] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER10    : 2;            /*!< [21..20] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER11    : 2;            /*!< [23..22] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER12    : 2;            /*!< [25..24] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER13    : 2;            /*!< [27..26] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER14    : 2;            /*!< [29..28] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER15    : 2;            /*!< [31..30] Port x configuration bits (y = 0..15)                            */
    } MODER_b;
  } ;
  
  union {
    __IOM uint32_t OTYPER;                      /*!< (@ 0x00000004) GPIO port output type register                             */
    
    struct {
      __IOM uint32_t OT0        : 1;            /*!< [0..0] Port x configuration bit 0                                         */
      __IOM uint32_t OT1        : 1;            /*!< [1..1] Port x configuration bit 1                                         */
      __IOM uint32_t OT2        : 1;            /*!< [2..2] Port x configuration bit 2                                         */
      __IOM uint32_t OT3        : 1;            /*!< [3..3] Port x configuration bit 3                                         */
      __IOM uint32_t OT4        : 1;            /*!< [4..4] Port x configuration bit 4                                         */
      __IOM uint32_t OT5        : 1;            /*!< [5..5] Port x configuration bit 5                                         */
      __IOM uint32_t OT6        : 1;            /*!< [6..6] Port x configuration bit 6                                         */
      __IOM uint32_t OT7        : 1;            /*!< [7..7] Port x configuration bit 7                                         */
      __IOM uint32_t OT8        : 1;            /*!< [8..8] Port x configuration bit 8                                         */
      __IOM uint32_t OT9        : 1;            /*!< [9..9] Port x configuration bit 9                                         */
      __IOM uint32_t OT10       : 1;            /*!< [10..10] Port x configuration bit 10                                      */
      __IOM uint32_t OT11       : 1;            /*!< [11..11] Port x configuration bit 11                                      */
      __IOM uint32_t OT12       : 1;            /*!< [12..12] Port x configuration bit 12                                      */
      __IOM uint32_t OT13       : 1;            /*!< [13..13] Port x configuration bit 13                                      */
      __IOM uint32_t OT14       : 1;            /*!< [14..14] Port x configuration bit 14                                      */
      __IOM uint32_t OT15       : 1;            /*!< [15..15] Port x configuration bit 15                                      */
    } OTYPER_b;
  } ;
  
  union {
    __IOM uint32_t OSPEEDR;                     /*!< (@ 0x00000008) GPIO port output speed register                            */
    
