nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t OSPEEDR0   : 2;            /*!< [1..0] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OSPEEDR1   : 2;            /*!< [3..2] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OSPEEDR2   : 2;            /*!< [5..4] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OSPEEDR3   : 2;            /*!< [7..6] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OSPEEDR4   : 2;            /*!< [9..8] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OSPEEDR5   : 2;            /*!< [11..10] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR6   : 2;            /*!< [13..12] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR7   : 2;            /*!< [15..14] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR8   : 2;            /*!< [17..16] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR9   : 2;            /*!< [19..18] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR10  : 2;            /*!< [21..20] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR11  : 2;            /*!< [23..22] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR12  : 2;            /*!< [25..24] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR13  : 2;            /*!< [27..26] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR14  : 2;            /*!< [29..28] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR15  : 2;            /*!< [31..30] Port x configuration bits (y = 0..15)                            */
    } OSPEEDR_b;
  } ;
  
  union {
    __IOM uint32_t PUPDR;                       /*!< (@ 0x0000000C) GPIO port pull-up/pull-down register                       */
    
    struct {
      __IOM uint32_t PUPDR0     : 2;            /*!< [1..0] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t PUPDR1     : 2;            /*!< [3..2] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t PUPDR2     : 2;            /*!< [5..4] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t PUPDR3     : 2;            /*!< [7..6] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t PUPDR4     : 2;            /*!< [9..8] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t PUPDR5     : 2;            /*!< [11..10] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t PUPDR6     : 2;            /*!< [13..12] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t PUPDR7     : 2;            /*!< [15..14] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t PUPDR8     : 2;            /*!< [17..16] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t PUPDR9     : 2;            /*!< [19..18] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t PUPDR10    : 2;            /*!< [21..20] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t PUPDR11    : 2;            /*!< [23..22] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t PUPDR12    : 2;            /*!< [25..24] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t PUPDR13    : 2;            /*!< [27..26] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t PUPDR14    : 2;            /*!< [29..28] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t PUPDR15    : 2;            /*!< [31..30] Port x configuration bits (y = 0..15)                            */
    } PUPDR_b;
  } ;
  
  union {
    __IM  uint32_t IDR;                         /*!< (@ 0x00000010) GPIO port input data register                              */
    
    struct {
      __IM  uint32_t IDR0       : 1;            /*!< [0..0] Port input data (y = 0..15)                                        */
      __IM  uint32_t IDR1       : 1;            /*!< [1..1] Port input data (y = 0..15)                                        */
      __IM  uint32_t IDR2       : 1;            /*!< [2..2] Port input data (y = 0..15)                                        */
      __IM  uint32_t IDR3       : 1;            /*!< [3..3] Port input data (y = 0..15)                                        */
      __IM  uint32_t IDR4       : 1;            /*!< [4..4] Port input data (y = 0..15)                                        */
      __IM  uint32_t IDR5       : 1;            /*!< [5..5] Port input data (y = 0..15)                                        */
      __IM  uint32_t IDR6       : 1;            /*!< [6..6] Port input data (y = 0..15)                                        */
      __IM  uint32_t IDR7       : 1;            /*!< [7..7] Port input data (y = 0..15)                                        */
      __IM  uint32_t IDR8       : 1;            /*!< [8..8] Port input data (y = 0..15)                                        */
      __IM  uint32_t IDR9       : 1;            /*!< [9..9] Port input data (y = 0..15)                                        */
      __IM  uint32_t IDR10      : 1;            /*!< [10..10] Port input data (y = 0..15)                                      */
      __IM  uint32_t IDR11      : 1;            /*!< [11..11] Port input data (y = 0..15)                                      */
      __IM  uint32_t IDR12      : 1;            /*!< [12..12] Port input data (y = 0..15)                                      */
      __IM  uint32_t IDR13      : 1;            /*!< [13..13] Port input data (y = 0..15)                                      */
      __IM  uint32_t IDR14      : 1;            /*!< [14..14] Port input data (y = 0..15)                                      */
      __IM  uint32_t IDR15      : 1;            /*!< [15..15] Port input data (y = 0..15)                                      */
    } IDR_b;
  } ;
  
  union {
    __IOM uint32_t ODR;                         /*!< (@ 0x00000014) GPIO port output data register                             */
    
