nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t ODR0       : 1;            /*!< [0..0] Port output data (y = 0..15)                                       */
      __IOM uint32_t ODR1       : 1;            /*!< [1..1] Port output data (y = 0..15)                                       */
      __IOM uint32_t ODR2       : 1;            /*!< [2..2] Port output data (y = 0..15)                                       */
      __IOM uint32_t ODR3       : 1;            /*!< [3..3] Port output data (y = 0..15)                                       */
      __IOM uint32_t ODR4       : 1;            /*!< [4..4] Port output data (y = 0..15)                                       */
      __IOM uint32_t ODR5       : 1;            /*!< [5..5] Port output data (y = 0..15)                                       */
      __IOM uint32_t ODR6       : 1;            /*!< [6..6] Port output data (y = 0..15)                                       */
      __IOM uint32_t ODR7       : 1;            /*!< [7..7] Port output data (y = 0..15)                                       */
      __IOM uint32_t ODR8       : 1;            /*!< [8..8] Port output data (y = 0..15)                                       */
      __IOM uint32_t ODR9       : 1;            /*!< [9..9] Port output data (y = 0..15)                                       */
      __IOM uint32_t ODR10      : 1;            /*!< [10..10] Port output data (y = 0..15)                                     */
      __IOM uint32_t ODR11      : 1;            /*!< [11..11] Port output data (y = 0..15)                                     */
      __IOM uint32_t ODR12      : 1;            /*!< [12..12] Port output data (y = 0..15)                                     */
      __IOM uint32_t ODR13      : 1;            /*!< [13..13] Port output data (y = 0..15)                                     */
      __IOM uint32_t ODR14      : 1;            /*!< [14..14] Port output data (y = 0..15)                                     */
      __IOM uint32_t ODR15      : 1;            /*!< [15..15] Port output data (y = 0..15)                                     */
    } ODR_b;
  } ;
  
  union {
    __OM  uint32_t BSRR;                        /*!< (@ 0x00000018) GPIO port bit set/reset register                           */
    
    struct {
      __OM  uint32_t BS0        : 1;            /*!< [0..0] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS1        : 1;            /*!< [1..1] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS2        : 1;            /*!< [2..2] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS3        : 1;            /*!< [3..3] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS4        : 1;            /*!< [4..4] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS5        : 1;            /*!< [5..5] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS6        : 1;            /*!< [6..6] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS7        : 1;            /*!< [7..7] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS8        : 1;            /*!< [8..8] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS9        : 1;            /*!< [9..9] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS10       : 1;            /*!< [10..10] Port x set bit y (y= 0..15)                                      */
      __OM  uint32_t BS11       : 1;            /*!< [11..11] Port x set bit y (y= 0..15)                                      */
      __OM  uint32_t BS12       : 1;            /*!< [12..12] Port x set bit y (y= 0..15)                                      */
      __OM  uint32_t BS13       : 1;            /*!< [13..13] Port x set bit y (y= 0..15)                                      */
      __OM  uint32_t BS14       : 1;            /*!< [14..14] Port x set bit y (y= 0..15)                                      */
      __OM  uint32_t BS15       : 1;            /*!< [15..15] Port x set bit y (y= 0..15)                                      */
      __OM  uint32_t BR0        : 1;            /*!< [16..16] Port x set bit y (y= 0..15)                                      */
      __OM  uint32_t BR1        : 1;            /*!< [17..17] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR2        : 1;            /*!< [18..18] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR3        : 1;            /*!< [19..19] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR4        : 1;            /*!< [20..20] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR5        : 1;            /*!< [21..21] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR6        : 1;            /*!< [22..22] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR7        : 1;            /*!< [23..23] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR8        : 1;            /*!< [24..24] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR9        : 1;            /*!< [25..25] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR10       : 1;            /*!< [26..26] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR11       : 1;            /*!< [27..27] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR12       : 1;            /*!< [28..28] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR13       : 1;            /*!< [29..29] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR14       : 1;            /*!< [30..30] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR15       : 1;            /*!< [31..31] Port x reset bit y (y = 0..15)                                   */
    } BSRR_b;
  } ;
  
  union {
    __IOM uint32_t LCKR;                        /*!< (@ 0x0000001C) GPIO port configuration lock register                      */
    
