nicories/gyromouse/level/include/STM32F042x.h
typedef struct {                                /*!< (@ 0x48000000) GPIOA Structure                                            */
  
  union {
    __IOM uint32_t MODER;                       /*!< (@ 0x00000000) GPIO port mode register                                    */
    
    struct {
      __IOM uint32_t MODER0     : 2;            /*!< [1..0] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t MODER1     : 2;            /*!< [3..2] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t MODER2     : 2;            /*!< [5..4] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t MODER3     : 2;            /*!< [7..6] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t MODER4     : 2;            /*!< [9..8] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t MODER5     : 2;            /*!< [11..10] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER6     : 2;            /*!< [13..12] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER7     : 2;            /*!< [15..14] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER8     : 2;            /*!< [17..16] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER9     : 2;            /*!< [19..18] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER10    : 2;            /*!< [21..20] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER11    : 2;            /*!< [23..22] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER12    : 2;            /*!< [25..24] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER13    : 2;            /*!< [27..26] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER14    : 2;            /*!< [29..28] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t MODER15    : 2;            /*!< [31..30] Port x configuration bits (y = 0..15)                            */
    } MODER_b;
  } ;
  
  union {
    __IOM uint32_t OTYPER;                      /*!< (@ 0x00000004) GPIO port output type register                             */
    
    struct {
      __IOM uint32_t OT0        : 1;            /*!< [0..0] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OT1        : 1;            /*!< [1..1] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OT2        : 1;            /*!< [2..2] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OT3        : 1;            /*!< [3..3] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OT4        : 1;            /*!< [4..4] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OT5        : 1;            /*!< [5..5] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OT6        : 1;            /*!< [6..6] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OT7        : 1;            /*!< [7..7] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OT8        : 1;            /*!< [8..8] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OT9        : 1;            /*!< [9..9] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OT10       : 1;            /*!< [10..10] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OT11       : 1;            /*!< [11..11] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OT12       : 1;            /*!< [12..12] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OT13       : 1;            /*!< [13..13] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OT14       : 1;            /*!< [14..14] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OT15       : 1;            /*!< [15..15] Port x configuration bits (y = 0..15)                            */
    } OTYPER_b;
  } ;
  
  union {
    __IOM uint32_t OSPEEDR;                     /*!< (@ 0x00000008) GPIO port output speed register                            */
    
    struct {
      __IOM uint32_t OSPEEDR0   : 2;            /*!< [1..0] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OSPEEDR1   : 2;            /*!< [3..2] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OSPEEDR2   : 2;            /*!< [5..4] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OSPEEDR3   : 2;            /*!< [7..6] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OSPEEDR4   : 2;            /*!< [9..8] Port x configuration bits (y = 0..15)                              */
      __IOM uint32_t OSPEEDR5   : 2;            /*!< [11..10] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR6   : 2;            /*!< [13..12] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR7   : 2;            /*!< [15..14] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR8   : 2;            /*!< [17..16] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR9   : 2;            /*!< [19..18] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR10  : 2;            /*!< [21..20] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR11  : 2;            /*!< [23..22] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR12  : 2;            /*!< [25..24] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR13  : 2;            /*!< [27..26] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR14  : 2;            /*!< [29..28] Port x configuration bits (y = 0..15)                            */
      __IOM uint32_t OSPEEDR15  : 2;            /*!< [31..30] Port x configuration bits (y = 0..15)                            */
    } OSPEEDR_b;
  } ;
  
  union {
    __IOM uint32_t PUPDR;                       /*!< (@ 0x0000000C) GPIO port pull-up/pull-down register                       */
    
