nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __OM  uint32_t BS0        : 1;            /*!< [0..0] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS1        : 1;            /*!< [1..1] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS2        : 1;            /*!< [2..2] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS3        : 1;            /*!< [3..3] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS4        : 1;            /*!< [4..4] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS5        : 1;            /*!< [5..5] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS6        : 1;            /*!< [6..6] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS7        : 1;            /*!< [7..7] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS8        : 1;            /*!< [8..8] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS9        : 1;            /*!< [9..9] Port x set bit y (y= 0..15)                                        */
      __OM  uint32_t BS10       : 1;            /*!< [10..10] Port x set bit y (y= 0..15)                                      */
      __OM  uint32_t BS11       : 1;            /*!< [11..11] Port x set bit y (y= 0..15)                                      */
      __OM  uint32_t BS12       : 1;            /*!< [12..12] Port x set bit y (y= 0..15)                                      */
      __OM  uint32_t BS13       : 1;            /*!< [13..13] Port x set bit y (y= 0..15)                                      */
      __OM  uint32_t BS14       : 1;            /*!< [14..14] Port x set bit y (y= 0..15)                                      */
      __OM  uint32_t BS15       : 1;            /*!< [15..15] Port x set bit y (y= 0..15)                                      */
      __OM  uint32_t BR0        : 1;            /*!< [16..16] Port x set bit y (y= 0..15)                                      */
      __OM  uint32_t BR1        : 1;            /*!< [17..17] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR2        : 1;            /*!< [18..18] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR3        : 1;            /*!< [19..19] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR4        : 1;            /*!< [20..20] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR5        : 1;            /*!< [21..21] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR6        : 1;            /*!< [22..22] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR7        : 1;            /*!< [23..23] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR8        : 1;            /*!< [24..24] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR9        : 1;            /*!< [25..25] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR10       : 1;            /*!< [26..26] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR11       : 1;            /*!< [27..27] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR12       : 1;            /*!< [28..28] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR13       : 1;            /*!< [29..29] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR14       : 1;            /*!< [30..30] Port x reset bit y (y = 0..15)                                   */
      __OM  uint32_t BR15       : 1;            /*!< [31..31] Port x reset bit y (y = 0..15)                                   */
    } BSRR_b;
  } ;
  
  union {
    __IOM uint32_t LCKR;                        /*!< (@ 0x0000001C) GPIO port configuration lock register                      */
    
    struct {
      __IOM uint32_t LCK0       : 1;            /*!< [0..0] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32_t LCK1       : 1;            /*!< [1..1] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32_t LCK2       : 1;            /*!< [2..2] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32_t LCK3       : 1;            /*!< [3..3] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32_t LCK4       : 1;            /*!< [4..4] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32_t LCK5       : 1;            /*!< [5..5] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32_t LCK6       : 1;            /*!< [6..6] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32_t LCK7       : 1;            /*!< [7..7] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32_t LCK8       : 1;            /*!< [8..8] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32_t LCK9       : 1;            /*!< [9..9] Port x lock bit y (y= 0..15)                                       */
      __IOM uint32_t LCK10      : 1;            /*!< [10..10] Port x lock bit y (y= 0..15)                                     */
      __IOM uint32_t LCK11      : 1;            /*!< [11..11] Port x lock bit y (y= 0..15)                                     */
      __IOM uint32_t LCK12      : 1;            /*!< [12..12] Port x lock bit y (y= 0..15)                                     */
      __IOM uint32_t LCK13      : 1;            /*!< [13..13] Port x lock bit y (y= 0..15)                                     */
      __IOM uint32_t LCK14      : 1;            /*!< [14..14] Port x lock bit y (y= 0..15)                                     */
      __IOM uint32_t LCK15      : 1;            /*!< [15..15] Port x lock bit y (y= 0..15)                                     */
      __IOM uint32_t LCKK       : 1;            /*!< [16..16] Port x lock bit y (y= 0..15)                                     */
    } LCKR_b;
  } ;
  
  union {
    __IOM uint32_t AFRL;                        /*!< (@ 0x00000020) GPIO alternate function low register                       */
    
