nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t AFRL0      : 4;            /*!< [3..0] Alternate function selection for port x bit y (y = 0..7)           */
      __IOM uint32_t AFRL1      : 4;            /*!< [7..4] Alternate function selection for port x bit y (y = 0..7)           */
      __IOM uint32_t AFRL2      : 4;            /*!< [11..8] Alternate function selection for port x bit y (y = 0..7)          */
      __IOM uint32_t AFRL3      : 4;            /*!< [15..12] Alternate function selection for port x bit y (y =
                                                     0..7)                                                                     */
      __IOM uint32_t AFRL4      : 4;            /*!< [19..16] Alternate function selection for port x bit y (y =
                                                     0..7)                                                                     */
      __IOM uint32_t AFRL5      : 4;            /*!< [23..20] Alternate function selection for port x bit y (y =
                                                     0..7)                                                                     */
      __IOM uint32_t AFRL6      : 4;            /*!< [27..24] Alternate function selection for port x bit y (y =
                                                     0..7)                                                                     */
      __IOM uint32_t AFRL7      : 4;            /*!< [31..28] Alternate function selection for port x bit y (y =
                                                     0..7)                                                                     */
    } AFRL_b;
  } ;
  
  union {
    __IOM uint32_t AFRH;                        /*!< (@ 0x00000024) GPIO alternate function high register                      */
    
    struct {
      __IOM uint32_t AFRH8      : 4;            /*!< [3..0] Alternate function selection for port x bit y (y = 8..15)          */
      __IOM uint32_t AFRH9      : 4;            /*!< [7..4] Alternate function selection for port x bit y (y = 8..15)          */
      __IOM uint32_t AFRH10     : 4;            /*!< [11..8] Alternate function selection for port x bit y (y = 8..15)         */
      __IOM uint32_t AFRH11     : 4;            /*!< [15..12] Alternate function selection for port x bit y (y =
                                                     8..15)                                                                    */
      __IOM uint32_t AFRH12     : 4;            /*!< [19..16] Alternate function selection for port x bit y (y =
                                                     8..15)                                                                    */
      __IOM uint32_t AFRH13     : 4;            /*!< [23..20] Alternate function selection for port x bit y (y =
                                                     8..15)                                                                    */
      __IOM uint32_t AFRH14     : 4;            /*!< [27..24] Alternate function selection for port x bit y (y =
                                                     8..15)                                                                    */
      __IOM uint32_t AFRH15     : 4;            /*!< [31..28] Alternate function selection for port x bit y (y =
                                                     8..15)                                                                    */
    } AFRH_b;
  } ;
  
  union {
    __OM  uint32_t BRR;                         /*!< (@ 0x00000028) Port bit reset register                                    */
    
    struct {
      __OM  uint32_t BR0        : 1;            /*!< [0..0] Port x Reset bit y                                                 */
      __OM  uint32_t BR1        : 1;            /*!< [1..1] Port x Reset bit y                                                 */
      __OM  uint32_t BR2        : 1;            /*!< [2..2] Port x Reset bit y                                                 */
      __OM  uint32_t BR3        : 1;            /*!< [3..3] Port x Reset bit y                                                 */
      __OM  uint32_t BR4        : 1;            /*!< [4..4] Port x Reset bit y                                                 */
      __OM  uint32_t BR5        : 1;            /*!< [5..5] Port x Reset bit y                                                 */
      __OM  uint32_t BR6        : 1;            /*!< [6..6] Port x Reset bit y                                                 */
      __OM  uint32_t BR7        : 1;            /*!< [7..7] Port x Reset bit y                                                 */
      __OM  uint32_t BR8        : 1;            /*!< [8..8] Port x Reset bit y                                                 */
      __OM  uint32_t BR9        : 1;            /*!< [9..9] Port x Reset bit y                                                 */
      __OM  uint32_t BR10       : 1;            /*!< [10..10] Port x Reset bit y                                               */
      __OM  uint32_t BR11       : 1;            /*!< [11..11] Port x Reset bit y                                               */
      __OM  uint32_t BR12       : 1;            /*!< [12..12] Port x Reset bit y                                               */
      __OM  uint32_t BR13       : 1;            /*!< [13..13] Port x Reset bit y                                               */
      __OM  uint32_t BR14       : 1;            /*!< [14..14] Port x Reset bit y                                               */
      __OM  uint32_t BR15       : 1;            /*!< [15..15] Port x Reset bit y                                               */
    } BRR_b;
  } ;
} GPIOA_Type;                                   /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                           SPI1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial peripheral interface (SPI1)
  */

