nicories/gyromouse/level/include/STM32F042x.h
typedef struct {                                /*!< (@ 0x40013000) SPI1 Structure                                             */
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000000) control register 1                                         */
    
    struct {
      __IOM uint32_t CPHA       : 1;            /*!< [0..0] Clock phase                                                        */
      __IOM uint32_t CPOL       : 1;            /*!< [1..1] Clock polarity                                                     */
      __IOM uint32_t MSTR       : 1;            /*!< [2..2] Master selection                                                   */
      __IOM uint32_t BR         : 3;            /*!< [5..3] Baud rate control                                                  */
      __IOM uint32_t SPE        : 1;            /*!< [6..6] SPI enable                                                         */
      __IOM uint32_t LSBFIRST   : 1;            /*!< [7..7] Frame format                                                       */
      __IOM uint32_t SSI        : 1;            /*!< [8..8] Internal slave select                                              */
      __IOM uint32_t SSM        : 1;            /*!< [9..9] Software slave management                                          */
      __IOM uint32_t RXONLY     : 1;            /*!< [10..10] Receive only                                                     */
      __IOM uint32_t DFF        : 1;            /*!< [11..11] Data frame format                                                */
      __IOM uint32_t CRCNEXT    : 1;            /*!< [12..12] CRC transfer next                                                */
      __IOM uint32_t CRCEN      : 1;            /*!< [13..13] Hardware CRC calculation enable                                  */
      __IOM uint32_t BIDIOE     : 1;            /*!< [14..14] Output enable in bidirectional mode                              */
      __IOM uint32_t BIDIMODE   : 1;            /*!< [15..15] Bidirectional data mode enable                                   */
    } CR1_b;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x00000004) control register 2                                         */
    
    struct {
      __IOM uint32_t RXDMAEN    : 1;            /*!< [0..0] Rx buffer DMA enable                                               */
      __IOM uint32_t TXDMAEN    : 1;            /*!< [1..1] Tx buffer DMA enable                                               */
      __IOM uint32_t SSOE       : 1;            /*!< [2..2] SS output enable                                                   */
      __IOM uint32_t NSSP       : 1;            /*!< [3..3] NSS pulse management                                               */
      __IOM uint32_t FRF        : 1;            /*!< [4..4] Frame format                                                       */
      __IOM uint32_t ERRIE      : 1;            /*!< [5..5] Error interrupt enable                                             */
      __IOM uint32_t RXNEIE     : 1;            /*!< [6..6] RX buffer not empty interrupt enable                               */
      __IOM uint32_t TXEIE      : 1;            /*!< [7..7] Tx buffer empty interrupt enable                                   */
      __IOM uint32_t DS         : 4;            /*!< [11..8] Data size                                                         */
      __IOM uint32_t FRXTH      : 1;            /*!< [12..12] FIFO reception threshold                                         */
      __IOM uint32_t LDMA_RX    : 1;            /*!< [13..13] Last DMA transfer for reception                                  */
      __IOM uint32_t LDMA_TX    : 1;            /*!< [14..14] Last DMA transfer for transmission                               */
    } CR2_b;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< (@ 0x00000008) status register                                            */
    
    struct {
      __IM  uint32_t RXNE       : 1;            /*!< [0..0] Receive buffer not empty                                           */
      __IM  uint32_t TXE        : 1;            /*!< [1..1] Transmit buffer empty                                              */
      __IM  uint32_t CHSIDE     : 1;            /*!< [2..2] Channel side                                                       */
      __IM  uint32_t UDR        : 1;            /*!< [3..3] Underrun flag                                                      */
      __IOM uint32_t CRCERR     : 1;            /*!< [4..4] CRC error flag                                                     */
      __IM  uint32_t MODF       : 1;            /*!< [5..5] Mode fault                                                         */
      __IM  uint32_t OVR        : 1;            /*!< [6..6] Overrun flag                                                       */
      __IM  uint32_t BSY        : 1;            /*!< [7..7] Busy flag                                                          */
      __IM  uint32_t TIFRFE     : 1;            /*!< [8..8] TI frame format error                                              */
      __IM  uint32_t FRLVL      : 2;            /*!< [10..9] FIFO reception level                                              */
      __IM  uint32_t FTLVL      : 2;            /*!< [12..11] FIFO transmission level                                          */
    } SR_b;
  } ;
  
  union {
    __IOM uint32_t DR;                          /*!< (@ 0x0000000C) data register                                              */
    
    struct {
      __IOM uint32_t DR         : 16;           /*!< [15..0] Data register                                                     */
    } DR_b;
  } ;
  
  union {
    __IOM uint32_t CRCPR;                       /*!< (@ 0x00000010) CRC polynomial register                                    */
    
    struct {
      __IOM uint32_t CRCPOLY    : 16;           /*!< [15..0] CRC polynomial register                                           */
    } CRCPR_b;
  } ;
  
  union {
    __IM  uint32_t RXCRCR;                      /*!< (@ 0x00000014) RX CRC register                                            */
    
