nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IM  uint32_t RxCRC      : 16;           /*!< [15..0] Rx CRC register                                                   */
    } RXCRCR_b;
  } ;
  
  union {
    __IM  uint32_t TXCRCR;                      /*!< (@ 0x00000018) TX CRC register                                            */
    
    struct {
      __IM  uint32_t TxCRC      : 16;           /*!< [15..0] Tx CRC register                                                   */
    } TXCRCR_b;
  } ;
  
  union {
    __IOM uint32_t I2SCFGR;                     /*!< (@ 0x0000001C) I2S configuration register                                 */
    
    struct {
      __IOM uint32_t CHLEN      : 1;            /*!< [0..0] Channel length (number of bits per audio channel)                  */
      __IOM uint32_t DATLEN     : 2;            /*!< [2..1] Data length to be transferred                                      */
      __IOM uint32_t CKPOL      : 1;            /*!< [3..3] Steady state clock polarity                                        */
      __IOM uint32_t I2SSTD     : 2;            /*!< [5..4] I2S standard selection                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t PCMSYNC    : 1;            /*!< [7..7] PCM frame synchronization                                          */
      __IOM uint32_t I2SCFG     : 2;            /*!< [9..8] I2S configuration mode                                             */
      __IOM uint32_t I2SE       : 1;            /*!< [10..10] I2S Enable                                                       */
      __IOM uint32_t I2SMOD     : 1;            /*!< [11..11] I2S mode selection                                               */
    } I2SCFGR_b;
  } ;
  
  union {
    __IOM uint32_t I2SPR;                       /*!< (@ 0x00000020) I2S prescaler register                                     */
    
    struct {
      __IOM uint32_t I2SDIV     : 8;            /*!< [7..0] I2S Linear prescaler                                               */
      __IOM uint32_t ODD        : 1;            /*!< [8..8] Odd factor for the prescaler                                       */
      __IOM uint32_t MCKOE      : 1;            /*!< [9..9] Master clock output enable                                         */
    } I2SPR_b;
  } ;
} SPI1_Type;                                    /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                            PWR                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Power control (PWR)
  */

typedef struct {                                /*!< (@ 0x40007000) PWR Structure                                              */
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) power control register                                     */
    
    struct {
      __IOM uint32_t LPDS       : 1;            /*!< [0..0] Low-power deep sleep                                               */
      __IOM uint32_t PDDS       : 1;            /*!< [1..1] Power down deepsleep                                               */
      __IOM uint32_t CWUF       : 1;            /*!< [2..2] Clear wakeup flag                                                  */
      __IOM uint32_t CSBF       : 1;            /*!< [3..3] Clear standby flag                                                 */
      __IOM uint32_t PVDE       : 1;            /*!< [4..4] Power voltage detector enable                                      */
      __IOM uint32_t PLS        : 3;            /*!< [7..5] PVD level selection                                                */
      __IOM uint32_t DBP        : 1;            /*!< [8..8] Disable backup domain write protection                             */
      __IOM uint32_t FPDS       : 1;            /*!< [9..9] Flash power down in Stop mode                                      */
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t CSR;                         /*!< (@ 0x00000004) power control/status register                              */
    
    struct {
      __IM  uint32_t WUF        : 1;            /*!< [0..0] Wakeup flag                                                        */
      __IM  uint32_t SBF        : 1;            /*!< [1..1] Standby flag                                                       */
      __IM  uint32_t PVDO       : 1;            /*!< [2..2] PVD output                                                         */
      __IM  uint32_t BRR        : 1;            /*!< [3..3] Backup regulator ready                                             */
      __IM  uint32_t            : 4;
      __IOM uint32_t EWUP       : 1;            /*!< [8..8] Enable WKUP pin                                                    */
      __IOM uint32_t BRE        : 1;            /*!< [9..9] Backup regulator enable                                            */
    } CSR_b;
  } ;
} PWR_Type;                                     /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                           I2C1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Inter-integrated circuit (I2C1)
  */

typedef struct {                                /*!< (@ 0x40005400) I2C1 Structure                                             */
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000000) Control register 1                                         */
    
