nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t PE         : 1;            /*!< [0..0] Peripheral enable                                                  */
      __IOM uint32_t TXIE       : 1;            /*!< [1..1] TX Interrupt enable                                                */
      __IOM uint32_t RXIE       : 1;            /*!< [2..2] RX Interrupt enable                                                */
      __IOM uint32_t ADDRIE     : 1;            /*!< [3..3] Address match interrupt enable (slave only)                        */
      __IOM uint32_t NACKIE     : 1;            /*!< [4..4] Not acknowledge received interrupt enable                          */
      __IOM uint32_t STOPIE     : 1;            /*!< [5..5] STOP detection Interrupt enable                                    */
      __IOM uint32_t TCIE       : 1;            /*!< [6..6] Transfer Complete interrupt enable                                 */
      __IOM uint32_t ERRIE      : 1;            /*!< [7..7] Error interrupts enable                                            */
      __IOM uint32_t DNF        : 4;            /*!< [11..8] Digital noise filter                                              */
      __IOM uint32_t ANFOFF     : 1;            /*!< [12..12] Analog noise filter OFF                                          */
      __OM  uint32_t SWRST      : 1;            /*!< [13..13] Software reset                                                   */
      __IOM uint32_t TXDMAEN    : 1;            /*!< [14..14] DMA transmission requests enable                                 */
      __IOM uint32_t RXDMAEN    : 1;            /*!< [15..15] DMA reception requests enable                                    */
      __IOM uint32_t SBC        : 1;            /*!< [16..16] Slave byte control                                               */
      __IOM uint32_t NOSTRETCH  : 1;            /*!< [17..17] Clock stretching disable                                         */
      __IOM uint32_t WUPEN      : 1;            /*!< [18..18] Wakeup from STOP enable                                          */
      __IOM uint32_t GCEN       : 1;            /*!< [19..19] General call enable                                              */
      __IOM uint32_t SMBHEN     : 1;            /*!< [20..20] SMBus Host address enable                                        */
      __IOM uint32_t SMBDEN     : 1;            /*!< [21..21] SMBus Device Default address enable                              */
      __IOM uint32_t ALERTEN    : 1;            /*!< [22..22] SMBUS alert enable                                               */
      __IOM uint32_t PECEN      : 1;            /*!< [23..23] PEC enable                                                       */
    } CR1_b;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x00000004) Control register 2                                         */
    
    struct {
      __IOM uint32_t SADD0      : 1;            /*!< [0..0] Slave address bit 0 (master mode)                                  */
      __IOM uint32_t SADD1      : 7;            /*!< [7..1] Slave address bit 7:1 (master mode)                                */
      __IOM uint32_t SADD8      : 2;            /*!< [9..8] Slave address bit 9:8 (master mode)                                */
      __IOM uint32_t RD_WRN     : 1;            /*!< [10..10] Transfer direction (master mode)                                 */
      __IOM uint32_t ADD10      : 1;            /*!< [11..11] 10-bit addressing mode (master mode)                             */
      __IOM uint32_t HEAD10R    : 1;            /*!< [12..12] 10-bit address header only read direction (master receiver
                                                     mode)                                                                     */
      __IOM uint32_t START      : 1;            /*!< [13..13] Start generation                                                 */
      __IOM uint32_t STOP       : 1;            /*!< [14..14] Stop generation (master mode)                                    */
      __IOM uint32_t NACK       : 1;            /*!< [15..15] NACK generation (slave mode)                                     */
      __IOM uint32_t NBYTES     : 8;            /*!< [23..16] Number of bytes                                                  */
      __IOM uint32_t RELOAD     : 1;            /*!< [24..24] NBYTES reload mode                                               */
      __IOM uint32_t AUTOEND    : 1;            /*!< [25..25] Automatic end mode (master mode)                                 */
      __IOM uint32_t PECBYTE    : 1;            /*!< [26..26] Packet error checking byte                                       */
    } CR2_b;
  } ;
  
  union {
    __IOM uint32_t OAR1;                        /*!< (@ 0x00000008) Own address register 1                                     */
    
    struct {
      __IOM uint32_t OA1_0      : 1;            /*!< [0..0] Interface address                                                  */
      __IOM uint32_t OA1_1      : 7;            /*!< [7..1] Interface address                                                  */
      __IOM uint32_t OA1_8      : 2;            /*!< [9..8] Interface address                                                  */
      __IOM uint32_t OA1MODE    : 1;            /*!< [10..10] Own Address 1 10-bit mode                                        */
      __IM  uint32_t            : 4;
      __IOM uint32_t OA1EN      : 1;            /*!< [15..15] Own Address 1 enable                                             */
    } OAR1_b;
  } ;
  
  union {
    __IOM uint32_t OAR2;                        /*!< (@ 0x0000000C) Own address register 2                                     */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t OA2        : 7;            /*!< [7..1] Interface address                                                  */
      __IOM uint32_t OA2MSK     : 3;            /*!< [10..8] Own Address 2 masks                                               */
      __IM  uint32_t            : 4;
      __IOM uint32_t OA2EN      : 1;            /*!< [15..15] Own Address 2 enable                                             */
    } OAR2_b;
  } ;
  
  union {
    __IOM uint32_t TIMINGR;                     /*!< (@ 0x00000010) Timing register                                            */
    
