nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t SCLL       : 8;            /*!< [7..0] SCL low period (master mode)                                       */
      __IOM uint32_t SCLH       : 8;            /*!< [15..8] SCL high period (master mode)                                     */
      __IOM uint32_t SDADEL     : 4;            /*!< [19..16] Data hold time                                                   */
      __IOM uint32_t SCLDEL     : 4;            /*!< [23..20] Data setup time                                                  */
      __IM  uint32_t            : 4;
      __IOM uint32_t PRESC      : 4;            /*!< [31..28] Timing prescaler                                                 */
    } TIMINGR_b;
  } ;
  
  union {
    __IOM uint32_t TIMEOUTR;                    /*!< (@ 0x00000014) Status register 1                                          */
    
    struct {
      __IOM uint32_t TIMEOUTA   : 12;           /*!< [11..0] Bus timeout A                                                     */
      __IOM uint32_t TIDLE      : 1;            /*!< [12..12] Idle clock timeout detection                                     */
      __IM  uint32_t            : 2;
      __IOM uint32_t TIMOUTEN   : 1;            /*!< [15..15] Clock timeout enable                                             */
      __IOM uint32_t TIMEOUTB   : 12;           /*!< [27..16] Bus timeout B                                                    */
      __IM  uint32_t            : 3;
      __IOM uint32_t TEXTEN     : 1;            /*!< [31..31] Extended clock timeout enable                                    */
    } TIMEOUTR_b;
  } ;
  
  union {
    __IOM uint32_t ISR;                         /*!< (@ 0x00000018) Interrupt and Status register                              */
    
    struct {
      __IOM uint32_t TXE        : 1;            /*!< [0..0] Transmit data register empty (transmitters)                        */
      __IOM uint32_t TXIS       : 1;            /*!< [1..1] Transmit interrupt status (transmitters)                           */
      __IM  uint32_t RXNE       : 1;            /*!< [2..2] Receive data register not empty (receivers)                        */
      __IM  uint32_t ADDR       : 1;            /*!< [3..3] Address matched (slave mode)                                       */
      __IM  uint32_t NACKF      : 1;            /*!< [4..4] Not acknowledge received flag                                      */
      __IM  uint32_t STOPF      : 1;            /*!< [5..5] Stop detection flag                                                */
      __IM  uint32_t TC         : 1;            /*!< [6..6] Transfer Complete (master mode)                                    */
      __IM  uint32_t TCR        : 1;            /*!< [7..7] Transfer Complete Reload                                           */
      __IM  uint32_t BERR       : 1;            /*!< [8..8] Bus error                                                          */
      __IM  uint32_t ARLO       : 1;            /*!< [9..9] Arbitration lost                                                   */
      __IM  uint32_t OVR        : 1;            /*!< [10..10] Overrun/Underrun (slave mode)                                    */
      __IM  uint32_t PECERR     : 1;            /*!< [11..11] PEC Error in reception                                           */
      __IM  uint32_t TIMEOUT    : 1;            /*!< [12..12] Timeout or t_low detection flag                                  */
      __IM  uint32_t ALERT      : 1;            /*!< [13..13] SMBus alert                                                      */
      __IM  uint32_t            : 1;
      __IM  uint32_t BUSY       : 1;            /*!< [15..15] Bus busy                                                         */
      __IM  uint32_t DIR        : 1;            /*!< [16..16] Transfer direction (Slave mode)                                  */
      __IM  uint32_t ADDCODE    : 7;            /*!< [23..17] Address match code (Slave mode)                                  */
    } ISR_b;
  } ;
  
  union {
    __OM  uint32_t ICR;                         /*!< (@ 0x0000001C) Interrupt clear register                                   */
    
    struct {
      __IM  uint32_t            : 3;
      __OM  uint32_t ADDRCF     : 1;            /*!< [3..3] Address Matched flag clear                                         */
      __OM  uint32_t NACKCF     : 1;            /*!< [4..4] Not Acknowledge flag clear                                         */
      __OM  uint32_t STOPCF     : 1;            /*!< [5..5] Stop detection flag clear                                          */
      __IM  uint32_t            : 2;
      __OM  uint32_t BERRCF     : 1;            /*!< [8..8] Bus error flag clear                                               */
      __OM  uint32_t ARLOCF     : 1;            /*!< [9..9] Arbitration lost flag clear                                        */
      __OM  uint32_t OVRCF      : 1;            /*!< [10..10] Overrun/Underrun flag clear                                      */
      __OM  uint32_t PECCF      : 1;            /*!< [11..11] PEC Error flag clear                                             */
      __OM  uint32_t TIMOUTCF   : 1;            /*!< [12..12] Timeout detection flag clear                                     */
      __OM  uint32_t ALERTCF    : 1;            /*!< [13..13] Alert flag clear                                                 */
    } ICR_b;
  } ;
  
  union {
    __IM  uint32_t PECR;                        /*!< (@ 0x00000020) PEC register                                               */
    
    struct {
      __IM  uint32_t PEC        : 8;            /*!< [7..0] Packet error checking register                                     */
    } PECR_b;
  } ;
  
  union {
    __IM  uint32_t RXDR;                        /*!< (@ 0x00000024) Receive data register                                      */
    
    struct {
      __IM  uint32_t RXDATA     : 8;            /*!< [7..0] 8-bit receive data                                                 */
    } RXDR_b;
  } ;
  
  union {
    __IOM uint32_t TXDR;                        /*!< (@ 0x00000028) Transmit data register                                     */
    
