nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __OM  uint32_t UG         : 1;            /*!< [0..0] Update generation                                                  */
      __OM  uint32_t CC1G       : 1;            /*!< [1..1] Capture/compare 1 generation                                       */
    } EGR_b;
  } ;
  
  union {
    union {
      __IOM uint32_t CCMR1_Output;              /*!< (@ 0x00000018) capture/compare mode register (output mode)                */
      
      struct {
        __IOM uint32_t CC1S     : 2;            /*!< [1..0] Capture/Compare 1 selection                                        */
        __IOM uint32_t OC1FE    : 1;            /*!< [2..2] Output compare 1 fast enable                                       */
        __IOM uint32_t OC1PE    : 1;            /*!< [3..3] Output Compare 1 preload enable                                    */
        __IOM uint32_t OC1M     : 3;            /*!< [6..4] Output Compare 1 mode                                              */
      } CCMR1_Output_b;
    } ;
    
    union {
      __IOM uint32_t CCMR1_Input;               /*!< (@ 0x00000018) capture/compare mode register (input mode)                 */
      
      struct {
        __IOM uint32_t CC1S     : 2;            /*!< [1..0] Capture/Compare 1 selection                                        */
        __IOM uint32_t IC1PSC   : 2;            /*!< [3..2] Input capture 1 prescaler                                          */
        __IOM uint32_t IC1F     : 4;            /*!< [7..4] Input capture 1 filter                                             */
      } CCMR1_Input_b;
    } ;
  };
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t CCER;                        /*!< (@ 0x00000020) capture/compare enable register                            */
    
    struct {
      __IOM uint32_t CC1E       : 1;            /*!< [0..0] Capture/Compare 1 output enable                                    */
      __IOM uint32_t CC1P       : 1;            /*!< [1..1] Capture/Compare 1 output Polarity                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t CC1NP      : 1;            /*!< [3..3] Capture/Compare 1 output Polarity                                  */
    } CCER_b;
  } ;
  
  union {
    __IOM uint32_t CNT;                         /*!< (@ 0x00000024) counter                                                    */
    
    struct {
      __IOM uint32_t CNT        : 16;           /*!< [15..0] counter value                                                     */
    } CNT_b;
  } ;
  
  union {
    __IOM uint32_t PSC;                         /*!< (@ 0x00000028) prescaler                                                  */
    
    struct {
      __IOM uint32_t PSC        : 16;           /*!< [15..0] Prescaler value                                                   */
    } PSC_b;
  } ;
  
  union {
    __IOM uint32_t ARR;                         /*!< (@ 0x0000002C) auto-reload register                                       */
    
    struct {
      __IOM uint32_t ARR        : 16;           /*!< [15..0] Auto-reload value                                                 */
    } ARR_b;
  } ;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t CCR1;                        /*!< (@ 0x00000034) capture/compare register 1                                 */
    
    struct {
      __IOM uint32_t CCR1       : 16;           /*!< [15..0] Capture/Compare 1 value                                           */
    } CCR1_b;
  } ;
  __IM  uint32_t  RESERVED3[6];
  
  union {
    __IOM uint32_t OR;                          /*!< (@ 0x00000050) option register                                            */
    
    struct {
      __IOM uint32_t RMP        : 2;            /*!< [1..0] Timer input 1 remap                                                */
    } OR_b;
  } ;
} TIM14_Type;                                   /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                           EXTI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief External interrupt/event       controller (EXTI)
  */

typedef struct {                                /*!< (@ 0x40010400) EXTI Structure                                             */
  
  union {
    __IOM uint32_t IMR;                         /*!< (@ 0x00000000) Interrupt mask register (EXTI_IMR)                         */
    
    struct {
      __IOM uint32_t MR0        : 1;            /*!< [0..0] Interrupt Mask on line 0                                           */
      __IOM uint32_t MR1        : 1;            /*!< [1..1] Interrupt Mask on line 1                                           */
      __IOM uint32_t MR2        : 1;            /*!< [2..2] Interrupt Mask on line 2                                           */
      __IOM uint32_t MR3        : 1;            /*!< [3..3] Interrupt Mask on line 3                                           */
      __IOM uint32_t MR4        : 1;            /*!< [4..4] Interrupt Mask on line 4                                           */
      __IOM uint32_t MR5        : 1;            /*!< [5..5] Interrupt Mask on line 5                                           */
      __IOM uint32_t MR6        : 1;            /*!< [6..6] Interrupt Mask on line 6                                           */
      __IOM uint32_t MR7        : 1;            /*!< [7..7] Interrupt Mask on line 7                                           */
      __IOM uint32_t MR8        : 1;            /*!< [8..8] Interrupt Mask on line 8                                           */
      __IOM uint32_t MR9        : 1;            /*!< [9..9] Interrupt Mask on line 9                                           */
      __IOM uint32_t MR10       : 1;            /*!< [10..10] Interrupt Mask on line 10                                        */
      __IOM uint32_t MR11       : 1;            /*!< [11..11] Interrupt Mask on line 11                                        */
      __IOM uint32_t MR12       : 1;            /*!< [12..12] Interrupt Mask on line 12                                        */
      __IOM uint32_t MR13       : 1;            /*!< [13..13] Interrupt Mask on line 13                                        */
      __IOM uint32_t MR14       : 1;            /*!< [14..14] Interrupt Mask on line 14                                        */
      __IOM uint32_t MR15       : 1;            /*!< [15..15] Interrupt Mask on line 15                                        */
      __IOM uint32_t MR16       : 1;            /*!< [16..16] Interrupt Mask on line 16                                        */
      __IOM uint32_t MR17       : 1;            /*!< [17..17] Interrupt Mask on line 17                                        */
      __IOM uint32_t MR18       : 1;            /*!< [18..18] Interrupt Mask on line 18                                        */
      __IOM uint32_t MR19       : 1;            /*!< [19..19] Interrupt Mask on line 19                                        */
      __IOM uint32_t MR20       : 1;            /*!< [20..20] Interrupt Mask on line 20                                        */
      __IOM uint32_t MR21       : 1;            /*!< [21..21] Interrupt Mask on line 21                                        */
      __IOM uint32_t MR22       : 1;            /*!< [22..22] Interrupt Mask on line 22                                        */
      __IOM uint32_t MR23       : 1;            /*!< [23..23] Interrupt Mask on line 23                                        */
      __IOM uint32_t MR24       : 1;            /*!< [24..24] Interrupt Mask on line 24                                        */
      __IOM uint32_t MR25       : 1;            /*!< [25..25] Interrupt Mask on line 25                                        */
      __IOM uint32_t MR26       : 1;            /*!< [26..26] Interrupt Mask on line 26                                        */
      __IOM uint32_t MR27       : 1;            /*!< [27..27] Interrupt Mask on line 27                                        */
    } IMR_b;
  } ;
  
  union {
    __IOM uint32_t EMR;                         /*!< (@ 0x00000004) Event mask register (EXTI_EMR)                             */
    
