nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t MR0        : 1;            /*!< [0..0] Event Mask on line 0                                               */
      __IOM uint32_t MR1        : 1;            /*!< [1..1] Event Mask on line 1                                               */
      __IOM uint32_t MR2        : 1;            /*!< [2..2] Event Mask on line 2                                               */
      __IOM uint32_t MR3        : 1;            /*!< [3..3] Event Mask on line 3                                               */
      __IOM uint32_t MR4        : 1;            /*!< [4..4] Event Mask on line 4                                               */
      __IOM uint32_t MR5        : 1;            /*!< [5..5] Event Mask on line 5                                               */
      __IOM uint32_t MR6        : 1;            /*!< [6..6] Event Mask on line 6                                               */
      __IOM uint32_t MR7        : 1;            /*!< [7..7] Event Mask on line 7                                               */
      __IOM uint32_t MR8        : 1;            /*!< [8..8] Event Mask on line 8                                               */
      __IOM uint32_t MR9        : 1;            /*!< [9..9] Event Mask on line 9                                               */
      __IOM uint32_t MR10       : 1;            /*!< [10..10] Event Mask on line 10                                            */
      __IOM uint32_t MR11       : 1;            /*!< [11..11] Event Mask on line 11                                            */
      __IOM uint32_t MR12       : 1;            /*!< [12..12] Event Mask on line 12                                            */
      __IOM uint32_t MR13       : 1;            /*!< [13..13] Event Mask on line 13                                            */
      __IOM uint32_t MR14       : 1;            /*!< [14..14] Event Mask on line 14                                            */
      __IOM uint32_t MR15       : 1;            /*!< [15..15] Event Mask on line 15                                            */
      __IOM uint32_t MR16       : 1;            /*!< [16..16] Event Mask on line 16                                            */
      __IOM uint32_t MR17       : 1;            /*!< [17..17] Event Mask on line 17                                            */
      __IOM uint32_t MR18       : 1;            /*!< [18..18] Event Mask on line 18                                            */
      __IOM uint32_t MR19       : 1;            /*!< [19..19] Event Mask on line 19                                            */
      __IOM uint32_t MR20       : 1;            /*!< [20..20] Event Mask on line 20                                            */
      __IOM uint32_t MR21       : 1;            /*!< [21..21] Event Mask on line 21                                            */
      __IOM uint32_t MR22       : 1;            /*!< [22..22] Event Mask on line 22                                            */
      __IOM uint32_t MR23       : 1;            /*!< [23..23] Event Mask on line 23                                            */
      __IOM uint32_t MR24       : 1;            /*!< [24..24] Event Mask on line 24                                            */
      __IOM uint32_t MR25       : 1;            /*!< [25..25] Event Mask on line 25                                            */
      __IOM uint32_t MR26       : 1;            /*!< [26..26] Event Mask on line 26                                            */
      __IOM uint32_t MR27       : 1;            /*!< [27..27] Event Mask on line 27                                            */
    } EMR_b;
  } ;
  
  union {
    __IOM uint32_t RTSR;                        /*!< (@ 0x00000008) Rising Trigger selection register (EXTI_RTSR)              */
    
    struct {
      __IOM uint32_t TR0        : 1;            /*!< [0..0] Rising trigger event configuration of line 0                       */
      __IOM uint32_t TR1        : 1;            /*!< [1..1] Rising trigger event configuration of line 1                       */
      __IOM uint32_t TR2        : 1;            /*!< [2..2] Rising trigger event configuration of line 2                       */
      __IOM uint32_t TR3        : 1;            /*!< [3..3] Rising trigger event configuration of line 3                       */
      __IOM uint32_t TR4        : 1;            /*!< [4..4] Rising trigger event configuration of line 4                       */
      __IOM uint32_t TR5        : 1;            /*!< [5..5] Rising trigger event configuration of line 5                       */
      __IOM uint32_t TR6        : 1;            /*!< [6..6] Rising trigger event configuration of line 6                       */
      __IOM uint32_t TR7        : 1;            /*!< [7..7] Rising trigger event configuration of line 7                       */
      __IOM uint32_t TR8        : 1;            /*!< [8..8] Rising trigger event configuration of line 8                       */
      __IOM uint32_t TR9        : 1;            /*!< [9..9] Rising trigger event configuration of line 9                       */
      __IOM uint32_t TR10       : 1;            /*!< [10..10] Rising trigger event configuration of line 10                    */
      __IOM uint32_t TR11       : 1;            /*!< [11..11] Rising trigger event configuration of line 11                    */
      __IOM uint32_t TR12       : 1;            /*!< [12..12] Rising trigger event configuration of line 12                    */
      __IOM uint32_t TR13       : 1;            /*!< [13..13] Rising trigger event configuration of line 13                    */
      __IOM uint32_t TR14       : 1;            /*!< [14..14] Rising trigger event configuration of line 14                    */
      __IOM uint32_t TR15       : 1;            /*!< [15..15] Rising trigger event configuration of line 15                    */
      __IOM uint32_t TR16       : 1;            /*!< [16..16] Rising trigger event configuration of line 16                    */
      __IOM uint32_t TR17       : 1;            /*!< [17..17] Rising trigger event configuration of line 17                    */
      __IM  uint32_t            : 1;
      __IOM uint32_t TR19       : 1;            /*!< [19..19] Rising trigger event configuration of line 19                    */
    } RTSR_b;
  } ;
  
  union {
    __IOM uint32_t FTSR;                        /*!< (@ 0x0000000C) Falling Trigger selection register (EXTI_FTSR)             */
    
