nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t TR0        : 1;            /*!< [0..0] Falling trigger event configuration of line 0                      */
      __IOM uint32_t TR1        : 1;            /*!< [1..1] Falling trigger event configuration of line 1                      */
      __IOM uint32_t TR2        : 1;            /*!< [2..2] Falling trigger event configuration of line 2                      */
      __IOM uint32_t TR3        : 1;            /*!< [3..3] Falling trigger event configuration of line 3                      */
      __IOM uint32_t TR4        : 1;            /*!< [4..4] Falling trigger event configuration of line 4                      */
      __IOM uint32_t TR5        : 1;            /*!< [5..5] Falling trigger event configuration of line 5                      */
      __IOM uint32_t TR6        : 1;            /*!< [6..6] Falling trigger event configuration of line 6                      */
      __IOM uint32_t TR7        : 1;            /*!< [7..7] Falling trigger event configuration of line 7                      */
      __IOM uint32_t TR8        : 1;            /*!< [8..8] Falling trigger event configuration of line 8                      */
      __IOM uint32_t TR9        : 1;            /*!< [9..9] Falling trigger event configuration of line 9                      */
      __IOM uint32_t TR10       : 1;            /*!< [10..10] Falling trigger event configuration of line 10                   */
      __IOM uint32_t TR11       : 1;            /*!< [11..11] Falling trigger event configuration of line 11                   */
      __IOM uint32_t TR12       : 1;            /*!< [12..12] Falling trigger event configuration of line 12                   */
      __IOM uint32_t TR13       : 1;            /*!< [13..13] Falling trigger event configuration of line 13                   */
      __IOM uint32_t TR14       : 1;            /*!< [14..14] Falling trigger event configuration of line 14                   */
      __IOM uint32_t TR15       : 1;            /*!< [15..15] Falling trigger event configuration of line 15                   */
      __IOM uint32_t TR16       : 1;            /*!< [16..16] Falling trigger event configuration of line 16                   */
      __IOM uint32_t TR17       : 1;            /*!< [17..17] Falling trigger event configuration of line 17                   */
      __IM  uint32_t            : 1;
      __IOM uint32_t TR19       : 1;            /*!< [19..19] Falling trigger event configuration of line 19                   */
    } FTSR_b;
  } ;
  
  union {
    __IOM uint32_t SWIER;                       /*!< (@ 0x00000010) Software interrupt event register (EXTI_SWIER)             */
    
    struct {
      __IOM uint32_t SWIER0     : 1;            /*!< [0..0] Software Interrupt on line 0                                       */
      __IOM uint32_t SWIER1     : 1;            /*!< [1..1] Software Interrupt on line 1                                       */
      __IOM uint32_t SWIER2     : 1;            /*!< [2..2] Software Interrupt on line 2                                       */
      __IOM uint32_t SWIER3     : 1;            /*!< [3..3] Software Interrupt on line 3                                       */
      __IOM uint32_t SWIER4     : 1;            /*!< [4..4] Software Interrupt on line 4                                       */
      __IOM uint32_t SWIER5     : 1;            /*!< [5..5] Software Interrupt on line 5                                       */
      __IOM uint32_t SWIER6     : 1;            /*!< [6..6] Software Interrupt on line 6                                       */
      __IOM uint32_t SWIER7     : 1;            /*!< [7..7] Software Interrupt on line 7                                       */
      __IOM uint32_t SWIER8     : 1;            /*!< [8..8] Software Interrupt on line 8                                       */
      __IOM uint32_t SWIER9     : 1;            /*!< [9..9] Software Interrupt on line 9                                       */
      __IOM uint32_t SWIER10    : 1;            /*!< [10..10] Software Interrupt on line 10                                    */
      __IOM uint32_t SWIER11    : 1;            /*!< [11..11] Software Interrupt on line 11                                    */
      __IOM uint32_t SWIER12    : 1;            /*!< [12..12] Software Interrupt on line 12                                    */
      __IOM uint32_t SWIER13    : 1;            /*!< [13..13] Software Interrupt on line 13                                    */
      __IOM uint32_t SWIER14    : 1;            /*!< [14..14] Software Interrupt on line 14                                    */
      __IOM uint32_t SWIER15    : 1;            /*!< [15..15] Software Interrupt on line 15                                    */
      __IOM uint32_t SWIER16    : 1;            /*!< [16..16] Software Interrupt on line 16                                    */
      __IOM uint32_t SWIER17    : 1;            /*!< [17..17] Software Interrupt on line 17                                    */
      __IM  uint32_t            : 1;
      __IOM uint32_t SWIER19    : 1;            /*!< [19..19] Software Interrupt on line 19                                    */
    } SWIER_b;
  } ;
  
  union {
    __IOM uint32_t PR;                          /*!< (@ 0x00000014) Pending register (EXTI_PR)                                 */
    
    struct {
      __IOM uint32_t PR0        : 1;            /*!< [0..0] Pending bit 0                                                      */
      __IOM uint32_t PR1        : 1;            /*!< [1..1] Pending bit 1                                                      */
      __IOM uint32_t PR2        : 1;            /*!< [2..2] Pending bit 2                                                      */
      __IOM uint32_t PR3        : 1;            /*!< [3..3] Pending bit 3                                                      */
      __IOM uint32_t PR4        : 1;            /*!< [4..4] Pending bit 4                                                      */
      __IOM uint32_t PR5        : 1;            /*!< [5..5] Pending bit 5                                                      */
      __IOM uint32_t PR6        : 1;            /*!< [6..6] Pending bit 6                                                      */
      __IOM uint32_t PR7        : 1;            /*!< [7..7] Pending bit 7                                                      */
      __IOM uint32_t PR8        : 1;            /*!< [8..8] Pending bit 8                                                      */
      __IOM uint32_t PR9        : 1;            /*!< [9..9] Pending bit 9                                                      */
      __IOM uint32_t PR10       : 1;            /*!< [10..10] Pending bit 10                                                   */
      __IOM uint32_t PR11       : 1;            /*!< [11..11] Pending bit 11                                                   */
      __IOM uint32_t PR12       : 1;            /*!< [12..12] Pending bit 12                                                   */
      __IOM uint32_t PR13       : 1;            /*!< [13..13] Pending bit 13                                                   */
      __IOM uint32_t PR14       : 1;            /*!< [14..14] Pending bit 14                                                   */
      __IOM uint32_t PR15       : 1;            /*!< [15..15] Pending bit 15                                                   */
      __IOM uint32_t PR16       : 1;            /*!< [16..16] Pending bit 16                                                   */
      __IOM uint32_t PR17       : 1;            /*!< [17..17] Pending bit 17                                                   */
      __IM  uint32_t            : 1;
      __IOM uint32_t PR19       : 1;            /*!< [19..19] Pending bit 19                                                   */
    } PR_b;
  } ;
} EXTI_Type;                                    /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                           NVIC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Nested Vectored Interrupt       Controller (NVIC)
  */

typedef struct {                                /*!< (@ 0xE000E100) NVIC Structure                                             */
  
  union {
    __IOM uint32_t ISER;                        /*!< (@ 0x00000000) Interrupt Set Enable Register                              */
    
