nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t SETENA     : 32;           /*!< [31..0] SETENA                                                            */
    } ISER_b;
  } ;
  __IM  uint32_t  RESERVED[31];
  
  union {
    __IOM uint32_t ICER;                        /*!< (@ 0x00000080) Interrupt Clear Enable Register                            */
    
    struct {
      __IOM uint32_t CLRENA     : 32;           /*!< [31..0] CLRENA                                                            */
    } ICER_b;
  } ;
  __IM  uint32_t  RESERVED1[31];
  
  union {
    __IOM uint32_t ISPR;                        /*!< (@ 0x00000100) Interrupt Set-Pending Register                             */
    
    struct {
      __IOM uint32_t SETPEND    : 32;           /*!< [31..0] SETPEND                                                           */
    } ISPR_b;
  } ;
  __IM  uint32_t  RESERVED2[31];
  
  union {
    __IOM uint32_t ICPR;                        /*!< (@ 0x00000180) Interrupt Clear-Pending Register                           */
    
    struct {
      __IOM uint32_t CLRPEND    : 32;           /*!< [31..0] CLRPEND                                                           */
    } ICPR_b;
  } ;
  __IM  uint32_t  RESERVED3[95];
  
  union {
    __IOM uint32_t IPR0;                        /*!< (@ 0x00000300) Interrupt Priority Register 0                              */
    
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_00     : 2;            /*!< [7..6] PRI_00                                                             */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_01     : 2;            /*!< [15..14] PRI_01                                                           */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_02     : 2;            /*!< [23..22] PRI_02                                                           */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_03     : 2;            /*!< [31..30] PRI_03                                                           */
    } IPR0_b;
  } ;
  
  union {
    __IOM uint32_t IPR1;                        /*!< (@ 0x00000304) Interrupt Priority Register 1                              */
    
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_40     : 2;            /*!< [7..6] PRI_40                                                             */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_41     : 2;            /*!< [15..14] PRI_41                                                           */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_42     : 2;            /*!< [23..22] PRI_42                                                           */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_43     : 2;            /*!< [31..30] PRI_43                                                           */
    } IPR1_b;
  } ;
  
  union {
    __IOM uint32_t IPR2;                        /*!< (@ 0x00000308) Interrupt Priority Register 2                              */
    
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_80     : 2;            /*!< [7..6] PRI_80                                                             */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_81     : 2;            /*!< [15..14] PRI_81                                                           */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_82     : 2;            /*!< [23..22] PRI_82                                                           */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_83     : 2;            /*!< [31..30] PRI_83                                                           */
    } IPR2_b;
  } ;
  
  union {
    __IOM uint32_t IPR3;                        /*!< (@ 0x0000030C) Interrupt Priority Register 3                              */
    
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_120    : 2;            /*!< [7..6] PRI_120                                                            */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_121    : 2;            /*!< [15..14] PRI_121                                                          */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_122    : 2;            /*!< [23..22] PRI_122                                                          */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_123    : 2;            /*!< [31..30] PRI_123                                                          */
    } IPR3_b;
  } ;
  
  union {
    __IOM uint32_t IPR4;                        /*!< (@ 0x00000310) Interrupt Priority Register 4                              */
    
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_160    : 2;            /*!< [7..6] PRI_160                                                            */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_161    : 2;            /*!< [15..14] PRI_161                                                          */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_162    : 2;            /*!< [23..22] PRI_162                                                          */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_163    : 2;            /*!< [31..30] PRI_163                                                          */
    } IPR4_b;
  } ;
  
  union {
    __IOM uint32_t IPR5;                        /*!< (@ 0x00000314) Interrupt Priority Register 5                              */
    
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_200    : 2;            /*!< [7..6] PRI_200                                                            */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_201    : 2;            /*!< [15..14] PRI_201                                                          */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_202    : 2;            /*!< [23..22] PRI_202                                                          */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_203    : 2;            /*!< [31..30] PRI_203                                                          */
    } IPR5_b;
  } ;
  
  union {
    __IOM uint32_t IPR6;                        /*!< (@ 0x00000318) Interrupt Priority Register 6                              */
    
