nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_240    : 2;            /*!< [7..6] PRI_240                                                            */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_241    : 2;            /*!< [15..14] PRI_241                                                          */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_242    : 2;            /*!< [23..22] PRI_242                                                          */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_243    : 2;            /*!< [31..30] PRI_243                                                          */
    } IPR6_b;
  } ;
  
  union {
    __IOM uint32_t IPR7;                        /*!< (@ 0x0000031C) Interrupt Priority Register 7                              */
    
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_280    : 2;            /*!< [7..6] PRI_280                                                            */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_281    : 2;            /*!< [15..14] PRI_281                                                          */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_282    : 2;            /*!< [23..22] PRI_282                                                          */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_283    : 2;            /*!< [31..30] PRI_283                                                          */
    } IPR7_b;
  } ;
} NVIC_Type;                                    /*!< Size = 800 (0x320)                                                        */



/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA controller (DMA)
  */

typedef struct {                                /*!< (@ 0x40020000) DMA Structure                                              */
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x00000000) DMA interrupt status register (DMA_ISR)                    */
    
    struct {
      __IM  uint32_t GIF1       : 1;            /*!< [0..0] Channel 1 Global interrupt flag                                    */
      __IM  uint32_t TCIF1      : 1;            /*!< [1..1] Channel 1 Transfer Complete flag                                   */
      __IM  uint32_t HTIF1      : 1;            /*!< [2..2] Channel 1 Half Transfer Complete flag                              */
      __IM  uint32_t TEIF1      : 1;            /*!< [3..3] Channel 1 Transfer Error flag                                      */
      __IM  uint32_t GIF2       : 1;            /*!< [4..4] Channel 2 Global interrupt flag                                    */
      __IM  uint32_t TCIF2      : 1;            /*!< [5..5] Channel 2 Transfer Complete flag                                   */
      __IM  uint32_t HTIF2      : 1;            /*!< [6..6] Channel 2 Half Transfer Complete flag                              */
      __IM  uint32_t TEIF2      : 1;            /*!< [7..7] Channel 2 Transfer Error flag                                      */
      __IM  uint32_t GIF3       : 1;            /*!< [8..8] Channel 3 Global interrupt flag                                    */
      __IM  uint32_t TCIF3      : 1;            /*!< [9..9] Channel 3 Transfer Complete flag                                   */
      __IM  uint32_t HTIF3      : 1;            /*!< [10..10] Channel 3 Half Transfer Complete flag                            */
      __IM  uint32_t TEIF3      : 1;            /*!< [11..11] Channel 3 Transfer Error flag                                    */
      __IM  uint32_t GIF4       : 1;            /*!< [12..12] Channel 4 Global interrupt flag                                  */
      __IM  uint32_t TCIF4      : 1;            /*!< [13..13] Channel 4 Transfer Complete flag                                 */
      __IM  uint32_t HTIF4      : 1;            /*!< [14..14] Channel 4 Half Transfer Complete flag                            */
      __IM  uint32_t TEIF4      : 1;            /*!< [15..15] Channel 4 Transfer Error flag                                    */
      __IM  uint32_t GIF5       : 1;            /*!< [16..16] Channel 5 Global interrupt flag                                  */
      __IM  uint32_t TCIF5      : 1;            /*!< [17..17] Channel 5 Transfer Complete flag                                 */
      __IM  uint32_t HTIF5      : 1;            /*!< [18..18] Channel 5 Half Transfer Complete flag                            */
      __IM  uint32_t TEIF5      : 1;            /*!< [19..19] Channel 5 Transfer Error flag                                    */
      __IM  uint32_t GIF6       : 1;            /*!< [20..20] Channel 6 Global interrupt flag                                  */
      __IM  uint32_t TCIF6      : 1;            /*!< [21..21] Channel 6 Transfer Complete flag                                 */
      __IM  uint32_t HTIF6      : 1;            /*!< [22..22] Channel 6 Half Transfer Complete flag                            */
      __IM  uint32_t TEIF6      : 1;            /*!< [23..23] Channel 6 Transfer Error flag                                    */
      __IM  uint32_t GIF7       : 1;            /*!< [24..24] Channel 7 Global interrupt flag                                  */
      __IM  uint32_t TCIF7      : 1;            /*!< [25..25] Channel 7 Transfer Complete flag                                 */
      __IM  uint32_t HTIF7      : 1;            /*!< [26..26] Channel 7 Half Transfer Complete flag                            */
      __IM  uint32_t TEIF7      : 1;            /*!< [27..27] Channel 7 Transfer Error flag                                    */
    } ISR_b;
  } ;
  
  union {
    __OM  uint32_t IFCR;                        /*!< (@ 0x00000004) DMA interrupt flag clear register (DMA_IFCR)               */
    
