nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __OM  uint32_t CGIF1      : 1;            /*!< [0..0] Channel 1 Global interrupt clear                                   */
      __OM  uint32_t CTCIF1     : 1;            /*!< [1..1] Channel 1 Transfer Complete clear                                  */
      __OM  uint32_t CHTIF1     : 1;            /*!< [2..2] Channel 1 Half Transfer clear                                      */
      __OM  uint32_t CTEIF1     : 1;            /*!< [3..3] Channel 1 Transfer Error clear                                     */
      __OM  uint32_t CGIF2      : 1;            /*!< [4..4] Channel 2 Global interrupt clear                                   */
      __OM  uint32_t CTCIF2     : 1;            /*!< [5..5] Channel 2 Transfer Complete clear                                  */
      __OM  uint32_t CHTIF2     : 1;            /*!< [6..6] Channel 2 Half Transfer clear                                      */
      __OM  uint32_t CTEIF2     : 1;            /*!< [7..7] Channel 2 Transfer Error clear                                     */
      __OM  uint32_t CGIF3      : 1;            /*!< [8..8] Channel 3 Global interrupt clear                                   */
      __OM  uint32_t CTCIF3     : 1;            /*!< [9..9] Channel 3 Transfer Complete clear                                  */
      __OM  uint32_t CHTIF3     : 1;            /*!< [10..10] Channel 3 Half Transfer clear                                    */
      __OM  uint32_t CTEIF3     : 1;            /*!< [11..11] Channel 3 Transfer Error clear                                   */
      __OM  uint32_t CGIF4      : 1;            /*!< [12..12] Channel 4 Global interrupt clear                                 */
      __OM  uint32_t CTCIF4     : 1;            /*!< [13..13] Channel 4 Transfer Complete clear                                */
      __OM  uint32_t CHTIF4     : 1;            /*!< [14..14] Channel 4 Half Transfer clear                                    */
      __OM  uint32_t CTEIF4     : 1;            /*!< [15..15] Channel 4 Transfer Error clear                                   */
      __OM  uint32_t CGIF5      : 1;            /*!< [16..16] Channel 5 Global interrupt clear                                 */
      __OM  uint32_t CTCIF5     : 1;            /*!< [17..17] Channel 5 Transfer Complete clear                                */
      __OM  uint32_t CHTIF5     : 1;            /*!< [18..18] Channel 5 Half Transfer clear                                    */
      __OM  uint32_t CTEIF5     : 1;            /*!< [19..19] Channel 5 Transfer Error clear                                   */
      __OM  uint32_t CGIF6      : 1;            /*!< [20..20] Channel 6 Global interrupt clear                                 */
      __OM  uint32_t CTCIF6     : 1;            /*!< [21..21] Channel 6 Transfer Complete clear                                */
      __OM  uint32_t CHTIF6     : 1;            /*!< [22..22] Channel 6 Half Transfer clear                                    */
      __OM  uint32_t CTEIF6     : 1;            /*!< [23..23] Channel 6 Transfer Error clear                                   */
      __OM  uint32_t CGIF7      : 1;            /*!< [24..24] Channel 7 Global interrupt clear                                 */
      __OM  uint32_t CTCIF7     : 1;            /*!< [25..25] Channel 7 Transfer Complete clear                                */
      __OM  uint32_t CHTIF7     : 1;            /*!< [26..26] Channel 7 Half Transfer clear                                    */
      __OM  uint32_t CTEIF7     : 1;            /*!< [27..27] Channel 7 Transfer Error clear                                   */
    } IFCR_b;
  } ;
  
  union {
    __IOM uint32_t CCR1;                        /*!< (@ 0x00000008) DMA channel configuration register (DMA_CCR)               */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Channel enable                                                     */
      __IOM uint32_t TCIE       : 1;            /*!< [1..1] Transfer complete interrupt enable                                 */
      __IOM uint32_t HTIE       : 1;            /*!< [2..2] Half Transfer interrupt enable                                     */
      __IOM uint32_t TEIE       : 1;            /*!< [3..3] Transfer error interrupt enable                                    */
      __IOM uint32_t DIR        : 1;            /*!< [4..4] Data transfer direction                                            */
      __IOM uint32_t CIRC       : 1;            /*!< [5..5] Circular mode                                                      */
      __IOM uint32_t PINC       : 1;            /*!< [6..6] Peripheral increment mode                                          */
      __IOM uint32_t MINC       : 1;            /*!< [7..7] Memory increment mode                                              */
      __IOM uint32_t PSIZE      : 2;            /*!< [9..8] Peripheral size                                                    */
      __IOM uint32_t MSIZE      : 2;            /*!< [11..10] Memory size                                                      */
      __IOM uint32_t PL         : 2;            /*!< [13..12] Channel Priority level                                           */
      __IOM uint32_t MEM2MEM    : 1;            /*!< [14..14] Memory to memory mode                                            */
    } CCR1_b;
  } ;
  
  union {
    __IOM uint32_t CNDTR1;                      /*!< (@ 0x0000000C) DMA channel 1 number of data register                      */
    
    struct {
      __IOM uint32_t NDT        : 16;           /*!< [15..0] Number of data to transfer                                        */
    } CNDTR1_b;
  } ;
  
  union {
    __IOM uint32_t CPAR1;                       /*!< (@ 0x00000010) DMA channel 1 peripheral address register                  */
    
    struct {
      __IOM uint32_t PA         : 32;           /*!< [31..0] Peripheral address                                                */
    } CPAR1_b;
  } ;
  
  union {
    __IOM uint32_t CMAR1;                       /*!< (@ 0x00000014) DMA channel 1 memory address register                      */
    
