nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t MA         : 32;           /*!< [31..0] Memory address                                                    */
    } CMAR6_b;
  } ;
  __IM  uint32_t  RESERVED5;
  
  union {
    __IOM uint32_t CCR7;                        /*!< (@ 0x00000080) DMA channel configuration register (DMA_CCR)               */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Channel enable                                                     */
      __IOM uint32_t TCIE       : 1;            /*!< [1..1] Transfer complete interrupt enable                                 */
      __IOM uint32_t HTIE       : 1;            /*!< [2..2] Half Transfer interrupt enable                                     */
      __IOM uint32_t TEIE       : 1;            /*!< [3..3] Transfer error interrupt enable                                    */
      __IOM uint32_t DIR        : 1;            /*!< [4..4] Data transfer direction                                            */
      __IOM uint32_t CIRC       : 1;            /*!< [5..5] Circular mode                                                      */
      __IOM uint32_t PINC       : 1;            /*!< [6..6] Peripheral increment mode                                          */
      __IOM uint32_t MINC       : 1;            /*!< [7..7] Memory increment mode                                              */
      __IOM uint32_t PSIZE      : 2;            /*!< [9..8] Peripheral size                                                    */
      __IOM uint32_t MSIZE      : 2;            /*!< [11..10] Memory size                                                      */
      __IOM uint32_t PL         : 2;            /*!< [13..12] Channel Priority level                                           */
      __IOM uint32_t MEM2MEM    : 1;            /*!< [14..14] Memory to memory mode                                            */
    } CCR7_b;
  } ;
  
  union {
    __IOM uint32_t CNDTR7;                      /*!< (@ 0x00000084) DMA channel 7 number of data register                      */
    
    struct {
      __IOM uint32_t NDT        : 16;           /*!< [15..0] Number of data to transfer                                        */
    } CNDTR7_b;
  } ;
  
  union {
    __IOM uint32_t CPAR7;                       /*!< (@ 0x00000088) DMA channel 7 peripheral address register                  */
    
    struct {
      __IOM uint32_t PA         : 32;           /*!< [31..0] Peripheral address                                                */
    } CPAR7_b;
  } ;
  
  union {
    __IOM uint32_t CMAR7;                       /*!< (@ 0x0000008C) DMA channel 7 memory address register                      */
    
    struct {
      __IOM uint32_t MA         : 32;           /*!< [31..0] Memory address                                                    */
    } CMAR7_b;
  } ;
} DMA_Type;                                     /*!< Size = 144 (0x90)                                                         */



/* =========================================================================================================================== */
/* ================                                            RCC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Reset and clock control (RCC)
  */

typedef struct {                                /*!< (@ 0x40021000) RCC Structure                                              */
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) Clock control register                                     */
    
    struct {
      __IOM uint32_t HSION      : 1;            /*!< [0..0] Internal High Speed clock enable                                   */
      __IM  uint32_t HSIRDY     : 1;            /*!< [1..1] Internal High Speed clock ready flag                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t HSITRIM    : 5;            /*!< [7..3] Internal High Speed clock trimming                                 */
      __IM  uint32_t HSICAL     : 8;            /*!< [15..8] Internal High Speed clock Calibration                             */
      __IOM uint32_t HSEON      : 1;            /*!< [16..16] External High Speed clock enable                                 */
      __IM  uint32_t HSERDY     : 1;            /*!< [17..17] External High Speed clock ready flag                             */
      __IOM uint32_t HSEBYP     : 1;            /*!< [18..18] External High Speed clock Bypass                                 */
      __IOM uint32_t CSSON      : 1;            /*!< [19..19] Clock Security System enable                                     */
      __IM  uint32_t            : 4;
      __IOM uint32_t PLLON      : 1;            /*!< [24..24] PLL enable                                                       */
      __IM  uint32_t PLLRDY     : 1;            /*!< [25..25] PLL clock ready flag                                             */
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t CFGR;                        /*!< (@ 0x00000004) Clock configuration register (RCC_CFGR)                    */
    
    struct {
      __IOM uint32_t SW         : 2;            /*!< [1..0] System clock Switch                                                */
      __IM  uint32_t SWS        : 2;            /*!< [3..2] System Clock Switch Status                                         */
      __IOM uint32_t HPRE       : 4;            /*!< [7..4] AHB prescaler                                                      */
      __IOM uint32_t PPRE       : 3;            /*!< [10..8] APB Low speed prescaler (APB1)                                    */
      __IM  uint32_t            : 3;
      __IOM uint32_t ADCPRE     : 1;            /*!< [14..14] ADC prescaler                                                    */
      __IOM uint32_t PLLSRC     : 2;            /*!< [16..15] PLL input clock source                                           */
      __IOM uint32_t PLLXTPRE   : 1;            /*!< [17..17] HSE divider for PLL entry                                        */
      __IOM uint32_t PLLMUL     : 4;            /*!< [21..18] PLL Multiplication Factor                                        */
      __IM  uint32_t            : 2;
      __IOM uint32_t MCO        : 3;            /*!< [26..24] Microcontroller clock output                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t MCOPRE     : 3;            /*!< [30..28] Microcontroller Clock Output Prescaler                           */
      __IOM uint32_t PLLNODIV   : 1;            /*!< [31..31] PLL clock not divided for MCO                                    */
    } CFGR_b;
  } ;
  
  union {
    __IOM uint32_t CIR;                         /*!< (@ 0x00000008) Clock interrupt register (RCC_CIR)                         */
    
