nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IM  uint32_t LSIRDYF    : 1;            /*!< [0..0] LSI Ready Interrupt flag                                           */
      __IM  uint32_t LSERDYF    : 1;            /*!< [1..1] LSE Ready Interrupt flag                                           */
      __IM  uint32_t HSIRDYF    : 1;            /*!< [2..2] HSI Ready Interrupt flag                                           */
      __IM  uint32_t HSERDYF    : 1;            /*!< [3..3] HSE Ready Interrupt flag                                           */
      __IM  uint32_t PLLRDYF    : 1;            /*!< [4..4] PLL Ready Interrupt flag                                           */
      __IM  uint32_t HSI14RDYF  : 1;            /*!< [5..5] HSI14 ready interrupt flag                                         */
      __IM  uint32_t HSI48RDYF  : 1;            /*!< [6..6] HSI48 ready interrupt flag                                         */
      __IM  uint32_t CSSF       : 1;            /*!< [7..7] Clock Security System Interrupt flag                               */
      __IOM uint32_t LSIRDYIE   : 1;            /*!< [8..8] LSI Ready Interrupt Enable                                         */
      __IOM uint32_t LSERDYIE   : 1;            /*!< [9..9] LSE Ready Interrupt Enable                                         */
      __IOM uint32_t HSIRDYIE   : 1;            /*!< [10..10] HSI Ready Interrupt Enable                                       */
      __IOM uint32_t HSERDYIE   : 1;            /*!< [11..11] HSE Ready Interrupt Enable                                       */
      __IOM uint32_t PLLRDYIE   : 1;            /*!< [12..12] PLL Ready Interrupt Enable                                       */
      __IOM uint32_t HSI14RDYE  : 1;            /*!< [13..13] HSI14 ready interrupt enable                                     */
      __IOM uint32_t HSI48RDYIE : 1;            /*!< [14..14] HSI48 ready interrupt enable                                     */
      __IM  uint32_t            : 1;
      __OM  uint32_t LSIRDYC    : 1;            /*!< [16..16] LSI Ready Interrupt Clear                                        */
      __OM  uint32_t LSERDYC    : 1;            /*!< [17..17] LSE Ready Interrupt Clear                                        */
      __OM  uint32_t HSIRDYC    : 1;            /*!< [18..18] HSI Ready Interrupt Clear                                        */
      __OM  uint32_t HSERDYC    : 1;            /*!< [19..19] HSE Ready Interrupt Clear                                        */
      __OM  uint32_t PLLRDYC    : 1;            /*!< [20..20] PLL Ready Interrupt Clear                                        */
      __OM  uint32_t HSI14RDYC  : 1;            /*!< [21..21] HSI 14 MHz Ready Interrupt Clear                                 */
      __OM  uint32_t HSI48RDYC  : 1;            /*!< [22..22] HSI48 Ready Interrupt Clear                                      */
      __OM  uint32_t CSSC       : 1;            /*!< [23..23] Clock security system interrupt clear                            */
    } CIR_b;
  } ;
  
  union {
    __IOM uint32_t APB2RSTR;                    /*!< (@ 0x0000000C) APB2 peripheral reset register (RCC_APB2RSTR)              */
    
    struct {
      __IOM uint32_t SYSCFGRST  : 1;            /*!< [0..0] SYSCFG and COMP reset                                              */
      __IM  uint32_t            : 8;
      __IOM uint32_t ADCRST     : 1;            /*!< [9..9] ADC interface reset                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t TIM1RST    : 1;            /*!< [11..11] TIM1 timer reset                                                 */
      __IOM uint32_t SPI1RST    : 1;            /*!< [12..12] SPI 1 reset                                                      */
      __IM  uint32_t            : 1;
      __IOM uint32_t USART1RST  : 1;            /*!< [14..14] USART1 reset                                                     */
      __IM  uint32_t            : 2;
      __IOM uint32_t TIM16RST   : 1;            /*!< [17..17] TIM16 timer reset                                                */
      __IOM uint32_t TIM17RST   : 1;            /*!< [18..18] TIM17 timer reset                                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t DBGMCURST  : 1;            /*!< [22..22] Debug MCU reset                                                  */
    } APB2RSTR_b;
  } ;
  
  union {
    __IOM uint32_t APB1RSTR;                    /*!< (@ 0x00000010) APB1 peripheral reset register (RCC_APB1RSTR)              */
    
    struct {
      __IOM uint32_t TIM2RST    : 1;            /*!< [0..0] Timer 2 reset                                                      */
      __IOM uint32_t TIM3RST    : 1;            /*!< [1..1] Timer 3 reset                                                      */
      __IM  uint32_t            : 6;
      __IOM uint32_t TIM14RST   : 1;            /*!< [8..8] Timer 14 reset                                                     */
      __IM  uint32_t            : 2;
      __IOM uint32_t WWDGRST    : 1;            /*!< [11..11] Window watchdog reset                                            */
      __IM  uint32_t            : 2;
      __IOM uint32_t SPI2RST    : 1;            /*!< [14..14] SPI2 reset                                                       */
      __IM  uint32_t            : 2;
      __IOM uint32_t USART2RST  : 1;            /*!< [17..17] USART 2 reset                                                    */
      __IM  uint32_t            : 3;
      __IOM uint32_t I2C1RST    : 1;            /*!< [21..21] I2C1 reset                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t USBRST     : 1;            /*!< [23..23] USB interface reset                                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t CANRST     : 1;            /*!< [25..25] CAN interface reset                                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t CRSRST     : 1;            /*!< [27..27] Clock Recovery System interface reset                            */
      __IOM uint32_t PWRRST     : 1;            /*!< [28..28] Power interface reset                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t CECRST     : 1;            /*!< [30..30] HDMI CEC reset                                                   */
    } APB1RSTR_b;
  } ;
  
  union {
    __IOM uint32_t AHBENR;                      /*!< (@ 0x00000014) AHB Peripheral Clock enable register (RCC_AHBENR)          */
    
