nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t DMAEN      : 1;            /*!< [0..0] DMA1 clock enable                                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t SRAMEN     : 1;            /*!< [2..2] SRAM interface clock enable                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t FLITFEN    : 1;            /*!< [4..4] FLITF clock enable                                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t CRCEN      : 1;            /*!< [6..6] CRC clock enable                                                   */
      __IM  uint32_t            : 10;
      __IOM uint32_t IOPAEN     : 1;            /*!< [17..17] I/O port A clock enable                                          */
      __IOM uint32_t IOPBEN     : 1;            /*!< [18..18] I/O port B clock enable                                          */
      __IOM uint32_t IOPCEN     : 1;            /*!< [19..19] I/O port C clock enable                                          */
      __IM  uint32_t            : 2;
      __IOM uint32_t IOPFEN     : 1;            /*!< [22..22] I/O port F clock enable                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t TSCEN      : 1;            /*!< [24..24] Touch sensing controller clock enable                            */
    } AHBENR_b;
  } ;
  
  union {
    __IOM uint32_t APB2ENR;                     /*!< (@ 0x00000018) APB2 peripheral clock enable register (RCC_APB2ENR)        */
    
    struct {
      __IOM uint32_t SYSCFGEN   : 1;            /*!< [0..0] SYSCFG clock enable                                                */
      __IM  uint32_t            : 8;
      __IOM uint32_t ADCEN      : 1;            /*!< [9..9] ADC 1 interface clock enable                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t TIM1EN     : 1;            /*!< [11..11] TIM1 Timer clock enable                                          */
      __IOM uint32_t SPI1EN     : 1;            /*!< [12..12] SPI 1 clock enable                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t USART1EN   : 1;            /*!< [14..14] USART1 clock enable                                              */
      __IM  uint32_t            : 2;
      __IOM uint32_t TIM16EN    : 1;            /*!< [17..17] TIM16 timer clock enable                                         */
      __IOM uint32_t TIM17EN    : 1;            /*!< [18..18] TIM17 timer clock enable                                         */
      __IM  uint32_t            : 3;
      __IOM uint32_t DBGMCUEN   : 1;            /*!< [22..22] MCU debug module clock enable                                    */
    } APB2ENR_b;
  } ;
  
  union {
    __IOM uint32_t APB1ENR;                     /*!< (@ 0x0000001C) APB1 peripheral clock enable register (RCC_APB1ENR)        */
    
    struct {
      __IOM uint32_t TIM2EN     : 1;            /*!< [0..0] Timer 2 clock enable                                               */
      __IOM uint32_t TIM3EN     : 1;            /*!< [1..1] Timer 3 clock enable                                               */
      __IM  uint32_t            : 6;
      __IOM uint32_t TIM14EN    : 1;            /*!< [8..8] Timer 14 clock enable                                              */
      __IM  uint32_t            : 2;
      __IOM uint32_t WWDGEN     : 1;            /*!< [11..11] Window watchdog clock enable                                     */
      __IM  uint32_t            : 2;
      __IOM uint32_t SPI2EN     : 1;            /*!< [14..14] SPI 2 clock enable                                               */
      __IM  uint32_t            : 2;
      __IOM uint32_t USART2EN   : 1;            /*!< [17..17] USART 2 clock enable                                             */
      __IM  uint32_t            : 3;
      __IOM uint32_t I2C1EN     : 1;            /*!< [21..21] I2C 1 clock enable                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t USBRST     : 1;            /*!< [23..23] USB interface clock enable                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t CANEN      : 1;            /*!< [25..25] CAN interface clock enable                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t CRSEN      : 1;            /*!< [27..27] Clock Recovery System interface clock enable                     */
      __IOM uint32_t PWREN      : 1;            /*!< [28..28] Power interface clock enable                                     */
      __IOM uint32_t DACEN      : 1;            /*!< [29..29] DAC interface clock enable                                       */
      __IOM uint32_t CECEN      : 1;            /*!< [30..30] HDMI CEC interface clock enable                                  */
    } APB1ENR_b;
  } ;
  
  union {
    __IOM uint32_t BDCR;                        /*!< (@ 0x00000020) Backup domain control register (RCC_BDCR)                  */
    
    struct {
      __IOM uint32_t LSEON      : 1;            /*!< [0..0] External Low Speed oscillator enable                               */
      __IM  uint32_t LSERDY     : 1;            /*!< [1..1] External Low Speed oscillator ready                                */
      __IOM uint32_t LSEBYP     : 1;            /*!< [2..2] External Low Speed oscillator bypass                               */
      __IOM uint32_t LSEDRV     : 2;            /*!< [4..3] LSE oscillator drive capability                                    */
      __IM  uint32_t            : 3;
      __IOM uint32_t RTCSEL     : 2;            /*!< [9..8] RTC clock source selection                                         */
      __IM  uint32_t            : 5;
      __IOM uint32_t RTCEN      : 1;            /*!< [15..15] RTC clock enable                                                 */
      __IOM uint32_t BDRST      : 1;            /*!< [16..16] Backup domain software reset                                     */
    } BDCR_b;
  } ;
  
  union {
    __IOM uint32_t CSR;                         /*!< (@ 0x00000024) Control/status register (RCC_CSR)                          */
    
