nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t LSION      : 1;            /*!< [0..0] Internal low speed oscillator enable                               */
      __IM  uint32_t LSIRDY     : 1;            /*!< [1..1] Internal low speed oscillator ready                                */
      __IM  uint32_t            : 22;
      __IOM uint32_t RMVF       : 1;            /*!< [24..24] Remove reset flag                                                */
      __IOM uint32_t OBLRSTF    : 1;            /*!< [25..25] Option byte loader reset flag                                    */
      __IOM uint32_t PINRSTF    : 1;            /*!< [26..26] PIN reset flag                                                   */
      __IOM uint32_t PORRSTF    : 1;            /*!< [27..27] POR/PDR reset flag                                               */
      __IOM uint32_t SFTRSTF    : 1;            /*!< [28..28] Software reset flag                                              */
      __IOM uint32_t IWDGRSTF   : 1;            /*!< [29..29] Independent watchdog reset flag                                  */
      __IOM uint32_t WWDGRSTF   : 1;            /*!< [30..30] Window watchdog reset flag                                       */
      __IOM uint32_t LPWRRSTF   : 1;            /*!< [31..31] Low-power reset flag                                             */
    } CSR_b;
  } ;
  
  union {
    __IOM uint32_t AHBRSTR;                     /*!< (@ 0x00000028) AHB peripheral reset register                              */
    
    struct {
      __IM  uint32_t            : 17;
      __IOM uint32_t IOPARST    : 1;            /*!< [17..17] I/O port A reset                                                 */
      __IOM uint32_t IOPBRST    : 1;            /*!< [18..18] I/O port B reset                                                 */
      __IOM uint32_t IOPCRST    : 1;            /*!< [19..19] I/O port C reset                                                 */
      __IM  uint32_t            : 2;
      __IOM uint32_t IOPFRST    : 1;            /*!< [22..22] I/O port F reset                                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t TSCRST     : 1;            /*!< [24..24] Touch sensing controller reset                                   */
    } AHBRSTR_b;
  } ;
  
  union {
    __IOM uint32_t CFGR2;                       /*!< (@ 0x0000002C) Clock configuration register 2                             */
    
    struct {
      __IOM uint32_t PREDIV     : 4;            /*!< [3..0] PREDIV division factor                                             */
    } CFGR2_b;
  } ;
  
  union {
    __IOM uint32_t CFGR3;                       /*!< (@ 0x00000030) Clock configuration register 3                             */
    
    struct {
      __IOM uint32_t USART1SW   : 2;            /*!< [1..0] USART1 clock source selection                                      */
      __IM  uint32_t            : 2;
      __IOM uint32_t I2C1SW     : 1;            /*!< [4..4] I2C1 clock source selection                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t CECSW      : 1;            /*!< [6..6] HDMI CEC clock source selection                                    */
      __IOM uint32_t USBSW      : 1;            /*!< [7..7] USB clock source selection                                         */
      __IOM uint32_t ADCSW      : 1;            /*!< [8..8] ADC clock source selection                                         */
      __IM  uint32_t            : 7;
      __IOM uint32_t USART2SW   : 2;            /*!< [17..16] USART2 clock source selection                                    */
    } CFGR3_b;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x00000034) Clock control register 2                                   */
    
    struct {
      __IOM uint32_t HSI14ON    : 1;            /*!< [0..0] HSI14 clock enable                                                 */
      __IM  uint32_t HSI14RDY   : 1;            /*!< [1..1] HR14 clock ready flag                                              */
      __IOM uint32_t HSI14DIS   : 1;            /*!< [2..2] HSI14 clock request from ADC disable                               */
      __IOM uint32_t HSI14TRIM  : 5;            /*!< [7..3] HSI14 clock trimming                                               */
      __IM  uint32_t HSI14CAL   : 8;            /*!< [15..8] HSI14 clock calibration                                           */
      __IOM uint32_t HSI48ON    : 1;            /*!< [16..16] HSI48 clock enable                                               */
      __IM  uint32_t HSI48RDY   : 1;            /*!< [17..17] HSI48 clock ready flag                                           */
      __IM  uint32_t            : 6;
      __IM  uint32_t HSI48CAL   : 1;            /*!< [24..24] HSI48 factory clock calibration                                  */
    } CR2_b;
  } ;
} RCC_Type;                                     /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                          SYSCFG                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief System configuration controller (SYSCFG)
  */

typedef struct {                                /*!< (@ 0x40010000) SYSCFG Structure                                           */
  
  union {
    __IOM uint32_t CFGR1;                       /*!< (@ 0x00000000) configuration register 1                                   */
    
    struct {
      __IOM uint32_t MEM_MODE   : 2;            /*!< [1..0] Memory mapping selection bits                                      */
      __IM  uint32_t            : 6;
      __IOM uint32_t ADC_DMA_RMP : 1;           /*!< [8..8] ADC DMA remapping bit                                              */
      __IOM uint32_t USART1_TX_DMA_RMP : 1;     /*!< [9..9] USART1_TX DMA remapping bit                                        */
      __IOM uint32_t USART1_RX_DMA_RMP : 1;     /*!< [10..10] USART1_RX DMA request remapping bit                              */
      __IOM uint32_t TIM16_DMA_RMP : 1;         /*!< [11..11] TIM16 DMA request remapping bit                                  */
      __IOM uint32_t TIM17_DMA_RMP : 1;         /*!< [12..12] TIM17 DMA request remapping bit                                  */
      __IM  uint32_t            : 3;
      __IOM uint32_t I2C_PB6_FM : 1;            /*!< [16..16] Fast Mode Plus (FM plus) driving capability activation
                                                     bits.                                                                     */
      __IOM uint32_t I2C_PB7_FM : 1;            /*!< [17..17] Fast Mode Plus (FM+) driving capability activation
                                                     bits.                                                                     */
      __IOM uint32_t I2C_PB8_FM : 1;            /*!< [18..18] Fast Mode Plus (FM+) driving capability activation
                                                     bits.                                                                     */
      __IOM uint32_t I2C_PB9_FM : 1;            /*!< [19..19] Fast Mode Plus (FM+) driving capability activation
                                                     bits.                                                                     */
      __IOM uint32_t I2C1_FM_plus : 1;          /*!< [20..20] FM+ driving capability activation for I2C1                       */
      __IOM uint32_t I2C2_FM_plus : 1;          /*!< [21..21] FM+ driving capability activation for I2C2                       */
      __IM  uint32_t            : 2;
      __IOM uint32_t SPI2_DMA_RMP : 1;          /*!< [24..24] SPI2 DMA request remapping bit                                   */
      __IOM uint32_t USART2_DMA_RMP : 1;        /*!< [25..25] USART2 DMA request remapping bit                                 */
      __IOM uint32_t USART3_DMA_RMP : 1;        /*!< [26..26] USART3 DMA request remapping bit                                 */
      __IOM uint32_t I2C1_DMA_RMP : 1;          /*!< [27..27] I2C1 DMA request remapping bit                                   */
      __IOM uint32_t TIM1_DMA_RMP : 1;          /*!< [28..28] TIM1 DMA request remapping bit                                   */
      __IOM uint32_t TIM2_DMA_RMP : 1;          /*!< [29..29] TIM2 DMA request remapping bit                                   */
      __IOM uint32_t TIM3_DMA_RMP : 1;          /*!< [30..30] TIM3 DMA request remapping bit                                   */
    } CFGR1_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t EXTICR1;                     /*!< (@ 0x00000008) external interrupt configuration register 1                */
    
