nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t EXTI0      : 4;            /*!< [3..0] EXTI 0 configuration bits                                          */
      __IOM uint32_t EXTI1      : 4;            /*!< [7..4] EXTI 1 configuration bits                                          */
      __IOM uint32_t EXTI2      : 4;            /*!< [11..8] EXTI 2 configuration bits                                         */
      __IOM uint32_t EXTI3      : 4;            /*!< [15..12] EXTI 3 configuration bits                                        */
    } EXTICR1_b;
  } ;
  
  union {
    __IOM uint32_t EXTICR2;                     /*!< (@ 0x0000000C) external interrupt configuration register 2                */
    
    struct {
      __IOM uint32_t EXTI4      : 4;            /*!< [3..0] EXTI 4 configuration bits                                          */
      __IOM uint32_t EXTI5      : 4;            /*!< [7..4] EXTI 5 configuration bits                                          */
      __IOM uint32_t EXTI6      : 4;            /*!< [11..8] EXTI 6 configuration bits                                         */
      __IOM uint32_t EXTI7      : 4;            /*!< [15..12] EXTI 7 configuration bits                                        */
    } EXTICR2_b;
  } ;
  
  union {
    __IOM uint32_t EXTICR3;                     /*!< (@ 0x00000010) external interrupt configuration register 3                */
    
    struct {
      __IOM uint32_t EXTI8      : 4;            /*!< [3..0] EXTI 8 configuration bits                                          */
      __IOM uint32_t EXTI9      : 4;            /*!< [7..4] EXTI 9 configuration bits                                          */
      __IOM uint32_t EXTI10     : 4;            /*!< [11..8] EXTI 10 configuration bits                                        */
      __IOM uint32_t EXTI11     : 4;            /*!< [15..12] EXTI 11 configuration bits                                       */
    } EXTICR3_b;
  } ;
  
  union {
    __IOM uint32_t EXTICR4;                     /*!< (@ 0x00000014) external interrupt configuration register 4                */
    
    struct {
      __IOM uint32_t EXTI12     : 4;            /*!< [3..0] EXTI 12 configuration bits                                         */
      __IOM uint32_t EXTI13     : 4;            /*!< [7..4] EXTI 13 configuration bits                                         */
      __IOM uint32_t EXTI14     : 4;            /*!< [11..8] EXTI 14 configuration bits                                        */
      __IOM uint32_t EXTI15     : 4;            /*!< [15..12] EXTI 15 configuration bits                                       */
    } EXTICR4_b;
  } ;
  
  union {
    __IOM uint32_t CFGR2;                       /*!< (@ 0x00000018) configuration register 2                                   */
    
    struct {
      __IOM uint32_t LOCUP_LOCK : 1;            /*!< [0..0] Cortex-M0 LOCKUP bit enable bit                                    */
      __IOM uint32_t SRAM_PARITY_LOCK : 1;      /*!< [1..1] SRAM parity lock bit                                               */
      __IOM uint32_t PVD_LOCK   : 1;            /*!< [2..2] PVD lock enable bit                                                */
      __IM  uint32_t            : 5;
      __IOM uint32_t SRAM_PEF   : 1;            /*!< [8..8] SRAM parity flag                                                   */
    } CFGR2_b;
  } ;
} SYSCFG_Type;                                  /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog-to-digital converter (ADC)
  */

typedef struct {                                /*!< (@ 0x40012400) ADC Structure                                              */
  
  union {
    __IOM uint32_t ISR;                         /*!< (@ 0x00000000) interrupt and status register                              */
    
    struct {
      __IOM uint32_t ADRDY      : 1;            /*!< [0..0] ADC ready                                                          */
      __IOM uint32_t EOSMP      : 1;            /*!< [1..1] End of sampling flag                                               */
      __IOM uint32_t EOC        : 1;            /*!< [2..2] End of conversion flag                                             */
      __IOM uint32_t EOS        : 1;            /*!< [3..3] End of sequence flag                                               */
      __IOM uint32_t OVR        : 1;            /*!< [4..4] ADC overrun                                                        */
      __IM  uint32_t            : 2;
      __IOM uint32_t AWD        : 1;            /*!< [7..7] Analog watchdog flag                                               */
    } ISR_b;
  } ;
  
  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000004) interrupt enable register                                  */
    
    struct {
      __IOM uint32_t ADRDYIE    : 1;            /*!< [0..0] ADC ready interrupt enable                                         */
      __IOM uint32_t EOSMPIE    : 1;            /*!< [1..1] End of sampling flag interrupt enable                              */
      __IOM uint32_t EOCIE      : 1;            /*!< [2..2] End of conversion interrupt enable                                 */
      __IOM uint32_t EOSIE      : 1;            /*!< [3..3] End of conversion sequence interrupt enable                        */
      __IOM uint32_t OVRIE      : 1;            /*!< [4..4] Overrun interrupt enable                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t AWDIE      : 1;            /*!< [7..7] Analog watchdog interrupt enable                                   */
    } IER_b;
  } ;
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000008) control register                                           */
    
