nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t ADEN       : 1;            /*!< [0..0] ADC enable command                                                 */
      __IOM uint32_t ADDIS      : 1;            /*!< [1..1] ADC disable command                                                */
      __IOM uint32_t ADSTART    : 1;            /*!< [2..2] ADC start conversion command                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t ADSTP      : 1;            /*!< [4..4] ADC stop conversion command                                        */
      __IM  uint32_t            : 26;
      __IOM uint32_t ADCAL      : 1;            /*!< [31..31] ADC calibration                                                  */
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t CFGR1;                       /*!< (@ 0x0000000C) configuration register 1                                   */
    
    struct {
      __IOM uint32_t DMAEN      : 1;            /*!< [0..0] Direct memory access enable                                        */
      __IOM uint32_t DMACFG     : 1;            /*!< [1..1] Direct memery access configuration                                 */
      __IOM uint32_t SCANDIR    : 1;            /*!< [2..2] Scan sequence direction                                            */
      __IOM uint32_t RES        : 2;            /*!< [4..3] Data resolution                                                    */
      __IOM uint32_t ALIGN      : 1;            /*!< [5..5] Data alignment                                                     */
      __IOM uint32_t EXTSEL     : 3;            /*!< [8..6] External trigger selection                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t EXTEN      : 2;            /*!< [11..10] External trigger enable and polarity selection                   */
      __IOM uint32_t OVRMOD     : 1;            /*!< [12..12] Overrun management mode                                          */
      __IOM uint32_t CONT       : 1;            /*!< [13..13] Single / continuous conversion mode                              */
      __IOM uint32_t AUTDLY     : 1;            /*!< [14..14] Auto-delayed conversion mode                                     */
      __IOM uint32_t AUTOFF     : 1;            /*!< [15..15] Auto-off mode                                                    */
      __IOM uint32_t DISCEN     : 1;            /*!< [16..16] Discontinuous mode                                               */
      __IM  uint32_t            : 5;
      __IOM uint32_t AWDSGL     : 1;            /*!< [22..22] Enable the watchdog on a single channel or on all channels       */
      __IOM uint32_t AWDEN      : 1;            /*!< [23..23] Analog watchdog enable                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t AWDCH      : 5;            /*!< [30..26] Analog watchdog channel selection                                */
    } CFGR1_b;
  } ;
  
  union {
    __IOM uint32_t CFGR2;                       /*!< (@ 0x00000010) configuration register 2                                   */
    
    struct {
      __IM  uint32_t            : 30;
      __IOM uint32_t JITOFF_D2  : 1;            /*!< [30..30] JITOFF_D2                                                        */
      __IOM uint32_t JITOFF_D4  : 1;            /*!< [31..31] JITOFF_D4                                                        */
    } CFGR2_b;
  } ;
  
  union {
    __IOM uint32_t SMPR;                        /*!< (@ 0x00000014) sampling time register                                     */
    
    struct {
      __IOM uint32_t SMPR       : 3;            /*!< [2..0] Sampling time selection                                            */
    } SMPR_b;
  } ;
  __IM  uint32_t  RESERVED[2];
  
  union {
    __IOM uint32_t TR;                          /*!< (@ 0x00000020) watchdog threshold register                                */
    
    struct {
      __IOM uint32_t LT         : 12;           /*!< [11..0] Analog watchdog lower threshold                                   */
      __IM  uint32_t            : 4;
      __IOM uint32_t HT         : 12;           /*!< [27..16] Analog watchdog higher threshold                                 */
    } TR_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t CHSELR;                      /*!< (@ 0x00000028) channel selection register                                 */
    
    struct {
      __IOM uint32_t CHSEL0     : 1;            /*!< [0..0] Channel-x selection                                                */
      __IOM uint32_t CHSEL1     : 1;            /*!< [1..1] Channel-x selection                                                */
      __IOM uint32_t CHSEL2     : 1;            /*!< [2..2] Channel-x selection                                                */
      __IOM uint32_t CHSEL3     : 1;            /*!< [3..3] Channel-x selection                                                */
      __IOM uint32_t CHSEL4     : 1;            /*!< [4..4] Channel-x selection                                                */
      __IOM uint32_t CHSEL5     : 1;            /*!< [5..5] Channel-x selection                                                */
      __IOM uint32_t CHSEL6     : 1;            /*!< [6..6] Channel-x selection                                                */
      __IOM uint32_t CHSEL7     : 1;            /*!< [7..7] Channel-x selection                                                */
      __IOM uint32_t CHSEL8     : 1;            /*!< [8..8] Channel-x selection                                                */
      __IOM uint32_t CHSEL9     : 1;            /*!< [9..9] Channel-x selection                                                */
      __IOM uint32_t CHSEL10    : 1;            /*!< [10..10] Channel-x selection                                              */
      __IOM uint32_t CHSEL11    : 1;            /*!< [11..11] Channel-x selection                                              */
      __IOM uint32_t CHSEL12    : 1;            /*!< [12..12] Channel-x selection                                              */
      __IOM uint32_t CHSEL13    : 1;            /*!< [13..13] Channel-x selection                                              */
      __IOM uint32_t CHSEL14    : 1;            /*!< [14..14] Channel-x selection                                              */
      __IOM uint32_t CHSEL15    : 1;            /*!< [15..15] Channel-x selection                                              */
      __IOM uint32_t CHSEL16    : 1;            /*!< [16..16] Channel-x selection                                              */
      __IOM uint32_t CHSEL17    : 1;            /*!< [17..17] Channel-x selection                                              */
      __IOM uint32_t CHSEL18    : 1;            /*!< [18..18] Channel-x selection                                              */
    } CHSELR_b;
  } ;
  __IM  uint32_t  RESERVED2[5];
  
  union {
    __IM  uint32_t DR;                          /*!< (@ 0x00000040) data register                                              */
    
