nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IM  uint32_t DATA       : 16;           /*!< [15..0] Converted data                                                    */
    } DR_b;
  } ;
  __IM  uint32_t  RESERVED3[177];
  
  union {
    __IOM uint32_t CCR;                         /*!< (@ 0x00000308) common configuration register                              */
    
    struct {
      __IM  uint32_t            : 22;
      __IOM uint32_t VREFEN     : 1;            /*!< [22..22] Temperature sensor and VREFINT enable                            */
      __IOM uint32_t TSEN       : 1;            /*!< [23..23] Temperature sensor enable                                        */
      __IOM uint32_t VBATEN     : 1;            /*!< [24..24] VBAT enable                                                      */
    } CCR_b;
  } ;
} ADC_Type;                                     /*!< Size = 780 (0x30c)                                                        */



/* =========================================================================================================================== */
/* ================                                          USART1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal synchronous asynchronous receiver       transmitter (USART1)
  */

typedef struct {                                /*!< (@ 0x40013800) USART1 Structure                                           */
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000000) Control register 1                                         */
    
    struct {
      __IOM uint32_t UE         : 1;            /*!< [0..0] USART enable                                                       */
      __IOM uint32_t UESM       : 1;            /*!< [1..1] USART enable in Stop mode                                          */
      __IOM uint32_t RE         : 1;            /*!< [2..2] Receiver enable                                                    */
      __IOM uint32_t TE         : 1;            /*!< [3..3] Transmitter enable                                                 */
      __IOM uint32_t IDLEIE     : 1;            /*!< [4..4] IDLE interrupt enable                                              */
      __IOM uint32_t RXNEIE     : 1;            /*!< [5..5] RXNE interrupt enable                                              */
      __IOM uint32_t TCIE       : 1;            /*!< [6..6] Transmission complete interrupt enable                             */
      __IOM uint32_t TXEIE      : 1;            /*!< [7..7] interrupt enable                                                   */
      __IOM uint32_t PEIE       : 1;            /*!< [8..8] PE interrupt enable                                                */
      __IOM uint32_t PS         : 1;            /*!< [9..9] Parity selection                                                   */
      __IOM uint32_t PCE        : 1;            /*!< [10..10] Parity control enable                                            */
      __IOM uint32_t WAKE       : 1;            /*!< [11..11] Receiver wakeup method                                           */
      __IOM uint32_t M          : 1;            /*!< [12..12] Word length                                                      */
      __IOM uint32_t MME        : 1;            /*!< [13..13] Mute mode enable                                                 */
      __IOM uint32_t CMIE       : 1;            /*!< [14..14] Character match interrupt enable                                 */
      __IOM uint32_t OVER8      : 1;            /*!< [15..15] Oversampling mode                                                */
      __IOM uint32_t DEDT       : 5;            /*!< [20..16] Driver Enable deassertion time                                   */
      __IOM uint32_t DEAT       : 5;            /*!< [25..21] Driver Enable assertion time                                     */
      __IOM uint32_t RTOIE      : 1;            /*!< [26..26] Receiver timeout interrupt enable                                */
      __IOM uint32_t EOBIE      : 1;            /*!< [27..27] End of Block interrupt enable                                    */
      __IOM uint32_t M1         : 1;            /*!< [28..28] Word length                                                      */
    } CR1_b;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x00000004) Control register 2                                         */
    
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t ADDM7      : 1;            /*!< [4..4] 7-bit Address Detection/4-bit Address Detection                    */
      __IOM uint32_t LBDL       : 1;            /*!< [5..5] LIN break detection length                                         */
      __IOM uint32_t LBDIE      : 1;            /*!< [6..6] LIN break detection interrupt enable                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t LBCL       : 1;            /*!< [8..8] Last bit clock pulse                                               */
      __IOM uint32_t CPHA       : 1;            /*!< [9..9] Clock phase                                                        */
      __IOM uint32_t CPOL       : 1;            /*!< [10..10] Clock polarity                                                   */
      __IOM uint32_t CLKEN      : 1;            /*!< [11..11] Clock enable                                                     */
      __IOM uint32_t STOP       : 2;            /*!< [13..12] STOP bits                                                        */
      __IOM uint32_t LINEN      : 1;            /*!< [14..14] LIN mode enable                                                  */
      __IOM uint32_t SWAP       : 1;            /*!< [15..15] Swap TX/RX pins                                                  */
      __IOM uint32_t RXINV      : 1;            /*!< [16..16] RX pin active level inversion                                    */
      __IOM uint32_t TXINV      : 1;            /*!< [17..17] TX pin active level inversion                                    */
      __IOM uint32_t DATAINV    : 1;            /*!< [18..18] Binary data inversion                                            */
      __IOM uint32_t MSBFIRST   : 1;            /*!< [19..19] Most significant bit first                                       */
      __IOM uint32_t ABREN      : 1;            /*!< [20..20] Auto baud rate enable                                            */
      __IOM uint32_t ABRMOD     : 2;            /*!< [22..21] Auto baud rate mode                                              */
      __IOM uint32_t RTOEN      : 1;            /*!< [23..23] Receiver timeout enable                                          */
      __IOM uint32_t ADD0       : 4;            /*!< [27..24] Address of the USART node                                        */
      __IOM uint32_t ADD4       : 4;            /*!< [31..28] Address of the USART node                                        */
    } CR2_b;
  } ;
  
  union {
    __IOM uint32_t CR3;                         /*!< (@ 0x00000008) Control register 3                                         */
    
