nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t EIE        : 1;            /*!< [0..0] Error interrupt enable                                             */
      __IOM uint32_t IREN       : 1;            /*!< [1..1] IrDA mode enable                                                   */
      __IOM uint32_t IRLP       : 1;            /*!< [2..2] IrDA low-power                                                     */
      __IOM uint32_t HDSEL      : 1;            /*!< [3..3] Half-duplex selection                                              */
      __IOM uint32_t NACK       : 1;            /*!< [4..4] Smartcard NACK enable                                              */
      __IOM uint32_t SCEN       : 1;            /*!< [5..5] Smartcard mode enable                                              */
      __IOM uint32_t DMAR       : 1;            /*!< [6..6] DMA enable receiver                                                */
      __IOM uint32_t DMAT       : 1;            /*!< [7..7] DMA enable transmitter                                             */
      __IOM uint32_t RTSE       : 1;            /*!< [8..8] RTS enable                                                         */
      __IOM uint32_t CTSE       : 1;            /*!< [9..9] CTS enable                                                         */
      __IOM uint32_t CTSIE      : 1;            /*!< [10..10] CTS interrupt enable                                             */
      __IOM uint32_t ONEBIT     : 1;            /*!< [11..11] One sample bit method enable                                     */
      __IOM uint32_t OVRDIS     : 1;            /*!< [12..12] Overrun Disable                                                  */
      __IOM uint32_t DDRE       : 1;            /*!< [13..13] DMA Disable on Reception Error                                   */
      __IOM uint32_t DEM        : 1;            /*!< [14..14] Driver enable mode                                               */
      __IOM uint32_t DEP        : 1;            /*!< [15..15] Driver enable polarity selection                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t SCARCNT    : 3;            /*!< [19..17] Smartcard auto-retry count                                       */
      __IOM uint32_t WUS        : 2;            /*!< [21..20] Wakeup from Stop mode interrupt flag selection                   */
      __IOM uint32_t WUFIE      : 1;            /*!< [22..22] Wakeup from Stop mode interrupt enable                           */
    } CR3_b;
  } ;
  
  union {
    __IOM uint32_t BRR;                         /*!< (@ 0x0000000C) Baud rate register                                         */
    
    struct {
      __IOM uint32_t DIV_Fraction : 4;          /*!< [3..0] fraction of USARTDIV                                               */
      __IOM uint32_t DIV_Mantissa : 12;         /*!< [15..4] mantissa of USARTDIV                                              */
    } BRR_b;
  } ;
  
  union {
    __IOM uint32_t GTPR;                        /*!< (@ 0x00000010) Guard time and prescaler register                          */
    
    struct {
      __IOM uint32_t PSC        : 8;            /*!< [7..0] Prescaler value                                                    */
      __IOM uint32_t GT         : 8;            /*!< [15..8] Guard time value                                                  */
    } GTPR_b;
  } ;
  
  union {
    __IOM uint32_t RTOR;                        /*!< (@ 0x00000014) Receiver timeout register                                  */
    
    struct {
      __IOM uint32_t RTO        : 24;           /*!< [23..0] Receiver timeout value                                            */
      __IOM uint32_t BLEN       : 8;            /*!< [31..24] Block Length                                                     */
    } RTOR_b;
  } ;
  
  union {
    __IOM uint32_t RQR;                         /*!< (@ 0x00000018) Request register                                           */
    
    struct {
      __IOM uint32_t ABRRQ      : 1;            /*!< [0..0] Auto baud rate request                                             */
      __IOM uint32_t SBKRQ      : 1;            /*!< [1..1] Send break request                                                 */
      __IOM uint32_t MMRQ       : 1;            /*!< [2..2] Mute mode request                                                  */
      __IOM uint32_t RXFRQ      : 1;            /*!< [3..3] Receive data flush request                                         */
      __IOM uint32_t TXFRQ      : 1;            /*!< [4..4] Transmit data flush request                                        */
    } RQR_b;
  } ;
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x0000001C) Interrupt & status register                                */
    
    struct {
      __IM  uint32_t PE         : 1;            /*!< [0..0] Parity error                                                       */
      __IM  uint32_t FE         : 1;            /*!< [1..1] Framing error                                                      */
      __IM  uint32_t NF         : 1;            /*!< [2..2] Noise detected flag                                                */
      __IM  uint32_t ORE        : 1;            /*!< [3..3] Overrun error                                                      */
      __IM  uint32_t IDLE       : 1;            /*!< [4..4] Idle line detected                                                 */
      __IM  uint32_t RXNE       : 1;            /*!< [5..5] Read data register not empty                                       */
      __IM  uint32_t TC         : 1;            /*!< [6..6] Transmission complete                                              */
      __IM  uint32_t TXE        : 1;            /*!< [7..7] Transmit data register empty                                       */
      __IM  uint32_t LBDF       : 1;            /*!< [8..8] LIN break detection flag                                           */
      __IM  uint32_t CTSIF      : 1;            /*!< [9..9] CTS interrupt flag                                                 */
      __IM  uint32_t CTS        : 1;            /*!< [10..10] CTS flag                                                         */
      __IM  uint32_t RTOF       : 1;            /*!< [11..11] Receiver timeout                                                 */
      __IM  uint32_t EOBF       : 1;            /*!< [12..12] End of block flag                                                */
      __IM  uint32_t            : 1;
      __IM  uint32_t ABRE       : 1;            /*!< [14..14] Auto baud rate error                                             */
      __IM  uint32_t ABRF       : 1;            /*!< [15..15] Auto baud rate flag                                              */
      __IM  uint32_t BUSY       : 1;            /*!< [16..16] Busy flag                                                        */
      __IM  uint32_t CMF        : 1;            /*!< [17..17] character match flag                                             */
      __IM  uint32_t SBKF       : 1;            /*!< [18..18] Send break flag                                                  */
      __IM  uint32_t RWU        : 1;            /*!< [19..19] Receiver wakeup from Mute mode                                   */
      __IM  uint32_t WUF        : 1;            /*!< [20..20] Wakeup from Stop mode flag                                       */
      __IM  uint32_t TEACK      : 1;            /*!< [21..21] Transmit enable acknowledge flag                                 */
      __IM  uint32_t REACK      : 1;            /*!< [22..22] Receive enable acknowledge flag                                  */
    } ISR_b;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000020) Interrupt flag clear register                              */
    
