nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t PECF       : 1;            /*!< [0..0] Parity error clear flag                                            */
      __IOM uint32_t FECF       : 1;            /*!< [1..1] Framing error clear flag                                           */
      __IOM uint32_t NCF        : 1;            /*!< [2..2] Noise detected clear flag                                          */
      __IOM uint32_t ORECF      : 1;            /*!< [3..3] Overrun error clear flag                                           */
      __IOM uint32_t IDLECF     : 1;            /*!< [4..4] Idle line detected clear flag                                      */
      __IM  uint32_t            : 1;
      __IOM uint32_t TCCF       : 1;            /*!< [6..6] Transmission complete clear flag                                   */
      __IM  uint32_t            : 1;
      __IOM uint32_t LBDCF      : 1;            /*!< [8..8] LIN break detection clear flag                                     */
      __IOM uint32_t CTSCF      : 1;            /*!< [9..9] CTS clear flag                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t RTOCF      : 1;            /*!< [11..11] Receiver timeout clear flag                                      */
      __IOM uint32_t EOBCF      : 1;            /*!< [12..12] End of timeout clear flag                                        */
      __IM  uint32_t            : 4;
      __IOM uint32_t CMCF       : 1;            /*!< [17..17] Character match clear flag                                       */
      __IM  uint32_t            : 2;
      __IOM uint32_t WUCF       : 1;            /*!< [20..20] Wakeup from Stop mode clear flag                                 */
    } ICR_b;
  } ;
  
  union {
    __IM  uint32_t RDR;                         /*!< (@ 0x00000024) Receive data register                                      */
    
    struct {
      __IM  uint32_t RDR        : 9;            /*!< [8..0] Receive data value                                                 */
    } RDR_b;
  } ;
  
  union {
    __IOM uint32_t TDR;                         /*!< (@ 0x00000028) Transmit data register                                     */
    
    struct {
      __IOM uint32_t TDR        : 9;            /*!< [8..0] Transmit data value                                                */
    } TDR_b;
  } ;
} USART1_Type;                                  /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                           COMP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Comparator (COMP)
  */

typedef struct {                                /*!< (@ 0x4001001C) COMP Structure                                             */
  
  union {
    __IOM uint32_t CSR;                         /*!< (@ 0x00000000) control and status register                                */
    
    struct {
      __IOM uint32_t COMP1EN    : 1;            /*!< [0..0] Comparator 1 enable                                                */
      __IOM uint32_t COMP1_INP_DAC : 1;         /*!< [1..1] COMP1_INP_DAC                                                      */
      __IOM uint32_t COMP1MODE  : 2;            /*!< [3..2] Comparator 1 mode                                                  */
      __IOM uint32_t COMP1INSEL : 3;            /*!< [6..4] Comparator 1 inverting input selection                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t COMP1OUTSEL : 3;           /*!< [10..8] Comparator 1 output selection                                     */
      __IOM uint32_t COMP1POL   : 1;            /*!< [11..11] Comparator 1 output polarity                                     */
      __IOM uint32_t COMP1HYST  : 2;            /*!< [13..12] Comparator 1 hysteresis                                          */
      __IM  uint32_t COMP1OUT   : 1;            /*!< [14..14] Comparator 1 output                                              */
      __IOM uint32_t COMP1LOCK  : 1;            /*!< [15..15] Comparator 1 lock                                                */
      __IOM uint32_t COMP2EN    : 1;            /*!< [16..16] Comparator 2 enable                                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t COMP2MODE  : 2;            /*!< [19..18] Comparator 2 mode                                                */
      __IOM uint32_t COMP2INSEL : 3;            /*!< [22..20] Comparator 2 inverting input selection                           */
      __IOM uint32_t WNDWEN     : 1;            /*!< [23..23] Window mode enable                                               */
      __IOM uint32_t COMP2OUTSEL : 3;           /*!< [26..24] Comparator 2 output selection                                    */
      __IOM uint32_t COMP2POL   : 1;            /*!< [27..27] Comparator 2 output polarity                                     */
      __IOM uint32_t COMP2HYST  : 2;            /*!< [29..28] Comparator 2 hysteresis                                          */
      __IM  uint32_t COMP2OUT   : 1;            /*!< [30..30] Comparator 2 output                                              */
      __IOM uint32_t COMP2LOCK  : 1;            /*!< [31..31] Comparator 2 lock                                                */
    } CSR_b;
  } ;
} COMP_Type;                                    /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real-time clock (RTC)
  */

typedef struct {                                /*!< (@ 0x40002800) RTC Structure                                              */
  
  union {
    __IOM uint32_t TR;                          /*!< (@ 0x00000000) time register                                              */
    
