nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t SU         : 4;            /*!< [3..0] Second units in BCD format                                         */
      __IOM uint32_t ST         : 3;            /*!< [6..4] Second tens in BCD format                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t MNU        : 4;            /*!< [11..8] Minute units in BCD format                                        */
      __IOM uint32_t MNT        : 3;            /*!< [14..12] Minute tens in BCD format                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t HU         : 4;            /*!< [19..16] Hour units in BCD format                                         */
      __IOM uint32_t HT         : 2;            /*!< [21..20] Hour tens in BCD format                                          */
      __IOM uint32_t PM         : 1;            /*!< [22..22] AM/PM notation                                                   */
    } TR_b;
  } ;
  
  union {
    __IOM uint32_t DR;                          /*!< (@ 0x00000004) date register                                              */
    
    struct {
      __IOM uint32_t DU         : 4;            /*!< [3..0] Date units in BCD format                                           */
      __IOM uint32_t DT         : 2;            /*!< [5..4] Date tens in BCD format                                            */
      __IM  uint32_t            : 2;
      __IOM uint32_t MU         : 4;            /*!< [11..8] Month units in BCD format                                         */
      __IOM uint32_t MT         : 1;            /*!< [12..12] Month tens in BCD format                                         */
      __IOM uint32_t WDU        : 3;            /*!< [15..13] Week day units                                                   */
      __IOM uint32_t YU         : 4;            /*!< [19..16] Year units in BCD format                                         */
      __IOM uint32_t YT         : 4;            /*!< [23..20] Year tens in BCD format                                          */
    } DR_b;
  } ;
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000008) control register                                           */
    
    struct {
      __IM  uint32_t            : 3;
      __IOM uint32_t TSEDGE     : 1;            /*!< [3..3] Time-stamp event active edge                                       */
      __IOM uint32_t REFCKON    : 1;            /*!< [4..4] RTC_REFIN reference clock detection enable (50 or 60
                                                     Hz)                                                                       */
      __IOM uint32_t BYPSHAD    : 1;            /*!< [5..5] Bypass the shadow registers                                        */
      __IOM uint32_t FMT        : 1;            /*!< [6..6] Hour format                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t ALRAE      : 1;            /*!< [8..8] Alarm A enable                                                     */
      __IM  uint32_t            : 2;
      __IOM uint32_t TSE        : 1;            /*!< [11..11] timestamp enable                                                 */
      __IOM uint32_t ALRAIE     : 1;            /*!< [12..12] Alarm A interrupt enable                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t TSIE       : 1;            /*!< [15..15] Time-stamp interrupt enable                                      */
      __OM  uint32_t ADD1H      : 1;            /*!< [16..16] Add 1 hour (summer time change)                                  */
      __OM  uint32_t SUB1H      : 1;            /*!< [17..17] Subtract 1 hour (winter time change)                             */
      __IOM uint32_t BKP        : 1;            /*!< [18..18] Backup                                                           */
      __IOM uint32_t COSEL      : 1;            /*!< [19..19] Calibration output selection                                     */
      __IOM uint32_t POL        : 1;            /*!< [20..20] Output polarity                                                  */
      __IOM uint32_t OSEL       : 2;            /*!< [22..21] Output selection                                                 */
      __IOM uint32_t COE        : 1;            /*!< [23..23] Calibration output enable                                        */
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t ISR;                         /*!< (@ 0x0000000C) initialization and status register                         */
    
    struct {
      __IM  uint32_t ALRAWF     : 1;            /*!< [0..0] Alarm A write flag                                                 */
      __IM  uint32_t            : 2;
      __IOM uint32_t SHPF       : 1;            /*!< [3..3] Shift operation pending                                            */
      __IM  uint32_t INITS      : 1;            /*!< [4..4] Initialization status flag                                         */
      __IOM uint32_t RSF        : 1;            /*!< [5..5] Registers synchronization flag                                     */
      __IM  uint32_t INITF      : 1;            /*!< [6..6] Initialization flag                                                */
      __IOM uint32_t INIT       : 1;            /*!< [7..7] Initialization mode                                                */
      __IOM uint32_t ALRAF      : 1;            /*!< [8..8] Alarm A flag                                                       */
      __IM  uint32_t            : 2;
      __IOM uint32_t TSF        : 1;            /*!< [11..11] Time-stamp flag                                                  */
      __IOM uint32_t TSOVF      : 1;            /*!< [12..12] Time-stamp overflow flag                                         */
      __IOM uint32_t TAMP1F     : 1;            /*!< [13..13] RTC_TAMP1 detection flag                                         */
      __IOM uint32_t TAMP2F     : 1;            /*!< [14..14] RTC_TAMP2 detection flag                                         */
      __IM  uint32_t            : 1;
      __IM  uint32_t RECALPF    : 1;            /*!< [16..16] Recalibration pending Flag                                       */
    } ISR_b;
  } ;
  
  union {
    __IOM uint32_t PRER;                        /*!< (@ 0x00000010) prescaler register                                         */
    
