nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t PREDIV_S   : 15;           /*!< [14..0] Synchronous prescaler factor                                      */
      __IM  uint32_t            : 1;
      __IOM uint32_t PREDIV_A   : 7;            /*!< [22..16] Asynchronous prescaler factor                                    */
    } PRER_b;
  } ;
  __IM  uint32_t  RESERVED[2];
  
  union {
    __IOM uint32_t ALRMAR;                      /*!< (@ 0x0000001C) alarm A register                                           */
    
    struct {
      __IOM uint32_t SU         : 4;            /*!< [3..0] Second units in BCD format.                                        */
      __IOM uint32_t ST         : 3;            /*!< [6..4] Second tens in BCD format.                                         */
      __IOM uint32_t MSK1       : 1;            /*!< [7..7] Alarm A seconds mask                                               */
      __IOM uint32_t MNU        : 4;            /*!< [11..8] Minute units in BCD format.                                       */
      __IOM uint32_t MNT        : 3;            /*!< [14..12] Minute tens in BCD format.                                       */
      __IOM uint32_t MSK2       : 1;            /*!< [15..15] Alarm A minutes mask                                             */
      __IOM uint32_t HU         : 4;            /*!< [19..16] Hour units in BCD format.                                        */
      __IOM uint32_t HT         : 2;            /*!< [21..20] Hour tens in BCD format.                                         */
      __IOM uint32_t PM         : 1;            /*!< [22..22] AM/PM notation                                                   */
      __IOM uint32_t MSK3       : 1;            /*!< [23..23] Alarm A hours mask                                               */
      __IOM uint32_t DU         : 4;            /*!< [27..24] Date units or day in BCD format.                                 */
      __IOM uint32_t DT         : 2;            /*!< [29..28] Date tens in BCD format.                                         */
      __IOM uint32_t WDSEL      : 1;            /*!< [30..30] Week day selection                                               */
      __IOM uint32_t MSK4       : 1;            /*!< [31..31] Alarm A date mask                                                */
    } ALRMAR_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __OM  uint32_t WPR;                         /*!< (@ 0x00000024) write protection register                                  */
    
    struct {
      __OM  uint32_t KEY        : 8;            /*!< [7..0] Write protection key                                               */
    } WPR_b;
  } ;
  
  union {
    __IM  uint32_t SSR;                         /*!< (@ 0x00000028) sub second register                                        */
    
    struct {
      __IM  uint32_t SS         : 16;           /*!< [15..0] Sub second value                                                  */
    } SSR_b;
  } ;
  
  union {
    __OM  uint32_t SHIFTR;                      /*!< (@ 0x0000002C) shift control register                                     */
    
    struct {
      __OM  uint32_t SUBFS      : 15;           /*!< [14..0] Subtract a fraction of a second                                   */
      __IM  uint32_t            : 16;
      __OM  uint32_t ADD1S      : 1;            /*!< [31..31] Reserved                                                         */
    } SHIFTR_b;
  } ;
  
  union {
    __IM  uint32_t TSTR;                        /*!< (@ 0x00000030) timestamp time register                                    */
    
    struct {
      __IM  uint32_t SU         : 4;            /*!< [3..0] Second units in BCD format.                                        */
      __IM  uint32_t ST         : 3;            /*!< [6..4] Second tens in BCD format.                                         */
      __IM  uint32_t            : 1;
      __IM  uint32_t MNU        : 4;            /*!< [11..8] Minute units in BCD format.                                       */
      __IM  uint32_t MNT        : 3;            /*!< [14..12] Minute tens in BCD format.                                       */
      __IM  uint32_t            : 1;
      __IM  uint32_t HU         : 4;            /*!< [19..16] Hour units in BCD format.                                        */
      __IM  uint32_t HT         : 2;            /*!< [21..20] Hour tens in BCD format.                                         */
      __IM  uint32_t PM         : 1;            /*!< [22..22] AM/PM notation                                                   */
    } TSTR_b;
  } ;
  
  union {
    __IM  uint32_t TSDR;                        /*!< (@ 0x00000034) timestamp date register                                    */
    
    struct {
      __IM  uint32_t DU         : 4;            /*!< [3..0] Date units in BCD format                                           */
      __IM  uint32_t DT         : 2;            /*!< [5..4] Date tens in BCD format                                            */
      __IM  uint32_t            : 2;
      __IM  uint32_t MU         : 4;            /*!< [11..8] Month units in BCD format                                         */
      __IM  uint32_t MT         : 1;            /*!< [12..12] Month tens in BCD format                                         */
      __IM  uint32_t WDU        : 3;            /*!< [15..13] Week day units                                                   */
    } TSDR_b;
  } ;
  
  union {
    __IM  uint32_t TSSSR;                       /*!< (@ 0x00000038) time-stamp sub second register                             */
    
    struct {
      __IM  uint32_t SS         : 16;           /*!< [15..0] Sub second value                                                  */
    } TSSSR_b;
  } ;
  
  union {
    __IOM uint32_t CALR;                        /*!< (@ 0x0000003C) calibration register                                       */
    
    struct {
      __IOM uint32_t CALM       : 9;            /*!< [8..0] Calibration minus                                                  */
      __IM  uint32_t            : 4;
      __IOM uint32_t CALW16     : 1;            /*!< [13..13] Reserved                                                         */
      __IOM uint32_t CALW8      : 1;            /*!< [14..14] Use a 16-second calibration cycle period                         */
      __IOM uint32_t CALP       : 1;            /*!< [15..15] Use an 8-second calibration cycle period                         */
    } CALR_b;
  } ;
  
  union {
    __IOM uint32_t TAFCR;                       /*!< (@ 0x00000040) tamper and alternate function configuration register       */
    
