nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t TAMP1E     : 1;            /*!< [0..0] RTC_TAMP1 input detection enable                                   */
      __IOM uint32_t TAMP1TRG   : 1;            /*!< [1..1] Active level for RTC_TAMP1 input                                   */
      __IOM uint32_t TAMPIE     : 1;            /*!< [2..2] Tamper interrupt enable                                            */
      __IOM uint32_t TAMP2E     : 1;            /*!< [3..3] RTC_TAMP2 input detection enable                                   */
      __IOM uint32_t TAMP2_TRG  : 1;            /*!< [4..4] Active level for RTC_TAMP2 input                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t TAMPTS     : 1;            /*!< [7..7] Activate timestamp on tamper detection event                       */
      __IOM uint32_t TAMPFREQ   : 3;            /*!< [10..8] Tamper sampling frequency                                         */
      __IOM uint32_t TAMPFLT    : 2;            /*!< [12..11] RTC_TAMPx filter count                                           */
      __IOM uint32_t TAMP_PRCH  : 2;            /*!< [14..13] RTC_TAMPx precharge duration                                     */
      __IOM uint32_t TAMP_PUDIS : 1;            /*!< [15..15] RTC_TAMPx pull-up disable                                        */
      __IM  uint32_t            : 2;
      __IOM uint32_t PC13VALUE  : 1;            /*!< [18..18] RTC_ALARM output type/PC13 value                                 */
      __IOM uint32_t PC13MODE   : 1;            /*!< [19..19] PC13 mode                                                        */
      __IOM uint32_t PC14VALUE  : 1;            /*!< [20..20] PC14 value                                                       */
      __IOM uint32_t PC14MODE   : 1;            /*!< [21..21] PC14 mode                                                        */
      __IOM uint32_t PC15VALUE  : 1;            /*!< [22..22] PC15 value                                                       */
      __IOM uint32_t PC15MODE   : 1;            /*!< [23..23] PC15 mode                                                        */
    } TAFCR_b;
  } ;
  
  union {
    __IOM uint32_t ALRMASSR;                    /*!< (@ 0x00000044) alarm A sub second register                                */
    
    struct {
      __IOM uint32_t SS         : 15;           /*!< [14..0] Sub seconds value                                                 */
      __IM  uint32_t            : 9;
      __IOM uint32_t MASKSS     : 4;            /*!< [27..24] Mask the most-significant bits starting at this bit              */
    } ALRMASSR_b;
  } ;
  __IM  uint32_t  RESERVED2[2];
  
  union {
    __IOM uint32_t BKP0R;                       /*!< (@ 0x00000050) backup register                                            */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< [31..0] BKP                                                               */
    } BKP0R_b;
  } ;
  
  union {
    __IOM uint32_t BKP1R;                       /*!< (@ 0x00000054) backup register                                            */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< [31..0] BKP                                                               */
    } BKP1R_b;
  } ;
  
  union {
    __IOM uint32_t BKP2R;                       /*!< (@ 0x00000058) backup register                                            */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< [31..0] BKP                                                               */
    } BKP2R_b;
  } ;
  
  union {
    __IOM uint32_t BKP3R;                       /*!< (@ 0x0000005C) backup register                                            */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< [31..0] BKP                                                               */
    } BKP3R_b;
  } ;
  
  union {
    __IOM uint32_t BKP4R;                       /*!< (@ 0x00000060) backup register                                            */
    
    struct {
      __IOM uint32_t BKP        : 32;           /*!< [31..0] BKP                                                               */
    } BKP4R_b;
  } ;
} RTC_Type;                                     /*!< Size = 100 (0x64)                                                         */



/* =========================================================================================================================== */
/* ================                                           TIM16                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose-timers (TIM16)
  */

typedef struct {                                /*!< (@ 0x40014400) TIM16 Structure                                            */
  
  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000000) control register 1                                         */
    
    struct {
      __IOM uint32_t CEN        : 1;            /*!< [0..0] Counter enable                                                     */
      __IOM uint32_t UDIS       : 1;            /*!< [1..1] Update disable                                                     */
      __IOM uint32_t URS        : 1;            /*!< [2..2] Update request source                                              */
      __IOM uint32_t OPM        : 1;            /*!< [3..3] One-pulse mode                                                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t ARPE       : 1;            /*!< [7..7] Auto-reload preload enable                                         */
      __IOM uint32_t CKD        : 2;            /*!< [9..8] Clock division                                                     */
    } CR1_b;
  } ;
  
  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x00000004) control register 2                                         */
    
