nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t CNT        : 16;           /*!< [15..0] counter value                                                     */
    } CNT_b;
  } ;
  
  union {
    __IOM uint32_t PSC;                         /*!< (@ 0x00000028) prescaler                                                  */
    
    struct {
      __IOM uint32_t PSC        : 16;           /*!< [15..0] Prescaler value                                                   */
    } PSC_b;
  } ;
  
  union {
    __IOM uint32_t ARR;                         /*!< (@ 0x0000002C) auto-reload register                                       */
    
    struct {
      __IOM uint32_t ARR        : 16;           /*!< [15..0] Auto-reload value                                                 */
    } ARR_b;
  } ;
  
  union {
    __IOM uint32_t RCR;                         /*!< (@ 0x00000030) repetition counter register                                */
    
    struct {
      __IOM uint32_t REP        : 8;            /*!< [7..0] Repetition counter value                                           */
    } RCR_b;
  } ;
  
  union {
    __IOM uint32_t CCR1;                        /*!< (@ 0x00000034) capture/compare register 1                                 */
    
    struct {
      __IOM uint32_t CCR1       : 16;           /*!< [15..0] Capture/Compare 1 value                                           */
    } CCR1_b;
  } ;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __IOM uint32_t BDTR;                        /*!< (@ 0x00000044) break and dead-time register                               */
    
    struct {
      __IOM uint32_t DTG        : 8;            /*!< [7..0] Dead-time generator setup                                          */
      __IOM uint32_t LOCK       : 2;            /*!< [9..8] Lock configuration                                                 */
      __IOM uint32_t OSSI       : 1;            /*!< [10..10] Off-state selection for Idle mode                                */
      __IOM uint32_t OSSR       : 1;            /*!< [11..11] Off-state selection for Run mode                                 */
      __IOM uint32_t BKE        : 1;            /*!< [12..12] Break enable                                                     */
      __IOM uint32_t BKP        : 1;            /*!< [13..13] Break polarity                                                   */
      __IOM uint32_t AOE        : 1;            /*!< [14..14] Automatic output enable                                          */
      __IOM uint32_t MOE        : 1;            /*!< [15..15] Main output enable                                               */
    } BDTR_b;
  } ;
  
  union {
    __IOM uint32_t DCR;                         /*!< (@ 0x00000048) DMA control register                                       */
    
    struct {
      __IOM uint32_t DBA        : 5;            /*!< [4..0] DMA base address                                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t DBL        : 5;            /*!< [12..8] DMA burst length                                                  */
    } DCR_b;
  } ;
  
  union {
    __IOM uint32_t DMAR;                        /*!< (@ 0x0000004C) DMA address for full transfer                              */
    
    struct {
      __IOM uint32_t DMAB       : 16;           /*!< [15..0] DMA register for burst accesses                                   */
    } DMAR_b;
  } ;
} TIM16_Type;                                   /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                            TSC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Touch sensing controller (TSC)
  */

typedef struct {                                /*!< (@ 0x40024000) TSC Structure                                              */
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) control register                                           */
    
    struct {
      __IOM uint32_t TSCE       : 1;            /*!< [0..0] Touch sensing controller enable                                    */
      __IOM uint32_t START      : 1;            /*!< [1..1] Start a new acquisition                                            */
      __IOM uint32_t AM         : 1;            /*!< [2..2] Acquisition mode                                                   */
      __IOM uint32_t SYNCPOL    : 1;            /*!< [3..3] Synchronization pin polarity                                       */
      __IOM uint32_t IODEF      : 1;            /*!< [4..4] I/O Default mode                                                   */
      __IOM uint32_t MCV        : 3;            /*!< [7..5] Max count value                                                    */
      __IM  uint32_t            : 4;
      __IOM uint32_t PGPSC      : 3;            /*!< [14..12] pulse generator prescaler                                        */
      __IOM uint32_t SSPSC      : 1;            /*!< [15..15] Spread spectrum prescaler                                        */
      __IOM uint32_t SSE        : 1;            /*!< [16..16] Spread spectrum enable                                           */
      __IOM uint32_t SSD        : 7;            /*!< [23..17] Spread spectrum deviation                                        */
      __IOM uint32_t CTPL       : 4;            /*!< [27..24] Charge transfer pulse low                                        */
      __IOM uint32_t CTPH       : 4;            /*!< [31..28] Charge transfer pulse high                                       */
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000004) interrupt enable register                                  */
    
