nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t EOAIE      : 1;            /*!< [0..0] End of acquisition interrupt enable                                */
      __IOM uint32_t MCEIE      : 1;            /*!< [1..1] Max count error interrupt enable                                   */
    } IER_b;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000008) interrupt clear register                                   */
    
    struct {
      __IOM uint32_t EOAIC      : 1;            /*!< [0..0] End of acquisition interrupt clear                                 */
      __IOM uint32_t MCEIC      : 1;            /*!< [1..1] Max count error interrupt clear                                    */
    } ICR_b;
  } ;
  
  union {
    __IOM uint32_t ISR;                         /*!< (@ 0x0000000C) interrupt status register                                  */
    
    struct {
      __IOM uint32_t EOAF       : 1;            /*!< [0..0] End of acquisition flag                                            */
      __IOM uint32_t MCEF       : 1;            /*!< [1..1] Max count error flag                                               */
    } ISR_b;
  } ;
  
  union {
    __IOM uint32_t IOHCR;                       /*!< (@ 0x00000010) I/O hysteresis control register                            */
    
    struct {
      __IOM uint32_t G1_IO1     : 1;            /*!< [0..0] G1_IO1 Schmitt trigger hysteresis mode                             */
      __IOM uint32_t G1_IO2     : 1;            /*!< [1..1] G1_IO2 Schmitt trigger hysteresis mode                             */
      __IOM uint32_t G1_IO3     : 1;            /*!< [2..2] G1_IO3 Schmitt trigger hysteresis mode                             */
      __IOM uint32_t G1_IO4     : 1;            /*!< [3..3] G1_IO4 Schmitt trigger hysteresis mode                             */
      __IOM uint32_t G2_IO1     : 1;            /*!< [4..4] G2_IO1 Schmitt trigger hysteresis mode                             */
      __IOM uint32_t G2_IO2     : 1;            /*!< [5..5] G2_IO2 Schmitt trigger hysteresis mode                             */
      __IOM uint32_t G2_IO3     : 1;            /*!< [6..6] G2_IO3 Schmitt trigger hysteresis mode                             */
      __IOM uint32_t G2_IO4     : 1;            /*!< [7..7] G2_IO4 Schmitt trigger hysteresis mode                             */
      __IOM uint32_t G3_IO1     : 1;            /*!< [8..8] G3_IO1 Schmitt trigger hysteresis mode                             */
      __IOM uint32_t G3_IO2     : 1;            /*!< [9..9] G3_IO2 Schmitt trigger hysteresis mode                             */
      __IOM uint32_t G3_IO3     : 1;            /*!< [10..10] G3_IO3 Schmitt trigger hysteresis mode                           */
      __IOM uint32_t G3_IO4     : 1;            /*!< [11..11] G3_IO4 Schmitt trigger hysteresis mode                           */
      __IOM uint32_t G4_IO1     : 1;            /*!< [12..12] G4_IO1 Schmitt trigger hysteresis mode                           */
      __IOM uint32_t G4_IO2     : 1;            /*!< [13..13] G4_IO2 Schmitt trigger hysteresis mode                           */
      __IOM uint32_t G4_IO3     : 1;            /*!< [14..14] G4_IO3 Schmitt trigger hysteresis mode                           */
      __IOM uint32_t G4_IO4     : 1;            /*!< [15..15] G4_IO4 Schmitt trigger hysteresis mode                           */
      __IOM uint32_t G5_IO1     : 1;            /*!< [16..16] G5_IO1 Schmitt trigger hysteresis mode                           */
      __IOM uint32_t G5_IO2     : 1;            /*!< [17..17] G5_IO2 Schmitt trigger hysteresis mode                           */
      __IOM uint32_t G5_IO3     : 1;            /*!< [18..18] G5_IO3 Schmitt trigger hysteresis mode                           */
      __IOM uint32_t G5_IO4     : 1;            /*!< [19..19] G5_IO4 Schmitt trigger hysteresis mode                           */
      __IOM uint32_t G6_IO1     : 1;            /*!< [20..20] G6_IO1 Schmitt trigger hysteresis mode                           */
      __IOM uint32_t G6_IO2     : 1;            /*!< [21..21] G6_IO2 Schmitt trigger hysteresis mode                           */
      __IOM uint32_t G6_IO3     : 1;            /*!< [22..22] G6_IO3 Schmitt trigger hysteresis mode                           */
      __IOM uint32_t G6_IO4     : 1;            /*!< [23..23] G6_IO4 Schmitt trigger hysteresis mode                           */
    } IOHCR_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t IOASCR;                      /*!< (@ 0x00000018) I/O analog switch control register                         */
    
    struct {
      __IOM uint32_t G1_IO1     : 1;            /*!< [0..0] G1_IO1 analog switch enable                                        */
      __IOM uint32_t G1_IO2     : 1;            /*!< [1..1] G1_IO2 analog switch enable                                        */
      __IOM uint32_t G1_IO3     : 1;            /*!< [2..2] G1_IO3 analog switch enable                                        */
      __IOM uint32_t G1_IO4     : 1;            /*!< [3..3] G1_IO4 analog switch enable                                        */
      __IOM uint32_t G2_IO1     : 1;            /*!< [4..4] G2_IO1 analog switch enable                                        */
      __IOM uint32_t G2_IO2     : 1;            /*!< [5..5] G2_IO2 analog switch enable                                        */
      __IOM uint32_t G2_IO3     : 1;            /*!< [6..6] G2_IO3 analog switch enable                                        */
      __IOM uint32_t G2_IO4     : 1;            /*!< [7..7] G2_IO4 analog switch enable                                        */
      __IOM uint32_t G3_IO1     : 1;            /*!< [8..8] G3_IO1 analog switch enable                                        */
      __IOM uint32_t G3_IO2     : 1;            /*!< [9..9] G3_IO2 analog switch enable                                        */
      __IOM uint32_t G3_IO3     : 1;            /*!< [10..10] G3_IO3 analog switch enable                                      */
      __IOM uint32_t G3_IO4     : 1;            /*!< [11..11] G3_IO4 analog switch enable                                      */
      __IOM uint32_t G4_IO1     : 1;            /*!< [12..12] G4_IO1 analog switch enable                                      */
      __IOM uint32_t G4_IO2     : 1;            /*!< [13..13] G4_IO2 analog switch enable                                      */
      __IOM uint32_t G4_IO3     : 1;            /*!< [14..14] G4_IO3 analog switch enable                                      */
      __IOM uint32_t G4_IO4     : 1;            /*!< [15..15] G4_IO4 analog switch enable                                      */
      __IOM uint32_t G5_IO1     : 1;            /*!< [16..16] G5_IO1 analog switch enable                                      */
      __IOM uint32_t G5_IO2     : 1;            /*!< [17..17] G5_IO2 analog switch enable                                      */
      __IOM uint32_t G5_IO3     : 1;            /*!< [18..18] G5_IO3 analog switch enable                                      */
      __IOM uint32_t G5_IO4     : 1;            /*!< [19..19] G5_IO4 analog switch enable                                      */
      __IOM uint32_t G6_IO1     : 1;            /*!< [20..20] G6_IO1 analog switch enable                                      */
      __IOM uint32_t G6_IO2     : 1;            /*!< [21..21] G6_IO2 analog switch enable                                      */
      __IOM uint32_t G6_IO3     : 1;            /*!< [22..22] G6_IO3 analog switch enable                                      */
      __IOM uint32_t G6_IO4     : 1;            /*!< [23..23] G6_IO4 analog switch enable                                      */
    } IOASCR_b;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t IOSCR;                       /*!< (@ 0x00000020) I/O sampling control register                              */
    
