nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t G1_IO1     : 1;            /*!< [0..0] G1_IO1 sampling mode                                               */
      __IOM uint32_t G1_IO2     : 1;            /*!< [1..1] G1_IO2 sampling mode                                               */
      __IOM uint32_t G1_IO3     : 1;            /*!< [2..2] G1_IO3 sampling mode                                               */
      __IOM uint32_t G1_IO4     : 1;            /*!< [3..3] G1_IO4 sampling mode                                               */
      __IOM uint32_t G2_IO1     : 1;            /*!< [4..4] G2_IO1 sampling mode                                               */
      __IOM uint32_t G2_IO2     : 1;            /*!< [5..5] G2_IO2 sampling mode                                               */
      __IOM uint32_t G2_IO3     : 1;            /*!< [6..6] G2_IO3 sampling mode                                               */
      __IOM uint32_t G2_IO4     : 1;            /*!< [7..7] G2_IO4 sampling mode                                               */
      __IOM uint32_t G3_IO1     : 1;            /*!< [8..8] G3_IO1 sampling mode                                               */
      __IOM uint32_t G3_IO2     : 1;            /*!< [9..9] G3_IO2 sampling mode                                               */
      __IOM uint32_t G3_IO3     : 1;            /*!< [10..10] G3_IO3 sampling mode                                             */
      __IOM uint32_t G3_IO4     : 1;            /*!< [11..11] G3_IO4 sampling mode                                             */
      __IOM uint32_t G4_IO1     : 1;            /*!< [12..12] G4_IO1 sampling mode                                             */
      __IOM uint32_t G4_IO2     : 1;            /*!< [13..13] G4_IO2 sampling mode                                             */
      __IOM uint32_t G4_IO3     : 1;            /*!< [14..14] G4_IO3 sampling mode                                             */
      __IOM uint32_t G4_IO4     : 1;            /*!< [15..15] G4_IO4 sampling mode                                             */
      __IOM uint32_t G5_IO1     : 1;            /*!< [16..16] G5_IO1 sampling mode                                             */
      __IOM uint32_t G5_IO2     : 1;            /*!< [17..17] G5_IO2 sampling mode                                             */
      __IOM uint32_t G5_IO3     : 1;            /*!< [18..18] G5_IO3 sampling mode                                             */
      __IOM uint32_t G5_IO4     : 1;            /*!< [19..19] G5_IO4 sampling mode                                             */
      __IOM uint32_t G6_IO1     : 1;            /*!< [20..20] G6_IO1 sampling mode                                             */
      __IOM uint32_t G6_IO2     : 1;            /*!< [21..21] G6_IO2 sampling mode                                             */
      __IOM uint32_t G6_IO3     : 1;            /*!< [22..22] G6_IO3 sampling mode                                             */
      __IOM uint32_t G6_IO4     : 1;            /*!< [23..23] G6_IO4 sampling mode                                             */
    } IOSCR_b;
  } ;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t IOCCR;                       /*!< (@ 0x00000028) I/O channel control register                               */
    
    struct {
      __IOM uint32_t G1_IO1     : 1;            /*!< [0..0] G1_IO1 channel mode                                                */
      __IOM uint32_t G1_IO2     : 1;            /*!< [1..1] G1_IO2 channel mode                                                */
      __IOM uint32_t G1_IO3     : 1;            /*!< [2..2] G1_IO3 channel mode                                                */
      __IOM uint32_t G1_IO4     : 1;            /*!< [3..3] G1_IO4 channel mode                                                */
      __IOM uint32_t G2_IO1     : 1;            /*!< [4..4] G2_IO1 channel mode                                                */
      __IOM uint32_t G2_IO2     : 1;            /*!< [5..5] G2_IO2 channel mode                                                */
      __IOM uint32_t G2_IO3     : 1;            /*!< [6..6] G2_IO3 channel mode                                                */
      __IOM uint32_t G2_IO4     : 1;            /*!< [7..7] G2_IO4 channel mode                                                */
      __IOM uint32_t G3_IO1     : 1;            /*!< [8..8] G3_IO1 channel mode                                                */
      __IOM uint32_t G3_IO2     : 1;            /*!< [9..9] G3_IO2 channel mode                                                */
      __IOM uint32_t G3_IO3     : 1;            /*!< [10..10] G3_IO3 channel mode                                              */
      __IOM uint32_t G3_IO4     : 1;            /*!< [11..11] G3_IO4 channel mode                                              */
      __IOM uint32_t G4_IO1     : 1;            /*!< [12..12] G4_IO1 channel mode                                              */
      __IOM uint32_t G4_IO2     : 1;            /*!< [13..13] G4_IO2 channel mode                                              */
      __IOM uint32_t G4_IO3     : 1;            /*!< [14..14] G4_IO3 channel mode                                              */
      __IOM uint32_t G4_IO4     : 1;            /*!< [15..15] G4_IO4 channel mode                                              */
      __IOM uint32_t G5_IO1     : 1;            /*!< [16..16] G5_IO1 channel mode                                              */
      __IOM uint32_t G5_IO2     : 1;            /*!< [17..17] G5_IO2 channel mode                                              */
      __IOM uint32_t G5_IO3     : 1;            /*!< [18..18] G5_IO3 channel mode                                              */
      __IOM uint32_t G5_IO4     : 1;            /*!< [19..19] G5_IO4 channel mode                                              */
      __IOM uint32_t G6_IO1     : 1;            /*!< [20..20] G6_IO1 channel mode                                              */
      __IOM uint32_t G6_IO2     : 1;            /*!< [21..21] G6_IO2 channel mode                                              */
      __IOM uint32_t G6_IO3     : 1;            /*!< [22..22] G6_IO3 channel mode                                              */
      __IOM uint32_t G6_IO4     : 1;            /*!< [23..23] G6_IO4 channel mode                                              */
    } IOCCR_b;
  } ;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t IOGCSR;                      /*!< (@ 0x00000030) I/O group control status register                          */
    
