nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t G1E        : 1;            /*!< [0..0] Analog I/O group x enable                                          */
      __IOM uint32_t G2E        : 1;            /*!< [1..1] Analog I/O group x enable                                          */
      __IOM uint32_t G3E        : 1;            /*!< [2..2] Analog I/O group x enable                                          */
      __IOM uint32_t G4E        : 1;            /*!< [3..3] Analog I/O group x enable                                          */
      __IOM uint32_t G5E        : 1;            /*!< [4..4] Analog I/O group x enable                                          */
      __IOM uint32_t G6E        : 1;            /*!< [5..5] Analog I/O group x enable                                          */
      __IOM uint32_t G7E        : 1;            /*!< [6..6] Analog I/O group x enable                                          */
      __IOM uint32_t G8E        : 1;            /*!< [7..7] Analog I/O group x enable                                          */
      __IM  uint32_t            : 8;
      __IM  uint32_t G1S        : 1;            /*!< [16..16] Analog I/O group x status                                        */
      __IM  uint32_t G2S        : 1;            /*!< [17..17] Analog I/O group x status                                        */
      __IM  uint32_t G3S        : 1;            /*!< [18..18] Analog I/O group x status                                        */
      __IM  uint32_t G4S        : 1;            /*!< [19..19] Analog I/O group x status                                        */
      __IM  uint32_t G5S        : 1;            /*!< [20..20] Analog I/O group x status                                        */
      __IM  uint32_t G6S        : 1;            /*!< [21..21] Analog I/O group x status                                        */
      __IOM uint32_t G7S        : 1;            /*!< [22..22] Analog I/O group x status                                        */
      __IOM uint32_t G8S        : 1;            /*!< [23..23] Analog I/O group x status                                        */
    } IOGCSR_b;
  } ;
  
  union {
    __IM  uint32_t IOG1CR;                      /*!< (@ 0x00000034) I/O group x counter register                               */
    
    struct {
      __IM  uint32_t CNT        : 14;           /*!< [13..0] Counter value                                                     */
    } IOG1CR_b;
  } ;
  
  union {
    __IM  uint32_t IOG2CR;                      /*!< (@ 0x00000038) I/O group x counter register                               */
    
    struct {
      __IM  uint32_t CNT        : 14;           /*!< [13..0] Counter value                                                     */
    } IOG2CR_b;
  } ;
  
  union {
    __IM  uint32_t IOG3CR;                      /*!< (@ 0x0000003C) I/O group x counter register                               */
    
    struct {
      __IM  uint32_t CNT        : 14;           /*!< [13..0] Counter value                                                     */
    } IOG3CR_b;
  } ;
  
  union {
    __IM  uint32_t IOG4CR;                      /*!< (@ 0x00000040) I/O group x counter register                               */
    
    struct {
      __IM  uint32_t CNT        : 14;           /*!< [13..0] Counter value                                                     */
    } IOG4CR_b;
  } ;
  
  union {
    __IM  uint32_t IOG5CR;                      /*!< (@ 0x00000044) I/O group x counter register                               */
    
    struct {
      __IM  uint32_t CNT        : 14;           /*!< [13..0] Counter value                                                     */
    } IOG5CR_b;
  } ;
  
  union {
    __IM  uint32_t IOG6CR;                      /*!< (@ 0x00000048) I/O group x counter register                               */
    
    struct {
      __IM  uint32_t CNT        : 14;           /*!< [13..0] Counter value                                                     */
    } IOG6CR_b;
  } ;
} TSC_Type;                                     /*!< Size = 76 (0x4c)                                                          */



/* =========================================================================================================================== */
/* ================                                            CEC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief HDMI-CEC controller (CEC)
  */

typedef struct {                                /*!< (@ 0x40007800) CEC Structure                                              */
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) control register                                           */
    
    struct {
      __IOM uint32_t CECEN      : 1;            /*!< [0..0] CEC Enable                                                         */
      __IOM uint32_t TXSOM      : 1;            /*!< [1..1] Tx start of message                                                */
      __IOM uint32_t TXEOM      : 1;            /*!< [2..2] Tx End Of Message                                                  */
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t CFGR;                        /*!< (@ 0x00000004) configuration register                                     */
    
    struct {
      __IOM uint32_t OAR        : 4;            /*!< [3..0] Own Address                                                        */
      __IOM uint32_t LSTN       : 1;            /*!< [4..4] Listen mode                                                        */
      __IOM uint32_t SFT        : 3;            /*!< [7..5] Signal Free Time                                                   */
      __IOM uint32_t RXTOL      : 1;            /*!< [8..8] Rx-Tolerance                                                       */
      __IOM uint32_t BRESTP     : 1;            /*!< [9..9] Rx-stop on bit rising error                                        */
      __IOM uint32_t BREGEN     : 1;            /*!< [10..10] Generate error-bit on bit rising error                           */
      __IOM uint32_t LBPEGEN    : 1;            /*!< [11..11] Generate Error-Bit on Long Bit Period Error                      */
    } CFGR_b;
  } ;
  
  union {
    __OM  uint32_t TXDR;                        /*!< (@ 0x00000008) Tx data register                                           */
    
