nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __OM  uint32_t TXD        : 8;            /*!< [7..0] Tx Data register                                                   */
    } TXDR_b;
  } ;
  
  union {
    __IM  uint32_t RXDR;                        /*!< (@ 0x0000000C) Rx Data Register                                           */
    
    struct {
      __IM  uint32_t RXDR       : 8;            /*!< [7..0] CEC Rx Data Register                                               */
    } RXDR_b;
  } ;
  
  union {
    __IOM uint32_t ISR;                         /*!< (@ 0x00000010) Interrupt and Status Register                              */
    
    struct {
      __IOM uint32_t RXBR       : 1;            /*!< [0..0] Rx-Byte Received                                                   */
      __IOM uint32_t RXEND      : 1;            /*!< [1..1] End Of Reception                                                   */
      __IOM uint32_t RXOVR      : 1;            /*!< [2..2] Rx-Overrun                                                         */
      __IOM uint32_t BRE        : 1;            /*!< [3..3] Rx-Bit rising error                                                */
      __IOM uint32_t SBPE       : 1;            /*!< [4..4] Rx-Short Bit period error                                          */
      __IOM uint32_t LBPE       : 1;            /*!< [5..5] Rx-Long Bit Period Error                                           */
      __IOM uint32_t RXACKE     : 1;            /*!< [6..6] Rx-Missing Acknowledge                                             */
      __IOM uint32_t ARBLST     : 1;            /*!< [7..7] Arbitration Lost                                                   */
      __IOM uint32_t TXBR       : 1;            /*!< [8..8] Tx-Byte Request                                                    */
      __IOM uint32_t TXEND      : 1;            /*!< [9..9] End of Transmission                                                */
      __IOM uint32_t TXUDR      : 1;            /*!< [10..10] Tx-Buffer Underrun                                               */
      __IOM uint32_t TXERR      : 1;            /*!< [11..11] Tx-Error                                                         */
      __IOM uint32_t TXACKE     : 1;            /*!< [12..12] Tx-Missing acknowledge error                                     */
    } ISR_b;
  } ;
  
  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000014) interrupt enable register                                  */
    
    struct {
      __IOM uint32_t RXBRIE     : 1;            /*!< [0..0] Rx-Byte Received Interrupt Enable                                  */
      __IOM uint32_t RXENDIE    : 1;            /*!< [1..1] End Of Reception Interrupt Enable                                  */
      __IOM uint32_t RXOVRIE    : 1;            /*!< [2..2] Rx-Buffer Overrun Interrupt Enable                                 */
      __IOM uint32_t BREIE      : 1;            /*!< [3..3] Bit Rising Error Interrupt Enable                                  */
      __IOM uint32_t SBPEIE     : 1;            /*!< [4..4] Short Bit Period Error Interrupt Enable                            */
      __IOM uint32_t LBPEIE     : 1;            /*!< [5..5] Long Bit Period Error Interrupt Enable                             */
      __IOM uint32_t RXACKIE    : 1;            /*!< [6..6] Rx-Missing Acknowledge Error Interrupt Enable                      */
      __IOM uint32_t ARBLSTIE   : 1;            /*!< [7..7] Arbitration Lost Interrupt Enable                                  */
      __IOM uint32_t TXBRIE     : 1;            /*!< [8..8] Tx-Byte Request Interrupt Enable                                   */
      __IOM uint32_t TXENDIE    : 1;            /*!< [9..9] Tx-End of message interrupt enable                                 */
      __IOM uint32_t TXUDRIE    : 1;            /*!< [10..10] Tx-Underrun interrupt enable                                     */
      __IOM uint32_t TXERRIE    : 1;            /*!< [11..11] Tx-Error Interrupt Enable                                        */
      __IOM uint32_t TXACKIE    : 1;            /*!< [12..12] Tx-Missing Acknowledge Error Interrupt Enable                    */
    } IER_b;
  } ;
} CEC_Type;                                     /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                           Flash                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Flash (Flash)
  */

typedef struct {                                /*!< (@ 0x40022000) Flash Structure                                            */
  
  union {
    __IOM uint32_t ACR;                         /*!< (@ 0x00000000) Flash access control register                              */
    
    struct {
      __IOM uint32_t LATENCY    : 3;            /*!< [2..0] LATENCY                                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t PRFTBE     : 1;            /*!< [4..4] PRFTBE                                                             */
      __IM  uint32_t PRFTBS     : 1;            /*!< [5..5] PRFTBS                                                             */
    } ACR_b;
  } ;
  
  union {
    __OM  uint32_t KEYR;                        /*!< (@ 0x00000004) Flash key register                                         */
    
    struct {
      __OM  uint32_t FKEYR      : 32;           /*!< [31..0] Flash Key                                                         */
    } KEYR_b;
  } ;
  
  union {
    __OM  uint32_t OPTKEYR;                     /*!< (@ 0x00000008) Flash option key register                                  */
    
    struct {
      __OM  uint32_t OPTKEYR    : 32;           /*!< [31..0] Option byte key                                                   */
    } OPTKEYR_b;
  } ;
  
  union {
    __IOM uint32_t SR;                          /*!< (@ 0x0000000C) Flash status register                                      */
    
