nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IM  uint32_t BSY        : 1;            /*!< [0..0] Busy                                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t PGERR      : 1;            /*!< [2..2] Programming error                                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t WRPRT      : 1;            /*!< [4..4] Write protection error                                             */
      __IOM uint32_t EOP        : 1;            /*!< [5..5] End of operation                                                   */
    } SR_b;
  } ;
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000010) Flash control register                                     */
    
    struct {
      __IOM uint32_t PG         : 1;            /*!< [0..0] Programming                                                        */
      __IOM uint32_t PER        : 1;            /*!< [1..1] Page erase                                                         */
      __IOM uint32_t MER        : 1;            /*!< [2..2] Mass erase                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t OPTPG      : 1;            /*!< [4..4] Option byte programming                                            */
      __IOM uint32_t OPTER      : 1;            /*!< [5..5] Option byte erase                                                  */
      __IOM uint32_t STRT       : 1;            /*!< [6..6] Start                                                              */
      __IOM uint32_t LOCK       : 1;            /*!< [7..7] Lock                                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t OPTWRE     : 1;            /*!< [9..9] Option bytes write enable                                          */
      __IOM uint32_t ERRIE      : 1;            /*!< [10..10] Error interrupt enable                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t EOPIE      : 1;            /*!< [12..12] End of operation interrupt enable                                */
      __IOM uint32_t FORCE_OPTLOAD : 1;         /*!< [13..13] Force option byte loading                                        */
    } CR_b;
  } ;
  
  union {
    __OM  uint32_t AR;                          /*!< (@ 0x00000014) Flash address register                                     */
    
    struct {
      __OM  uint32_t FAR        : 32;           /*!< [31..0] Flash address                                                     */
    } AR_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IM  uint32_t OBR;                         /*!< (@ 0x0000001C) Option byte register                                       */
    
    struct {
      __IM  uint32_t OPTERR     : 1;            /*!< [0..0] Option byte error                                                  */
      __IM  uint32_t LEVEL1_PROT : 1;           /*!< [1..1] Level 1 protection status                                          */
      __IM  uint32_t LEVEL2_PROT : 1;           /*!< [2..2] Level 2 protection status                                          */
      __IM  uint32_t            : 5;
      __IM  uint32_t WDG_SW     : 1;            /*!< [8..8] WDG_SW                                                             */
      __IM  uint32_t nRST_STOP  : 1;            /*!< [9..9] nRST_STOP                                                          */
      __IM  uint32_t nRST_STDBY : 1;            /*!< [10..10] nRST_STDBY                                                       */
      __IM  uint32_t            : 1;
      __IM  uint32_t BOOT1      : 1;            /*!< [12..12] BOOT1                                                            */
      __IM  uint32_t VDDA_MONITOR : 1;          /*!< [13..13] VDDA_MONITOR                                                     */
      __IM  uint32_t            : 2;
      __IM  uint32_t Data0      : 8;            /*!< [23..16] Data0                                                            */
      __IM  uint32_t Data1      : 8;            /*!< [31..24] Data1                                                            */
    } OBR_b;
  } ;
  
  union {
    __IM  uint32_t WRPR;                        /*!< (@ 0x00000020) Write protection register                                  */
    
    struct {
      __IM  uint32_t WRP        : 32;           /*!< [31..0] Write protect                                                     */
    } WRPR_b;
  } ;
} Flash_Type;                                   /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                          DBGMCU                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Debug support (DBGMCU)
  */

typedef struct {                                /*!< (@ 0x40015800) DBGMCU Structure                                           */
  
  union {
    __IM  uint32_t IDCODE;                      /*!< (@ 0x00000000) MCU Device ID Code Register                                */
    
    struct {
      __IM  uint32_t DEV_ID     : 12;           /*!< [11..0] Device Identifier                                                 */
      __IM  uint32_t DIV_ID     : 4;            /*!< [15..12] Division Identifier                                              */
      __IM  uint32_t REV_ID     : 16;           /*!< [31..16] Revision Identifier                                              */
    } IDCODE_b;
  } ;
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000004) Debug MCU Configuration Register                           */
    
