nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t DBG_STOP   : 1;            /*!< [1..1] Debug Stop Mode                                                    */
      __IOM uint32_t DBG_STANDBY : 1;           /*!< [2..2] Debug Standby Mode                                                 */
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t APBLFZ;                      /*!< (@ 0x00000008) APB Low Freeze Register                                    */
    
    struct {
      __IOM uint32_t DBG_TIMER2_STOP : 1;       /*!< [0..0] Debug Timer 2 stopped when Core is halted                          */
      __IOM uint32_t DBG_TIMER3_STOP : 1;       /*!< [1..1] Debug Timer 3 stopped when Core is halted                          */
      __IM  uint32_t            : 2;
      __IOM uint32_t DBG_TIMER6_STOP : 1;       /*!< [4..4] Debug Timer 6 stopped when Core is halted                          */
      __IM  uint32_t            : 3;
      __IOM uint32_t DBG_TIMER14_STOP : 1;      /*!< [8..8] Debug Timer 14 stopped when Core is halted                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t DBG_RTC_STOP : 1;          /*!< [10..10] Debug RTC stopped when Core is halted                            */
      __IOM uint32_t DBG_WWDG_STOP : 1;         /*!< [11..11] Debug Window Wachdog stopped when Core is halted                 */
      __IOM uint32_t DBG_IWDG_STOP : 1;         /*!< [12..12] Debug Independent Wachdog stopped when Core is halted            */
      __IM  uint32_t            : 8;
      __IOM uint32_t I2C1_SMBUS_TIMEOUT : 1;    /*!< [21..21] SMBUS timeout mode stopped when Core is halted                   */
    } APBLFZ_b;
  } ;
  
  union {
    __IOM uint32_t APBHFZ;                      /*!< (@ 0x0000000C) APB High Freeze Register                                   */
    
    struct {
      __IM  uint32_t            : 11;
      __IOM uint32_t DBG_TIMER1_STOP : 1;       /*!< [11..11] Debug Timer 1 stopped when Core is halted                        */
      __IM  uint32_t            : 4;
      __IOM uint32_t DBG_TIMER15_STO : 1;       /*!< [16..16] Debug Timer 15 stopped when Core is halted                       */
      __IOM uint32_t DBG_TIMER16_STO : 1;       /*!< [17..17] Debug Timer 16 stopped when Core is halted                       */
      __IOM uint32_t DBG_TIMER17_STO : 1;       /*!< [18..18] Debug Timer 17 stopped when Core is halted                       */
    } APBHFZ_b;
  } ;
} DBGMCU_Type;                                  /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                            USB                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal serial bus full-speed device       interface (USB)
  */

typedef struct {                                /*!< (@ 0x40005C00) USB Structure                                              */
  
  union {
    __IOM uint32_t EP0R;                        /*!< (@ 0x00000000) endpoint 0 register                                        */
    
    struct {
      __IOM uint32_t EA         : 4;            /*!< [3..0] Endpoint address                                                   */
      __IOM uint32_t STAT_TX    : 2;            /*!< [5..4] Status bits, for transmission transfers                            */
      __IOM uint32_t DTOG_TX    : 1;            /*!< [6..6] Data Toggle, for transmission transfers                            */
      __IOM uint32_t CTR_TX     : 1;            /*!< [7..7] Correct Transfer for transmission                                  */
      __IOM uint32_t EP_KIND    : 1;            /*!< [8..8] Endpoint kind                                                      */
      __IOM uint32_t EP_TYPE    : 2;            /*!< [10..9] Endpoint type                                                     */
      __IOM uint32_t SETUP      : 1;            /*!< [11..11] Setup transaction completed                                      */
      __IOM uint32_t STAT_RX    : 2;            /*!< [13..12] Status bits, for reception transfers                             */
      __IOM uint32_t DTOG_RX    : 1;            /*!< [14..14] Data Toggle, for reception transfers                             */
      __IOM uint32_t CTR_RX     : 1;            /*!< [15..15] Correct transfer for reception                                   */
    } EP0R_b;
  } ;
  
  union {
    __IOM uint32_t EP1R;                        /*!< (@ 0x00000004) endpoint 1 register                                        */
    
    struct {
      __IOM uint32_t EA         : 4;            /*!< [3..0] Endpoint address                                                   */
      __IOM uint32_t STAT_TX    : 2;            /*!< [5..4] Status bits, for transmission transfers                            */
      __IOM uint32_t DTOG_TX    : 1;            /*!< [6..6] Data Toggle, for transmission transfers                            */
      __IOM uint32_t CTR_TX     : 1;            /*!< [7..7] Correct Transfer for transmission                                  */
      __IOM uint32_t EP_KIND    : 1;            /*!< [8..8] Endpoint kind                                                      */
      __IOM uint32_t EP_TYPE    : 2;            /*!< [10..9] Endpoint type                                                     */
      __IOM uint32_t SETUP      : 1;            /*!< [11..11] Setup transaction completed                                      */
      __IOM uint32_t STAT_RX    : 2;            /*!< [13..12] Status bits, for reception transfers                             */
      __IOM uint32_t DTOG_RX    : 1;            /*!< [14..14] Data Toggle, for reception transfers                             */
      __IOM uint32_t CTR_RX     : 1;            /*!< [15..15] Correct transfer for reception                                   */
    } EP1R_b;
  } ;
  
  union {
    __IOM uint32_t EP2R;                        /*!< (@ 0x00000008) endpoint 2 register                                        */
    
