nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t EA         : 4;            /*!< [3..0] Endpoint address                                                   */
      __IOM uint32_t STAT_TX    : 2;            /*!< [5..4] Status bits, for transmission transfers                            */
      __IOM uint32_t DTOG_TX    : 1;            /*!< [6..6] Data Toggle, for transmission transfers                            */
      __IOM uint32_t CTR_TX     : 1;            /*!< [7..7] Correct Transfer for transmission                                  */
      __IOM uint32_t EP_KIND    : 1;            /*!< [8..8] Endpoint kind                                                      */
      __IOM uint32_t EP_TYPE    : 2;            /*!< [10..9] Endpoint type                                                     */
      __IOM uint32_t SETUP      : 1;            /*!< [11..11] Setup transaction completed                                      */
      __IOM uint32_t STAT_RX    : 2;            /*!< [13..12] Status bits, for reception transfers                             */
      __IOM uint32_t DTOG_RX    : 1;            /*!< [14..14] Data Toggle, for reception transfers                             */
      __IOM uint32_t CTR_RX     : 1;            /*!< [15..15] Correct transfer for reception                                   */
    } EP2R_b;
  } ;
  
  union {
    __IOM uint32_t EP3R;                        /*!< (@ 0x0000000C) endpoint 3 register                                        */
    
    struct {
      __IOM uint32_t EA         : 4;            /*!< [3..0] Endpoint address                                                   */
      __IOM uint32_t STAT_TX    : 2;            /*!< [5..4] Status bits, for transmission transfers                            */
      __IOM uint32_t DTOG_TX    : 1;            /*!< [6..6] Data Toggle, for transmission transfers                            */
      __IOM uint32_t CTR_TX     : 1;            /*!< [7..7] Correct Transfer for transmission                                  */
      __IOM uint32_t EP_KIND    : 1;            /*!< [8..8] Endpoint kind                                                      */
      __IOM uint32_t EP_TYPE    : 2;            /*!< [10..9] Endpoint type                                                     */
      __IOM uint32_t SETUP      : 1;            /*!< [11..11] Setup transaction completed                                      */
      __IOM uint32_t STAT_RX    : 2;            /*!< [13..12] Status bits, for reception transfers                             */
      __IOM uint32_t DTOG_RX    : 1;            /*!< [14..14] Data Toggle, for reception transfers                             */
      __IOM uint32_t CTR_RX     : 1;            /*!< [15..15] Correct transfer for reception                                   */
    } EP3R_b;
  } ;
  
  union {
    __IOM uint32_t EP4R;                        /*!< (@ 0x00000010) endpoint 4 register                                        */
    
    struct {
      __IOM uint32_t EA         : 4;            /*!< [3..0] Endpoint address                                                   */
      __IOM uint32_t STAT_TX    : 2;            /*!< [5..4] Status bits, for transmission transfers                            */
      __IOM uint32_t DTOG_TX    : 1;            /*!< [6..6] Data Toggle, for transmission transfers                            */
      __IOM uint32_t CTR_TX     : 1;            /*!< [7..7] Correct Transfer for transmission                                  */
      __IOM uint32_t EP_KIND    : 1;            /*!< [8..8] Endpoint kind                                                      */
      __IOM uint32_t EP_TYPE    : 2;            /*!< [10..9] Endpoint type                                                     */
      __IOM uint32_t SETUP      : 1;            /*!< [11..11] Setup transaction completed                                      */
      __IOM uint32_t STAT_RX    : 2;            /*!< [13..12] Status bits, for reception transfers                             */
      __IOM uint32_t DTOG_RX    : 1;            /*!< [14..14] Data Toggle, for reception transfers                             */
      __IOM uint32_t CTR_RX     : 1;            /*!< [15..15] Correct transfer for reception                                   */
    } EP4R_b;
  } ;
  
  union {
    __IOM uint32_t EP5R;                        /*!< (@ 0x00000014) endpoint 5 register                                        */
    
    struct {
      __IOM uint32_t EA         : 4;            /*!< [3..0] Endpoint address                                                   */
      __IOM uint32_t STAT_TX    : 2;            /*!< [5..4] Status bits, for transmission transfers                            */
      __IOM uint32_t DTOG_TX    : 1;            /*!< [6..6] Data Toggle, for transmission transfers                            */
      __IOM uint32_t CTR_TX     : 1;            /*!< [7..7] Correct Transfer for transmission                                  */
      __IOM uint32_t EP_KIND    : 1;            /*!< [8..8] Endpoint kind                                                      */
      __IOM uint32_t EP_TYPE    : 2;            /*!< [10..9] Endpoint type                                                     */
      __IOM uint32_t SETUP      : 1;            /*!< [11..11] Setup transaction completed                                      */
      __IOM uint32_t STAT_RX    : 2;            /*!< [13..12] Status bits, for reception transfers                             */
      __IOM uint32_t DTOG_RX    : 1;            /*!< [14..14] Data Toggle, for reception transfers                             */
      __IOM uint32_t CTR_RX     : 1;            /*!< [15..15] Correct transfer for reception                                   */
    } EP5R_b;
  } ;
  
  union {
    __IOM uint32_t EP6R;                        /*!< (@ 0x00000018) endpoint 6 register                                        */
    
    struct {
      __IOM uint32_t EA         : 4;            /*!< [3..0] Endpoint address                                                   */
      __IOM uint32_t STAT_TX    : 2;            /*!< [5..4] Status bits, for transmission transfers                            */
      __IOM uint32_t DTOG_TX    : 1;            /*!< [6..6] Data Toggle, for transmission transfers                            */
      __IOM uint32_t CTR_TX     : 1;            /*!< [7..7] Correct Transfer for transmission                                  */
      __IOM uint32_t EP_KIND    : 1;            /*!< [8..8] Endpoint kind                                                      */
      __IOM uint32_t EP_TYPE    : 2;            /*!< [10..9] Endpoint type                                                     */
      __IOM uint32_t SETUP      : 1;            /*!< [11..11] Setup transaction completed                                      */
      __IOM uint32_t STAT_RX    : 2;            /*!< [13..12] Status bits, for reception transfers                             */
      __IOM uint32_t DTOG_RX    : 1;            /*!< [14..14] Data Toggle, for reception transfers                             */
      __IOM uint32_t CTR_RX     : 1;            /*!< [15..15] Correct transfer for reception                                   */
    } EP6R_b;
  } ;
  
  union {
    __IOM uint32_t EP7R;                        /*!< (@ 0x0000001C) endpoint 7 register                                        */
    
