nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t EA         : 4;            /*!< [3..0] Endpoint address                                                   */
      __IOM uint32_t STAT_TX    : 2;            /*!< [5..4] Status bits, for transmission transfers                            */
      __IOM uint32_t DTOG_TX    : 1;            /*!< [6..6] Data Toggle, for transmission transfers                            */
      __IOM uint32_t CTR_TX     : 1;            /*!< [7..7] Correct Transfer for transmission                                  */
      __IOM uint32_t EP_KIND    : 1;            /*!< [8..8] Endpoint kind                                                      */
      __IOM uint32_t EP_TYPE    : 2;            /*!< [10..9] Endpoint type                                                     */
      __IOM uint32_t SETUP      : 1;            /*!< [11..11] Setup transaction completed                                      */
      __IOM uint32_t STAT_RX    : 2;            /*!< [13..12] Status bits, for reception transfers                             */
      __IOM uint32_t DTOG_RX    : 1;            /*!< [14..14] Data Toggle, for reception transfers                             */
      __IOM uint32_t CTR_RX     : 1;            /*!< [15..15] Correct transfer for reception                                   */
    } EP7R_b;
  } ;
  __IM  uint32_t  RESERVED[8];
  
  union {
    __IOM uint32_t CNTR;                        /*!< (@ 0x00000040) control register                                           */
    
    struct {
      __IOM uint32_t FRES       : 1;            /*!< [0..0] Force USB Reset                                                    */
      __IOM uint32_t PDWN       : 1;            /*!< [1..1] Power down                                                         */
      __IOM uint32_t LPMODE     : 1;            /*!< [2..2] Low-power mode                                                     */
      __IOM uint32_t FSUSP      : 1;            /*!< [3..3] Force suspend                                                      */
      __IOM uint32_t RESUME     : 1;            /*!< [4..4] Resume request                                                     */
      __IOM uint32_t L1RESUME   : 1;            /*!< [5..5] LPM L1 Resume request                                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t L1REQM     : 1;            /*!< [7..7] LPM L1 state request interrupt mask                                */
      __IOM uint32_t ESOFM      : 1;            /*!< [8..8] Expected start of frame interrupt mask                             */
      __IOM uint32_t SOFM       : 1;            /*!< [9..9] Start of frame interrupt mask                                      */
      __IOM uint32_t RESETM     : 1;            /*!< [10..10] USB reset interrupt mask                                         */
      __IOM uint32_t SUSPM      : 1;            /*!< [11..11] Suspend mode interrupt mask                                      */
      __IOM uint32_t WKUPM      : 1;            /*!< [12..12] Wakeup interrupt mask                                            */
      __IOM uint32_t ERRM       : 1;            /*!< [13..13] Error interrupt mask                                             */
      __IOM uint32_t PMAOVRM    : 1;            /*!< [14..14] Packet memory area over / underrun interrupt mask                */
      __IOM uint32_t CTRM       : 1;            /*!< [15..15] Correct transfer interrupt mask                                  */
    } CNTR_b;
  } ;
  
  union {
    __IOM uint32_t ISTR;                        /*!< (@ 0x00000044) interrupt status register                                  */
    
    struct {
      __IM  uint32_t EP_ID      : 4;            /*!< [3..0] Endpoint Identifier                                                */
      __IM  uint32_t DIR        : 1;            /*!< [4..4] Direction of transaction                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t L1REQ      : 1;            /*!< [7..7] LPM L1 state request                                               */
      __IOM uint32_t ESOF       : 1;            /*!< [8..8] Expected start frame                                               */
      __IOM uint32_t SOF        : 1;            /*!< [9..9] start of frame                                                     */
      __IOM uint32_t RESET      : 1;            /*!< [10..10] reset request                                                    */
      __IOM uint32_t SUSP       : 1;            /*!< [11..11] Suspend mode request                                             */
      __IOM uint32_t WKUP       : 1;            /*!< [12..12] Wakeup                                                           */
      __IOM uint32_t ERR        : 1;            /*!< [13..13] Error                                                            */
      __IOM uint32_t PMAOVR     : 1;            /*!< [14..14] Packet memory area over / underrun                               */
      __IM  uint32_t CTR        : 1;            /*!< [15..15] Correct transfer                                                 */
    } ISTR_b;
  } ;
  
  union {
    __IM  uint32_t FNR;                         /*!< (@ 0x00000048) frame number register                                      */
    
    struct {
      __IM  uint32_t FN         : 11;           /*!< [10..0] Frame number                                                      */
      __IM  uint32_t LSOF       : 2;            /*!< [12..11] Lost SOF                                                         */
      __IM  uint32_t LCK        : 1;            /*!< [13..13] Locked                                                           */
      __IM  uint32_t RXDM       : 1;            /*!< [14..14] Receive data - line status                                       */
      __IM  uint32_t RXDP       : 1;            /*!< [15..15] Receive data + line status                                       */
    } FNR_b;
  } ;
  
  union {
    __IOM uint32_t DADDR;                       /*!< (@ 0x0000004C) device address                                             */
    
