nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t ADD        : 7;            /*!< [6..0] Device address                                                     */
      __IOM uint32_t EF         : 1;            /*!< [7..7] Enable function                                                    */
    } DADDR_b;
  } ;
  
  union {
    __IOM uint32_t BTABLE;                      /*!< (@ 0x00000050) Buffer table address                                       */
    
    struct {
      __IM  uint32_t            : 3;
      __IOM uint32_t BTABLE     : 13;           /*!< [15..3] Buffer table                                                      */
    } BTABLE_b;
  } ;
  
  union {
    __IOM uint32_t LPMCSR;                      /*!< (@ 0x00000054) LPM control and status register                            */
    
    struct {
      __IOM uint32_t LPMEN      : 1;            /*!< [0..0] LPM support enable                                                 */
      __IOM uint32_t LPMACK     : 1;            /*!< [1..1] LPM Token acknowledge enable                                       */
      __IM  uint32_t            : 1;
      __IM  uint32_t REMWAKE    : 1;            /*!< [3..3] bRemoteWake value                                                  */
      __IM  uint32_t BESL       : 4;            /*!< [7..4] BESL value                                                         */
    } LPMCSR_b;
  } ;
  
  union {
    __IOM uint32_t BCDR;                        /*!< (@ 0x00000058) Battery charging detector                                  */
    
    struct {
      __IOM uint32_t BCDEN      : 1;            /*!< [0..0] Battery charging detector (BCD) enable                             */
      __IOM uint32_t DCDEN      : 1;            /*!< [1..1] Data contact detection (DCD) mode enable                           */
      __IOM uint32_t PDEN       : 1;            /*!< [2..2] Primary detection (PD) mode enable                                 */
      __IOM uint32_t SDEN       : 1;            /*!< [3..3] Secondary detection (SD) mode enable                               */
      __IM  uint32_t DCDET      : 1;            /*!< [4..4] Data contact detection (DCD) status                                */
      __IM  uint32_t PDET       : 1;            /*!< [5..5] Primary detection (PD) status                                      */
      __IM  uint32_t SDET       : 1;            /*!< [6..6] Secondary detection (SD) status                                    */
      __IM  uint32_t PS2DET     : 1;            /*!< [7..7] DM pull-up detection status                                        */
      __IM  uint32_t            : 7;
      __IOM uint32_t DPPU       : 1;            /*!< [15..15] DP pull-up control                                               */
    } BCDR_b;
  } ;
} USB_Type;                                     /*!< Size = 92 (0x5c)                                                          */



/* =========================================================================================================================== */
/* ================                                            CRS                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Clock recovery system (CRS)
  */

typedef struct {                                /*!< (@ 0x40006C00) CRS Structure                                              */
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) control register                                           */
    
    struct {
      __IOM uint32_t SYNCOKIE   : 1;            /*!< [0..0] SYNC event OK interrupt enable                                     */
      __IOM uint32_t SYNCWARNIE : 1;            /*!< [1..1] SYNC warning interrupt enable                                      */
      __IOM uint32_t ERRIE      : 1;            /*!< [2..2] Synchronization or trimming error interrupt enable                 */
      __IOM uint32_t ESYNCIE    : 1;            /*!< [3..3] Expected SYNC interrupt enable                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t CEN        : 1;            /*!< [5..5] Frequency error counter enable                                     */
      __IOM uint32_t AUTOTRIMEN : 1;            /*!< [6..6] Automatic trimming enable                                          */
      __IOM uint32_t SWSYNC     : 1;            /*!< [7..7] Generate software SYNC event                                       */
      __IOM uint32_t TRIM       : 6;            /*!< [13..8] HSI48 oscillator smooth trimming                                  */
    } CR_b;
  } ;
  
  union {
    __IOM uint32_t CFGR;                        /*!< (@ 0x00000004) configuration register                                     */
    
    struct {
      __IOM uint32_t RELOAD     : 16;           /*!< [15..0] Counter reload value                                              */
      __IOM uint32_t FELIM      : 8;            /*!< [23..16] Frequency error limit                                            */
      __IOM uint32_t SYNCDIV    : 3;            /*!< [26..24] SYNC divider                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t SYNCSRC    : 2;            /*!< [29..28] SYNC signal source selection                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t SYNCPOL    : 1;            /*!< [31..31] SYNC polarity selection                                          */
    } CFGR_b;
  } ;
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x00000008) interrupt and status register                              */
    
    struct {
      __IM  uint32_t SYNCOKF    : 1;            /*!< [0..0] SYNC event OK flag                                                 */
      __IM  uint32_t SYNCWARNF  : 1;            /*!< [1..1] SYNC warning flag                                                  */
      __IM  uint32_t ERRF       : 1;            /*!< [2..2] Error flag                                                         */
      __IM  uint32_t ESYNCF     : 1;            /*!< [3..3] Expected SYNC flag                                                 */
      __IM  uint32_t            : 4;
      __IM  uint32_t SYNCERR    : 1;            /*!< [8..8] SYNC error                                                         */
      __IM  uint32_t SYNCMISS   : 1;            /*!< [9..9] SYNC missed                                                        */
      __IM  uint32_t TRIMOVF    : 1;            /*!< [10..10] Trimming overflow or underflow                                   */
      __IM  uint32_t            : 4;
      __IM  uint32_t FEDIR      : 1;            /*!< [15..15] Frequency error direction                                        */
      __IM  uint32_t FECAP      : 16;           /*!< [31..16] Frequency error capture                                          */
    } ISR_b;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x0000000C) interrupt flag clear register                              */
    
