nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t SYNCOKC    : 1;            /*!< [0..0] SYNC event OK clear flag                                           */
      __IOM uint32_t SYNCWARNC  : 1;            /*!< [1..1] SYNC warning clear flag                                            */
      __IOM uint32_t ERRC       : 1;            /*!< [2..2] Error clear flag                                                   */
      __IOM uint32_t ESYNCC     : 1;            /*!< [3..3] Expected SYNC clear flag                                           */
    } ICR_b;
  } ;
} CRS_Type;                                     /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                            CAN                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Controller area network (CAN)
  */

typedef struct {                                /*!< (@ 0x40006400) CAN Structure                                              */
  
  union {
    __IOM uint32_t CAN_MCR;                     /*!< (@ 0x00000000) CAN_MCR                                                    */
    
    struct {
      __IOM uint32_t INRQ       : 1;            /*!< [0..0] INRQ                                                               */
      __IOM uint32_t SLEEP      : 1;            /*!< [1..1] SLEEP                                                              */
      __IOM uint32_t TXFP       : 1;            /*!< [2..2] TXFP                                                               */
      __IOM uint32_t RFLM       : 1;            /*!< [3..3] RFLM                                                               */
      __IOM uint32_t NART       : 1;            /*!< [4..4] NART                                                               */
      __IOM uint32_t AWUM       : 1;            /*!< [5..5] AWUM                                                               */
      __IOM uint32_t ABOM       : 1;            /*!< [6..6] ABOM                                                               */
      __IOM uint32_t TTCM       : 1;            /*!< [7..7] TTCM                                                               */
      __IM  uint32_t            : 7;
      __IOM uint32_t RESET      : 1;            /*!< [15..15] RESET                                                            */
      __IOM uint32_t DBF        : 1;            /*!< [16..16] DBF                                                              */
    } CAN_MCR_b;
  } ;
  
  union {
    __IOM uint32_t CAN_MSR;                     /*!< (@ 0x00000004) CAN_MSR                                                    */
    
    struct {
      __IM  uint32_t INAK       : 1;            /*!< [0..0] INAK                                                               */
      __IM  uint32_t SLAK       : 1;            /*!< [1..1] SLAK                                                               */
      __IOM uint32_t ERRI       : 1;            /*!< [2..2] ERRI                                                               */
      __IOM uint32_t WKUI       : 1;            /*!< [3..3] WKUI                                                               */
      __IOM uint32_t SLAKI      : 1;            /*!< [4..4] SLAKI                                                              */
      __IM  uint32_t            : 3;
      __IM  uint32_t TXM        : 1;            /*!< [8..8] TXM                                                                */
      __IM  uint32_t RXM        : 1;            /*!< [9..9] RXM                                                                */
      __IM  uint32_t SAMP       : 1;            /*!< [10..10] SAMP                                                             */
      __IM  uint32_t RX         : 1;            /*!< [11..11] RX                                                               */
    } CAN_MSR_b;
  } ;
  
  union {
    __IOM uint32_t CAN_TSR;                     /*!< (@ 0x00000008) CAN_TSR                                                    */
    
    struct {
      __IOM uint32_t RQCP0      : 1;            /*!< [0..0] RQCP0                                                              */
      __IOM uint32_t TXOK0      : 1;            /*!< [1..1] TXOK0                                                              */
      __IOM uint32_t ALST0      : 1;            /*!< [2..2] ALST0                                                              */
      __IOM uint32_t TERR0      : 1;            /*!< [3..3] TERR0                                                              */
      __IM  uint32_t            : 3;
      __IOM uint32_t ABRQ0      : 1;            /*!< [7..7] ABRQ0                                                              */
      __IOM uint32_t RQCP1      : 1;            /*!< [8..8] RQCP1                                                              */
      __IOM uint32_t TXOK1      : 1;            /*!< [9..9] TXOK1                                                              */
      __IOM uint32_t ALST1      : 1;            /*!< [10..10] ALST1                                                            */
      __IOM uint32_t TERR1      : 1;            /*!< [11..11] TERR1                                                            */
      __IM  uint32_t            : 3;
      __IOM uint32_t ABRQ1      : 1;            /*!< [15..15] ABRQ1                                                            */
      __IOM uint32_t RQCP2      : 1;            /*!< [16..16] RQCP2                                                            */
      __IOM uint32_t TXOK2      : 1;            /*!< [17..17] TXOK2                                                            */
      __IOM uint32_t ALST2      : 1;            /*!< [18..18] ALST2                                                            */
      __IOM uint32_t TERR2      : 1;            /*!< [19..19] TERR2                                                            */
      __IM  uint32_t            : 3;
      __IOM uint32_t ABRQ2      : 1;            /*!< [23..23] ABRQ2                                                            */
      __IM  uint32_t CODE       : 2;            /*!< [25..24] CODE                                                             */
      __IM  uint32_t TME0       : 1;            /*!< [26..26] Lowest priority flag for mailbox 0                               */
      __IM  uint32_t TME1       : 1;            /*!< [27..27] Lowest priority flag for mailbox 1                               */
      __IM  uint32_t TME2       : 1;            /*!< [28..28] Lowest priority flag for mailbox 2                               */
      __IM  uint32_t LOW0       : 1;            /*!< [29..29] Lowest priority flag for mailbox 0                               */
      __IM  uint32_t LOW1       : 1;            /*!< [30..30] Lowest priority flag for mailbox 1                               */
      __IM  uint32_t LOW2       : 1;            /*!< [31..31] Lowest priority flag for mailbox 2                               */
    } CAN_TSR_b;
  } ;
  
  union {
    __IOM uint32_t CAN_RF0R;                    /*!< (@ 0x0000000C) CAN_RF0R                                                   */
    
