nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IM  uint32_t FMP0       : 2;            /*!< [1..0] FMP0                                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t FULL0      : 1;            /*!< [3..3] FULL0                                                              */
      __IOM uint32_t FOVR0      : 1;            /*!< [4..4] FOVR0                                                              */
      __IOM uint32_t RFOM0      : 1;            /*!< [5..5] RFOM0                                                              */
    } CAN_RF0R_b;
  } ;
  
  union {
    __IOM uint32_t CAN_RF1R;                    /*!< (@ 0x00000010) CAN_RF1R                                                   */
    
    struct {
      __IM  uint32_t FMP1       : 2;            /*!< [1..0] FMP1                                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t FULL1      : 1;            /*!< [3..3] FULL1                                                              */
      __IOM uint32_t FOVR1      : 1;            /*!< [4..4] FOVR1                                                              */
      __IOM uint32_t RFOM1      : 1;            /*!< [5..5] RFOM1                                                              */
    } CAN_RF1R_b;
  } ;
  
  union {
    __IOM uint32_t CAN_IER;                     /*!< (@ 0x00000014) CAN_IER                                                    */
    
    struct {
      __IOM uint32_t TMEIE      : 1;            /*!< [0..0] TMEIE                                                              */
      __IOM uint32_t FMPIE0     : 1;            /*!< [1..1] FMPIE0                                                             */
      __IOM uint32_t FFIE0      : 1;            /*!< [2..2] FFIE0                                                              */
      __IOM uint32_t FOVIE0     : 1;            /*!< [3..3] FOVIE0                                                             */
      __IOM uint32_t FMPIE1     : 1;            /*!< [4..4] FMPIE1                                                             */
      __IOM uint32_t FFIE1      : 1;            /*!< [5..5] FFIE1                                                              */
      __IOM uint32_t FOVIE1     : 1;            /*!< [6..6] FOVIE1                                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t EWGIE      : 1;            /*!< [8..8] EWGIE                                                              */
      __IOM uint32_t EPVIE      : 1;            /*!< [9..9] EPVIE                                                              */
      __IOM uint32_t BOFIE      : 1;            /*!< [10..10] BOFIE                                                            */
      __IOM uint32_t LECIE      : 1;            /*!< [11..11] LECIE                                                            */
      __IM  uint32_t            : 3;
      __IOM uint32_t ERRIE      : 1;            /*!< [15..15] ERRIE                                                            */
      __IOM uint32_t WKUIE      : 1;            /*!< [16..16] WKUIE                                                            */
      __IOM uint32_t SLKIE      : 1;            /*!< [17..17] SLKIE                                                            */
    } CAN_IER_b;
  } ;
  
  union {
    __IOM uint32_t CAN_ESR;                     /*!< (@ 0x00000018) CAN_ESR                                                    */
    
    struct {
      __IM  uint32_t EWGF       : 1;            /*!< [0..0] EWGF                                                               */
      __IM  uint32_t EPVF       : 1;            /*!< [1..1] EPVF                                                               */
      __IM  uint32_t BOFF       : 1;            /*!< [2..2] BOFF                                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t LEC        : 3;            /*!< [6..4] LEC                                                                */
      __IM  uint32_t            : 9;
      __IM  uint32_t TEC        : 8;            /*!< [23..16] TEC                                                              */
      __IM  uint32_t REC        : 8;            /*!< [31..24] REC                                                              */
    } CAN_ESR_b;
  } ;
  
  union {
    __IOM uint32_t CAN_BTR;                     /*!< (@ 0x0000001C) CAN_BTR                                                    */
    
    struct {
      __IOM uint32_t BRP        : 10;           /*!< [9..0] BRP                                                                */
      __IM  uint32_t            : 6;
      __IOM uint32_t TS1        : 4;            /*!< [19..16] TS1                                                              */
      __IOM uint32_t TS2        : 3;            /*!< [22..20] TS2                                                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t SJW        : 2;            /*!< [25..24] SJW                                                              */
      __IM  uint32_t            : 4;
      __IOM uint32_t LBKM       : 1;            /*!< [30..30] LBKM                                                             */
      __IOM uint32_t SILM       : 1;            /*!< [31..31] SILM                                                             */
    } CAN_BTR_b;
  } ;
  __IM  uint32_t  RESERVED[88];
  
  union {
    __IOM uint32_t CAN_TI0R;                    /*!< (@ 0x00000180) CAN_TI0R                                                   */
    
    struct {
      __IOM uint32_t TXRQ       : 1;            /*!< [0..0] TXRQ                                                               */
      __IOM uint32_t RTR        : 1;            /*!< [1..1] RTR                                                                */
      __IOM uint32_t IDE        : 1;            /*!< [2..2] IDE                                                                */
      __IOM uint32_t EXID       : 18;           /*!< [20..3] EXID                                                              */
      __IOM uint32_t STID       : 11;           /*!< [31..21] STID                                                             */
    } CAN_TI0R_b;
  } ;
  
  union {
    __IOM uint32_t CAN_TDT0R;                   /*!< (@ 0x00000184) CAN_TDT0R                                                  */
    
