nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t DLC        : 4;            /*!< [3..0] DLC                                                                */
      __IM  uint32_t            : 4;
      __IOM uint32_t TGT        : 1;            /*!< [8..8] TGT                                                                */
      __IM  uint32_t            : 7;
      __IOM uint32_t TIME       : 16;           /*!< [31..16] TIME                                                             */
    } CAN_TDT0R_b;
  } ;
  
  union {
    __IOM uint32_t CAN_TDL0R;                   /*!< (@ 0x00000188) CAN_TDL0R                                                  */
    
    struct {
      __IOM uint32_t DATA0      : 8;            /*!< [7..0] DATA0                                                              */
      __IOM uint32_t DATA1      : 8;            /*!< [15..8] DATA1                                                             */
      __IOM uint32_t DATA2      : 8;            /*!< [23..16] DATA2                                                            */
      __IOM uint32_t DATA3      : 8;            /*!< [31..24] DATA3                                                            */
    } CAN_TDL0R_b;
  } ;
  
  union {
    __IOM uint32_t CAN_TDH0R;                   /*!< (@ 0x0000018C) CAN_TDH0R                                                  */
    
    struct {
      __IOM uint32_t DATA4      : 8;            /*!< [7..0] DATA4                                                              */
      __IOM uint32_t DATA5      : 8;            /*!< [15..8] DATA5                                                             */
      __IOM uint32_t DATA6      : 8;            /*!< [23..16] DATA6                                                            */
      __IOM uint32_t DATA7      : 8;            /*!< [31..24] DATA7                                                            */
    } CAN_TDH0R_b;
  } ;
  
  union {
    __IOM uint32_t CAN_TI1R;                    /*!< (@ 0x00000190) CAN_TI1R                                                   */
    
    struct {
      __IOM uint32_t TXRQ       : 1;            /*!< [0..0] TXRQ                                                               */
      __IOM uint32_t RTR        : 1;            /*!< [1..1] RTR                                                                */
      __IOM uint32_t IDE        : 1;            /*!< [2..2] IDE                                                                */
      __IOM uint32_t EXID       : 18;           /*!< [20..3] EXID                                                              */
      __IOM uint32_t STID       : 11;           /*!< [31..21] STID                                                             */
    } CAN_TI1R_b;
  } ;
  
  union {
    __IOM uint32_t CAN_TDT1R;                   /*!< (@ 0x00000194) CAN_TDT1R                                                  */
    
    struct {
      __IOM uint32_t DLC        : 4;            /*!< [3..0] DLC                                                                */
      __IM  uint32_t            : 4;
      __IOM uint32_t TGT        : 1;            /*!< [8..8] TGT                                                                */
      __IM  uint32_t            : 7;
      __IOM uint32_t TIME       : 16;           /*!< [31..16] TIME                                                             */
    } CAN_TDT1R_b;
  } ;
  
  union {
    __IOM uint32_t CAN_TDL1R;                   /*!< (@ 0x00000198) CAN_TDL1R                                                  */
    
    struct {
      __IOM uint32_t DATA0      : 8;            /*!< [7..0] DATA0                                                              */
      __IOM uint32_t DATA1      : 8;            /*!< [15..8] DATA1                                                             */
      __IOM uint32_t DATA2      : 8;            /*!< [23..16] DATA2                                                            */
      __IOM uint32_t DATA3      : 8;            /*!< [31..24] DATA3                                                            */
    } CAN_TDL1R_b;
  } ;
  
  union {
    __IOM uint32_t CAN_TDH1R;                   /*!< (@ 0x0000019C) CAN_TDH1R                                                  */
    
    struct {
      __IOM uint32_t DATA4      : 8;            /*!< [7..0] DATA4                                                              */
      __IOM uint32_t DATA5      : 8;            /*!< [15..8] DATA5                                                             */
      __IOM uint32_t DATA6      : 8;            /*!< [23..16] DATA6                                                            */
      __IOM uint32_t DATA7      : 8;            /*!< [31..24] DATA7                                                            */
    } CAN_TDH1R_b;
  } ;
  
  union {
    __IOM uint32_t CAN_TI2R;                    /*!< (@ 0x000001A0) CAN_TI2R                                                   */
    
    struct {
      __IOM uint32_t TXRQ       : 1;            /*!< [0..0] TXRQ                                                               */
      __IOM uint32_t RTR        : 1;            /*!< [1..1] RTR                                                                */
      __IOM uint32_t IDE        : 1;            /*!< [2..2] IDE                                                                */
      __IOM uint32_t EXID       : 18;           /*!< [20..3] EXID                                                              */
      __IOM uint32_t STID       : 11;           /*!< [31..21] STID                                                             */
    } CAN_TI2R_b;
  } ;
  
  union {
    __IOM uint32_t CAN_TDT2R;                   /*!< (@ 0x000001A4) CAN_TDT2R                                                  */
    
    struct {
      __IOM uint32_t DLC        : 4;            /*!< [3..0] DLC                                                                */
      __IM  uint32_t            : 4;
      __IOM uint32_t TGT        : 1;            /*!< [8..8] TGT                                                                */
      __IM  uint32_t            : 7;
      __IOM uint32_t TIME       : 16;           /*!< [31..16] TIME                                                             */
    } CAN_TDT2R_b;
  } ;
  
  union {
    __IOM uint32_t CAN_TDL2R;                   /*!< (@ 0x000001A8) CAN_TDL2R                                                  */
    
