nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t DATA0      : 8;            /*!< [7..0] DATA0                                                              */
      __IOM uint32_t DATA1      : 8;            /*!< [15..8] DATA1                                                             */
      __IOM uint32_t DATA2      : 8;            /*!< [23..16] DATA2                                                            */
      __IOM uint32_t DATA3      : 8;            /*!< [31..24] DATA3                                                            */
    } CAN_TDL2R_b;
  } ;
  
  union {
    __IOM uint32_t CAN_TDH2R;                   /*!< (@ 0x000001AC) CAN_TDH2R                                                  */
    
    struct {
      __IOM uint32_t DATA4      : 8;            /*!< [7..0] DATA4                                                              */
      __IOM uint32_t DATA5      : 8;            /*!< [15..8] DATA5                                                             */
      __IOM uint32_t DATA6      : 8;            /*!< [23..16] DATA6                                                            */
      __IOM uint32_t DATA7      : 8;            /*!< [31..24] DATA7                                                            */
    } CAN_TDH2R_b;
  } ;
  
  union {
    __IM  uint32_t CAN_RI0R;                    /*!< (@ 0x000001B0) CAN_RI0R                                                   */
    
    struct {
      __IM  uint32_t            : 1;
      __IM  uint32_t RTR        : 1;            /*!< [1..1] RTR                                                                */
      __IM  uint32_t IDE        : 1;            /*!< [2..2] IDE                                                                */
      __IM  uint32_t EXID       : 18;           /*!< [20..3] EXID                                                              */
      __IM  uint32_t STID       : 11;           /*!< [31..21] STID                                                             */
    } CAN_RI0R_b;
  } ;
  
  union {
    __IM  uint32_t CAN_RDT0R;                   /*!< (@ 0x000001B4) CAN_RDT0R                                                  */
    
    struct {
      __IM  uint32_t DLC        : 4;            /*!< [3..0] DLC                                                                */
      __IM  uint32_t            : 4;
      __IM  uint32_t FMI        : 8;            /*!< [15..8] FMI                                                               */
      __IM  uint32_t TIME       : 16;           /*!< [31..16] TIME                                                             */
    } CAN_RDT0R_b;
  } ;
  
  union {
    __IM  uint32_t CAN_RDL0R;                   /*!< (@ 0x000001B8) CAN_RDL0R                                                  */
    
    struct {
      __IM  uint32_t DATA0      : 8;            /*!< [7..0] DATA0                                                              */
      __IM  uint32_t DATA1      : 8;            /*!< [15..8] DATA1                                                             */
      __IM  uint32_t DATA2      : 8;            /*!< [23..16] DATA2                                                            */
      __IM  uint32_t DATA3      : 8;            /*!< [31..24] DATA3                                                            */
    } CAN_RDL0R_b;
  } ;
  
  union {
    __IM  uint32_t CAN_RDH0R;                   /*!< (@ 0x000001BC) CAN_RDH0R                                                  */
    
    struct {
      __IM  uint32_t DATA4      : 8;            /*!< [7..0] DATA4                                                              */
      __IM  uint32_t DATA5      : 8;            /*!< [15..8] DATA5                                                             */
      __IM  uint32_t DATA6      : 8;            /*!< [23..16] DATA6                                                            */
      __IM  uint32_t DATA7      : 8;            /*!< [31..24] DATA7                                                            */
    } CAN_RDH0R_b;
  } ;
  
  union {
    __IM  uint32_t CAN_RI1R;                    /*!< (@ 0x000001C0) CAN_RI1R                                                   */
    
    struct {
      __IM  uint32_t            : 1;
      __IM  uint32_t RTR        : 1;            /*!< [1..1] RTR                                                                */
      __IM  uint32_t IDE        : 1;            /*!< [2..2] IDE                                                                */
      __IM  uint32_t EXID       : 18;           /*!< [20..3] EXID                                                              */
      __IM  uint32_t STID       : 11;           /*!< [31..21] STID                                                             */
    } CAN_RI1R_b;
  } ;
  
  union {
    __IM  uint32_t CAN_RDT1R;                   /*!< (@ 0x000001C4) CAN_RDT1R                                                  */
    
    struct {
      __IM  uint32_t DLC        : 4;            /*!< [3..0] DLC                                                                */
      __IM  uint32_t            : 4;
      __IM  uint32_t FMI        : 8;            /*!< [15..8] FMI                                                               */
      __IM  uint32_t TIME       : 16;           /*!< [31..16] TIME                                                             */
    } CAN_RDT1R_b;
  } ;
  
  union {
    __IM  uint32_t CAN_RDL1R;                   /*!< (@ 0x000001C8) CAN_RDL1R                                                  */
    
    struct {
      __IM  uint32_t DATA0      : 8;            /*!< [7..0] DATA0                                                              */
      __IM  uint32_t DATA1      : 8;            /*!< [15..8] DATA1                                                             */
      __IM  uint32_t DATA2      : 8;            /*!< [23..16] DATA2                                                            */
      __IM  uint32_t DATA3      : 8;            /*!< [31..24] DATA3                                                            */
    } CAN_RDL1R_b;
  } ;
  
  union {
    __IM  uint32_t CAN_RDH1R;                   /*!< (@ 0x000001CC) CAN_RDH1R                                                  */
    
