nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IM  uint32_t DATA4      : 8;            /*!< [7..0] DATA4                                                              */
      __IM  uint32_t DATA5      : 8;            /*!< [15..8] DATA5                                                             */
      __IM  uint32_t DATA6      : 8;            /*!< [23..16] DATA6                                                            */
      __IM  uint32_t DATA7      : 8;            /*!< [31..24] DATA7                                                            */
    } CAN_RDH1R_b;
  } ;
  __IM  uint32_t  RESERVED1[12];
  
  union {
    __IOM uint32_t CAN_FMR;                     /*!< (@ 0x00000200) CAN_FMR                                                    */
    
    struct {
      __IOM uint32_t FINIT      : 1;            /*!< [0..0] FINIT                                                              */
      __IM  uint32_t            : 7;
      __IOM uint32_t CAN2SB     : 6;            /*!< [13..8] CAN2SB                                                            */
    } CAN_FMR_b;
  } ;
  
  union {
    __IOM uint32_t CAN_FM1R;                    /*!< (@ 0x00000204) CAN_FM1R                                                   */
    
    struct {
      __IOM uint32_t FBM0       : 1;            /*!< [0..0] Filter mode                                                        */
      __IOM uint32_t FBM1       : 1;            /*!< [1..1] Filter mode                                                        */
      __IOM uint32_t FBM2       : 1;            /*!< [2..2] Filter mode                                                        */
      __IOM uint32_t FBM3       : 1;            /*!< [3..3] Filter mode                                                        */
      __IOM uint32_t FBM4       : 1;            /*!< [4..4] Filter mode                                                        */
      __IOM uint32_t FBM5       : 1;            /*!< [5..5] Filter mode                                                        */
      __IOM uint32_t FBM6       : 1;            /*!< [6..6] Filter mode                                                        */
      __IOM uint32_t FBM7       : 1;            /*!< [7..7] Filter mode                                                        */
      __IOM uint32_t FBM8       : 1;            /*!< [8..8] Filter mode                                                        */
      __IOM uint32_t FBM9       : 1;            /*!< [9..9] Filter mode                                                        */
      __IOM uint32_t FBM10      : 1;            /*!< [10..10] Filter mode                                                      */
      __IOM uint32_t FBM11      : 1;            /*!< [11..11] Filter mode                                                      */
      __IOM uint32_t FBM12      : 1;            /*!< [12..12] Filter mode                                                      */
      __IOM uint32_t FBM13      : 1;            /*!< [13..13] Filter mode                                                      */
      __IOM uint32_t FBM14      : 1;            /*!< [14..14] Filter mode                                                      */
      __IOM uint32_t FBM15      : 1;            /*!< [15..15] Filter mode                                                      */
      __IOM uint32_t FBM16      : 1;            /*!< [16..16] Filter mode                                                      */
      __IOM uint32_t FBM17      : 1;            /*!< [17..17] Filter mode                                                      */
      __IOM uint32_t FBM18      : 1;            /*!< [18..18] Filter mode                                                      */
      __IOM uint32_t FBM19      : 1;            /*!< [19..19] Filter mode                                                      */
      __IOM uint32_t FBM20      : 1;            /*!< [20..20] Filter mode                                                      */
      __IOM uint32_t FBM21      : 1;            /*!< [21..21] Filter mode                                                      */
      __IOM uint32_t FBM22      : 1;            /*!< [22..22] Filter mode                                                      */
      __IOM uint32_t FBM23      : 1;            /*!< [23..23] Filter mode                                                      */
      __IOM uint32_t FBM24      : 1;            /*!< [24..24] Filter mode                                                      */
      __IOM uint32_t FBM25      : 1;            /*!< [25..25] Filter mode                                                      */
      __IOM uint32_t FBM26      : 1;            /*!< [26..26] Filter mode                                                      */
      __IOM uint32_t FBM27      : 1;            /*!< [27..27] Filter mode                                                      */
    } CAN_FM1R_b;
  } ;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t CAN_FS1R;                    /*!< (@ 0x0000020C) CAN_FS1R                                                   */
    
    struct {
      __IOM uint32_t FSC0       : 1;            /*!< [0..0] Filter scale configuration                                         */
      __IOM uint32_t FSC1       : 1;            /*!< [1..1] Filter scale configuration                                         */
      __IOM uint32_t FSC2       : 1;            /*!< [2..2] Filter scale configuration                                         */
      __IOM uint32_t FSC3       : 1;            /*!< [3..3] Filter scale configuration                                         */
      __IOM uint32_t FSC4       : 1;            /*!< [4..4] Filter scale configuration                                         */
      __IOM uint32_t FSC5       : 1;            /*!< [5..5] Filter scale configuration                                         */
      __IOM uint32_t FSC6       : 1;            /*!< [6..6] Filter scale configuration                                         */
      __IOM uint32_t FSC7       : 1;            /*!< [7..7] Filter scale configuration                                         */
      __IOM uint32_t FSC8       : 1;            /*!< [8..8] Filter scale configuration                                         */
      __IOM uint32_t FSC9       : 1;            /*!< [9..9] Filter scale configuration                                         */
      __IOM uint32_t FSC10      : 1;            /*!< [10..10] Filter scale configuration                                       */
      __IOM uint32_t FSC11      : 1;            /*!< [11..11] Filter scale configuration                                       */
      __IOM uint32_t FSC12      : 1;            /*!< [12..12] Filter scale configuration                                       */
      __IOM uint32_t FSC13      : 1;            /*!< [13..13] Filter scale configuration                                       */
      __IOM uint32_t FSC14      : 1;            /*!< [14..14] Filter scale configuration                                       */
      __IOM uint32_t FSC15      : 1;            /*!< [15..15] Filter scale configuration                                       */
      __IOM uint32_t FSC16      : 1;            /*!< [16..16] Filter scale configuration                                       */
      __IOM uint32_t FSC17      : 1;            /*!< [17..17] Filter scale configuration                                       */
      __IOM uint32_t FSC18      : 1;            /*!< [18..18] Filter scale configuration                                       */
      __IOM uint32_t FSC19      : 1;            /*!< [19..19] Filter scale configuration                                       */
      __IOM uint32_t FSC20      : 1;            /*!< [20..20] Filter scale configuration                                       */
      __IOM uint32_t FSC21      : 1;            /*!< [21..21] Filter scale configuration                                       */
      __IOM uint32_t FSC22      : 1;            /*!< [22..22] Filter scale configuration                                       */
      __IOM uint32_t FSC23      : 1;            /*!< [23..23] Filter scale configuration                                       */
      __IOM uint32_t FSC24      : 1;            /*!< [24..24] Filter scale configuration                                       */
      __IOM uint32_t FSC25      : 1;            /*!< [25..25] Filter scale configuration                                       */
      __IOM uint32_t FSC26      : 1;            /*!< [26..26] Filter scale configuration                                       */
      __IOM uint32_t FSC27      : 1;            /*!< [27..27] Filter scale configuration                                       */
    } CAN_FS1R_b;
  } ;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t CAN_FFA1R;                   /*!< (@ 0x00000214) CAN_FFA1R                                                  */
    
