nicories/gyromouse/level/include/STM32F042x.h
    struct {
      __IOM uint32_t FFA0       : 1;            /*!< [0..0] Filter FIFO assignment for filter 0                                */
      __IOM uint32_t FFA1       : 1;            /*!< [1..1] Filter FIFO assignment for filter 1                                */
      __IOM uint32_t FFA2       : 1;            /*!< [2..2] Filter FIFO assignment for filter 2                                */
      __IOM uint32_t FFA3       : 1;            /*!< [3..3] Filter FIFO assignment for filter 3                                */
      __IOM uint32_t FFA4       : 1;            /*!< [4..4] Filter FIFO assignment for filter 4                                */
      __IOM uint32_t FFA5       : 1;            /*!< [5..5] Filter FIFO assignment for filter 5                                */
      __IOM uint32_t FFA6       : 1;            /*!< [6..6] Filter FIFO assignment for filter 6                                */
      __IOM uint32_t FFA7       : 1;            /*!< [7..7] Filter FIFO assignment for filter 7                                */
      __IOM uint32_t FFA8       : 1;            /*!< [8..8] Filter FIFO assignment for filter 8                                */
      __IOM uint32_t FFA9       : 1;            /*!< [9..9] Filter FIFO assignment for filter 9                                */
      __IOM uint32_t FFA10      : 1;            /*!< [10..10] Filter FIFO assignment for filter 10                             */
      __IOM uint32_t FFA11      : 1;            /*!< [11..11] Filter FIFO assignment for filter 11                             */
      __IOM uint32_t FFA12      : 1;            /*!< [12..12] Filter FIFO assignment for filter 12                             */
      __IOM uint32_t FFA13      : 1;            /*!< [13..13] Filter FIFO assignment for filter 13                             */
      __IOM uint32_t FFA14      : 1;            /*!< [14..14] Filter FIFO assignment for filter 14                             */
      __IOM uint32_t FFA15      : 1;            /*!< [15..15] Filter FIFO assignment for filter 15                             */
      __IOM uint32_t FFA16      : 1;            /*!< [16..16] Filter FIFO assignment for filter 16                             */
      __IOM uint32_t FFA17      : 1;            /*!< [17..17] Filter FIFO assignment for filter 17                             */
      __IOM uint32_t FFA18      : 1;            /*!< [18..18] Filter FIFO assignment for filter 18                             */
      __IOM uint32_t FFA19      : 1;            /*!< [19..19] Filter FIFO assignment for filter 19                             */
      __IOM uint32_t FFA20      : 1;            /*!< [20..20] Filter FIFO assignment for filter 20                             */
      __IOM uint32_t FFA21      : 1;            /*!< [21..21] Filter FIFO assignment for filter 21                             */
      __IOM uint32_t FFA22      : 1;            /*!< [22..22] Filter FIFO assignment for filter 22                             */
      __IOM uint32_t FFA23      : 1;            /*!< [23..23] Filter FIFO assignment for filter 23                             */
      __IOM uint32_t FFA24      : 1;            /*!< [24..24] Filter FIFO assignment for filter 24                             */
      __IOM uint32_t FFA25      : 1;            /*!< [25..25] Filter FIFO assignment for filter 25                             */
      __IOM uint32_t FFA26      : 1;            /*!< [26..26] Filter FIFO assignment for filter 26                             */
      __IOM uint32_t FFA27      : 1;            /*!< [27..27] Filter FIFO assignment for filter 27                             */
    } CAN_FFA1R_b;
  } ;
  __IM  uint32_t  RESERVED4;
  
  union {
    __IOM uint32_t CAN_FA1R;                    /*!< (@ 0x0000021C) CAN_FA1R                                                   */
    
    struct {
      __IOM uint32_t FACT0      : 1;            /*!< [0..0] Filter active                                                      */
      __IOM uint32_t FACT1      : 1;            /*!< [1..1] Filter active                                                      */
      __IOM uint32_t FACT2      : 1;            /*!< [2..2] Filter active                                                      */
      __IOM uint32_t FACT3      : 1;            /*!< [3..3] Filter active                                                      */
      __IOM uint32_t FACT4      : 1;            /*!< [4..4] Filter active                                                      */
      __IOM uint32_t FACT5      : 1;            /*!< [5..5] Filter active                                                      */
      __IOM uint32_t FACT6      : 1;            /*!< [6..6] Filter active                                                      */
      __IOM uint32_t FACT7      : 1;            /*!< [7..7] Filter active                                                      */
      __IOM uint32_t FACT8      : 1;            /*!< [8..8] Filter active                                                      */
      __IOM uint32_t FACT9      : 1;            /*!< [9..9] Filter active                                                      */
      __IOM uint32_t FACT10     : 1;            /*!< [10..10] Filter active                                                    */
      __IOM uint32_t FACT11     : 1;            /*!< [11..11] Filter active                                                    */
      __IOM uint32_t FACT12     : 1;            /*!< [12..12] Filter active                                                    */
      __IOM uint32_t FACT13     : 1;            /*!< [13..13] Filter active                                                    */
      __IOM uint32_t FACT14     : 1;            /*!< [14..14] Filter active                                                    */
      __IOM uint32_t FACT15     : 1;            /*!< [15..15] Filter active                                                    */
      __IOM uint32_t FACT16     : 1;            /*!< [16..16] Filter active                                                    */
      __IOM uint32_t FACT17     : 1;            /*!< [17..17] Filter active                                                    */
      __IOM uint32_t FACT18     : 1;            /*!< [18..18] Filter active                                                    */
      __IOM uint32_t FACT19     : 1;            /*!< [19..19] Filter active                                                    */
      __IOM uint32_t FACT20     : 1;            /*!< [20..20] Filter active                                                    */
      __IOM uint32_t FACT21     : 1;            /*!< [21..21] Filter active                                                    */
      __IOM uint32_t FACT22     : 1;            /*!< [22..22] Filter active                                                    */
      __IOM uint32_t FACT23     : 1;            /*!< [23..23] Filter active                                                    */
      __IOM uint32_t FACT24     : 1;            /*!< [24..24] Filter active                                                    */
      __IOM uint32_t FACT25     : 1;            /*!< [25..25] Filter active                                                    */
      __IOM uint32_t FACT26     : 1;            /*!< [26..26] Filter active                                                    */
      __IOM uint32_t FACT27     : 1;            /*!< [27..27] Filter active                                                    */
    } CAN_FA1R_b;
  } ;
  __IM  uint32_t  RESERVED5[8];
  
  union {
    __IOM uint32_t F0R1;                        /*!< (@ 0x00000240) Filter bank 0 register 1                                   */
    
