nicories/gyromouse/level/include/STM32F042x.h
/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define CRC_BASE                    0x40023000UL
#define GPIOF_BASE                  0x48001400UL
#define GPIOC_BASE                  0x48000800UL
#define GPIOB_BASE                  0x48000400UL
#define GPIOA_BASE                  0x48000000UL
#define SPI1_BASE                   0x40013000UL
#define SPI2_BASE                   0x40003800UL
#define PWR_BASE                    0x40007000UL
#define I2C1_BASE                   0x40005400UL
#define IWDG_BASE                   0x40003000UL
#define WWDG_BASE                   0x40002C00UL
#define TIM1_BASE                   0x40012C00UL
#define TIM2_BASE                   0x40000000UL
#define TIM3_BASE                   0x40000400UL
#define TIM14_BASE                  0x40002000UL
#define EXTI_BASE                   0x40010400UL
#define NVIC_BASE                   0xE000E100UL
#define DMA_BASE                    0x40020000UL
#define RCC_BASE                    0x40021000UL
#define SYSCFG_BASE                 0x40010000UL
#define ADC_BASE                    0x40012400UL
#define USART1_BASE                 0x40013800UL
#define USART2_BASE                 0x40004400UL
#define COMP_BASE                   0x4001001CUL
#define RTC_BASE                    0x40002800UL
#define TIM16_BASE                  0x40014400UL
#define TIM17_BASE                  0x40014800UL
#define TSC_BASE                    0x40024000UL
#define CEC_BASE                    0x40007800UL
#define Flash_BASE                  0x40022000UL
#define DBGMCU_BASE                 0x40015800UL
#define USB_BASE                    0x40005C00UL
#define CRS_BASE                    0x40006C00UL
#define CAN_BASE                    0x40006400UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

/* #define CRC                         ((CRC_Type*)               CRC_BASE) */
#define GPIOF                       ((GPIOF_Type*)             GPIOF_BASE)
#define GPIOC                       ((GPIOF_Type*)             GPIOC_BASE)
#define GPIOB                       ((GPIOF_Type*)             GPIOB_BASE)
#define GPIOA                       ((GPIOA_Type*)             GPIOA_BASE)
#define I2C1                        ((I2C1_Type*)              I2C1_BASE)
#define TIM2                        ((TIM2_Type*)              TIM2_BASE)
#define USART2                      ((USART1_Type*)            USART2_BASE)
#define NVIC                        ((NVIC_Type*)              NVIC_BASE)
/* #define SPI1                        ((SPI1_Type*)              SPI1_BASE) */
/* #define SPI2                        ((SPI1_Type*)              SPI2_BASE) */
/* #define PWR                         ((PWR_Type*)               PWR_BASE) */
/* #define IWDG                        ((IWDG_Type*)              IWDG_BASE) */
/* #define WWDG                        ((WWDG_Type*)              WWDG_BASE) */
/* #define TIM1                        ((TIM1_Type*)              TIM1_BASE) */
/* #define TIM3                        ((TIM2_Type*)              TIM3_BASE) */
/* #define TIM14                       ((TIM14_Type*)             TIM14_BASE) */
/* #define EXTI                        ((EXTI_Type*)              EXTI_BASE) */
/* #define DMA                         ((DMA_Type*)               DMA_BASE) */
/* #define RCC                         ((RCC_Type*)               RCC_BASE) */
/* #define SYSCFG                      ((SYSCFG_Type*)            SYSCFG_BASE) */
/* #define ADC                         ((ADC_Type*)               ADC_BASE) */
/* #define USART1                      ((USART1_Type*)            USART1_BASE) */
/* #define COMP                        ((COMP_Type*)              COMP_BASE) */
/* #define RTC                         ((RTC_Type*)               RTC_BASE) */
/* #define TIM16                       ((TIM16_Type*)             TIM16_BASE) */
/* #define TIM17                       ((TIM16_Type*)             TIM17_BASE) */
/* #define TSC                         ((TSC_Type*)               TSC_BASE) */
/* #define CEC                         ((CEC_Type*)               CEC_BASE) */
/* #define Flash                       ((Flash_Type*)             Flash_BASE) */
/* #define DBGMCU                      ((DBGMCU_Type*)            DBGMCU_BASE) */
/* #define USB                         ((USB_Type*)               USB_BASE) */
/* #define CRS                         ((CRS_Type*)               CRS_BASE) */
/* #define CAN                         ((CAN_Type*)               CAN_BASE) */

/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif

#endif /* STM32F042X_H */


/** @} */ /* End of group STM32F042x */

/** @} */ /* End of group  */
